roles = 
[
	{
		"Good": 
		[
			{
				"Name": "Agent",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "betrayalImages/agent.png",
				"Description": "Your whole life, you've been watching others. Your scouting skills have stayed intact and led you to prepare for a life-threatening moment like this.",
				"Abilities": ["Follow - x3 - Common - 1000 - You will know everything your target does for 1 day from use. Does not include perk-based actions.",
					"Spy - x3 - Common - 1000 - You will know everything that happens to your target 1 day from use.",
					"Hidden - x2 - Uncommon - 1500 - For 1 day from the usage of the ability, anything done on you will be reflected back to the user."],
				"Perks": ["Hawkeye - If someone steals from you, you will know who did it.",
					"Organized - Your attack cannot be blocked or tampered with in any way.",
					"Tracker - If anyone does a positive action to your allies, you will know who gave who and what it was."],
				"Achievements": ["[Master Agent] - Obtain all Agent achievements",
					"[Pro Hider] - Successfully reflect 4 actions with Hidden",
					"[Stalker] - See 3 abilities or items used out of Follow",
					"[Observer] - See 3 abilities or items used out of Spy"]
			},
			{
				"Name": "Analyst",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "betrayalImages/analyst.png",
				"Description": "You're a street smart person, capable of using signs and signals to see past the surface. You might just be the smartest there ever was, or at least you think so.",
				"Abilities": ["Chemistry - x3 - Common - 500 - Select 2 people by name, if they are allies, you will be told, and can select another person, this loops multiple times.",
					"Vibe Check - x5 - Common - 750 - Select 2 people, you will know if they are the same alignment. You cannot select the same person more than twice.",
					"Subtraction - x3 - Uncommon - 1000 - Select someone, view their alliance’s items. These items will be shown combined with each other. You also find out about any inventory affecting effects on the player you chose.",
					"Inspection Zone - x1 - Uncommon - 1500 - Upon use, you will know everything to affect you within the next day, and who did it. If someone tries to attack you, you will dodge it. If someone tries to inflict you with a negative status, it will reflect back onto them."],
				"Perks": ["Face Reader - If an ally gains info feedback from anything, you will be told the information as well.",
					"That Much Smarter - Information items can be upgraded freely by you, or, have 2 uses. Info AAs can be upgraded by you as well.",
					"X-Ray Vision - Any form of investigation done by you cannot be affected by perks or abilities, assuming the target is visitable."],
				"Achievements": ["[Master Analyst] - Obtain all Analyst achievements",
					"[Full View] - Use Subtraction to see a legendary or greater item or 4 or more items",
					"[Well Connected] - Use chemistry 2 times with one charge",
					"[Inspected] - View at least 3 visits via inspection zone"]
			},
			{
				"Name": "Biker",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "betrayalImages/biker.png",
				"Description": "Apparently nobody else in this damn game owns a vehicle, all you want is the wind in your hair though. Who cares if a few people get run over?",
				"Abilities": ["Burning Rubber - x4 - Rare - 2000 - Target somebody, either: Clear all negative statuses on them, and everybody who visits them negatively or neutrally for the next day will be burned OR burn them, and everybody who visits them positively within the next day will also burn.",
					"Stick With the Pack - x1 - Epic - 4500 - Target an ally, inflicting them with Rev Up permanently.",
					"Lunch Break - x1 - Epic - 4500 - Disable Rev Up, Rider of the Storm, and all uses of Burning Rubber for 1 day and be Death Immune. If not Biker, just become Death Immune for 1 day."],
				"Perks": ["Motor Gang - If you have an alive ally, you have 2 AP. Every good within your alliance gains an additional +1 luck, as well as yourself.",
					"Rider of the Storm - If you have an alive ally, you gain immunity to paralysis, burn, freeze, and your ability usage can’t be blocked.",
					"Rev Up - All timed statuses and abilities happen in half the time for you, not including curse, burn, paralysis, or mass game effects.",
					"Full-Throttle Slam - If an ally is attacked, ram the attacker with your bike, dealing 3 damage to them, you find out who they are and their role."],
				"Achievements": ["[Master Biker] - Obtain all Biker achievements",
					"[Fastest Bike in the West] - Have Rev Up and Stick With the Pack affect 4 or more timed statuses and abilities",
					"[Fueled Up] - Have Lunch Break allow you to avoid death for a day",
					"[Eye For An Eye] - Kill someone with Full-Throttle Slam"]
			},
			{
				"Name": "Cerberus",
				"HP": "10 HP",
				"AP": "1 AP + Burn + Freeze (no extra damage)",
				"Color": "lime",
				"Image": "betrayalImages/cerberus.png",
				"Description": "A demon tasked with protecting the gates of hell, having followed the overlord, takes up protecting others as its main task.",
				"Abilities": ["Fire Guard - x2 - Epic - 2200 - Select someone, for 1 day you will know of any negative visits to the person, and can decide to reverse each effect, burn the visitor, or do nothing at all. This includes all negatives such as damage.",
					"Ethereal Healing - x2 - Epic - 3800 - Select 2 people, removing all negatives from the first and putting them on the second, and removing all positives from the second onto the first. You can select dead people.",
					"Lava Wall - x2 - Rare - 2200 - When used, if an ally is visited within the next day, burns the visitor and destroys their lowest tier item. The burn fails if already burning, but still has an item destroyed."],
				"Perks": ["Spare Heads - Burn and freeze attackers.",
					"Hades Hound - You are immune to Frozen and Burned.",
					"Ash Formation - Any items you cause to be burnt away, you gain. This includes Lava Walls' item destruction."],
				"Achievements": ["[Master Cerberus] - Obtain all 3 Cerberus achievements",
					"[Underworld's Guard] - Successfully save allies from 5 negatives via Fire Guard",
					"[Ethereal Sight] - Successfully use Ethereal Healing to swap 4 positives/negatives",
					"[Ashes to Riches] - Gain 3 items via Ash Formation"]
			},
			{
				"Name": "Detective",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "betrayalImages/detective.png",
				"Description": "Your life revolves around finding information and using it to your advantage, and that's what you plan to do.",
				"Abilities": ["Search - x5 - Common - 700 - Find out what type of action your target most recently did (investigative, killing, healing etc) and the player they used it on.",
					"Interrogate - x3 - Uncommon - 1500 - You're given 2 possible roles that the person you select could be, one is a random false role and the other is their actual role.",
					"Solve - x0 - Uncommon - 1000 - Figure out any piece of information of your choice about a player. Gain a charge for this every day if you are a Detective."],
				"Perks": ["Clever - Immune to Blackmailed, Disabled and Despaired.",
					"Self-Defence - If anyone tries to attack you, they will fail and you will give them Blackmailed. Additionally, you find out their name & role."],
				"Achievements": ["[Master Detective] - Obtain all Detective achievements",
					"[Karate Block] - Have someone attack you and fail",
					"[Caveira] - Interrogate 3 different people from 3 different factions",
					"[Dedicated] - Use Solve 5 times in a game"]
			},
			{
				"Name": "Fisherman",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "betrayalImages/fisherman.png",
				"Description": "You're a relaxed, level-handed guy who just likes to catch fish, so much that you can use your fishing skills for various other things",
				"Abilities": ["Reel - x3 - Uncommon - 1000 - Select a person and steal their most recent item; if they are opposite your alignment, you will see their inventory and can choose what item to steal.",
					"Fishing Trip - x3 - Rare - 1500 - You receive a random common item or AA (you choose which). The more times you use Fishing Trip the higher the rarity of item/AA you will get. Upon mythical loop to common.",
					"Hooked - x2 - Epic - 2800 - For 1 day, any items/AAs your target gives or receives, you'll take instead.",
					"Bait - x2 - Epic - 3100 - Select someone: For 1 day any action people use on another player in your zone (excluding you & the target) will redirect towards the target. If the user or the target dies, this ability stops."],
				"Perks": ["Fishing Buddies - If you have an alive ally, gain an extra item during item rains."],
				"Achievements": ["[Master Fisherman] - Obtain all Fisherman achievements",
					"[Gone Fishin'] - Obtain a legendary item/AA with Fishing Trip",
					"[Good Haul] - Steal an epic or higher item/AA",
					"[The Loch-Ness Monster] - Redirect 4 visits"]
			},
			{
				"Name": "Gunman",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "betrayalImages/gunman.png",
				"Description": "You want to stop evil and prove yourself worthy, that is your only goal. You only have one shot at life, literally. Make sure it’s worth it or it will really haunt you.",
				"Abilities": ["Fire - x3 - Legendary - 4500 - Shoot a player, dealing 3 damage. If you deal damage to someone of your own alignment, deal 3 damage to yourself."],
				"Perks": ["Confidence - Once you’ve killed someone not with your alignment, you become immune to negative status effects.",
					"Ignorant - Cannot be redirected to another target when you attack somebody.",
					"Justice’s Gift - If you kill someone with the opposite alignment, you will obtain an Unreliable Wish and any AAs, items and money they had."],
				"Achievements": ["[Master Gunman] - Obtain all Gunman achievements",
					"[Demon Slayer] - Kill 2 people successfully",
					"[Trigger Happy] - Gain the Confidence perk",
					"[Dictator] - Shoot someone who has attacked you multiple times (more then twice)"]
			},
			{
				"Name": "Hero",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "betrayalImages/hero.png",
				"Description": "Your ambition was always to do something magnificent and brave. It’s always what you wanted to do, and you will try as hard as you can to achieve that goal.",
				"Abilities": ["Venture - x6 - Common - 300 - Find out if a player is good or not.",
					"Mentor - x1 - Epic - 2800 - Learn one ability of an ally of your choice.",
					"Protection - x3 - Uncommon - 2500 - Make an alliance member Death Immune. If Hero, you can give a charge of this as an AA to others. Can’t self pick."],
				"Perks": ["Heroic Power - You get x1.25 higher Immunity Card chances and +3 Luck.",
					"Gilded - Every immunity card you get, increase the immunity card chances by 2.5%. This is added after other chance effects. Hero can get bonuses in an alliance alone."],
				"Achievements": ["[Master Hero] - Obtain all Hero achievements",
					"[Uniquely Taught] - Successfully use Mentor on a non AA",
					"[Good Doers] - Find 4 good people or find all good people in the game",
					"[Legendary Protector] - Save 2 people using protection"]
			},
			{
				"Name": "Hydra",
				"HP": "10 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "betrayalImages/hydra.png",
				"Description": "A multi-headed beast out on a quest to redeem itself for a place with God.",
				"Abilities": ["Head Slam - x0 - Rare - 2000 - Select someone, destroy their lowest tier item and inflict a negative status you are immune to of choice. Must cycle through all immunities before inflicting the same again.",
					"Chomp - x0 - Uncommon - 1800 - Select someone; they will be unable to perform actions to people other than their allies for half a day. Can stack.",
					"Tear Out - x0 - Rare - 2000 - Select someone, dealing 1 damage. Inflict a negative status of choice you are not immune to. Must cycle through all non-immunities before inflicting the same again.",
					"Head Shield - x0 - Epic - 3200 - Select as many players as things you are immune to. If 0, pick 1. Negative actions on them will fail to work, the person using it will keep the charge but be unable to act for a quarter of a day. Neutral visits will inform you and the target what occurred and who did it. Lasts half a day. Can stack. You can bypass this.",
					"Visceral Roar - x0 - Epic - 2000 - Select someone, they will pick as many negative statuses they want and will gain attack power equal. Will be inflicted with them all the next day. Selecting immunities will remove immunities."],
				"Perks": ["Regenerative - If inflicted with a negative status, gain immunity to it after it is cured/worn off. If blocked or redirected, develop immunity to that interaction - all immunities develop on day end.",
					"Multi-headed Stare-down - If you perform multiple actions, you can have them all register as a single visit, even to multiple people. Your action will register as the most convenient type.",
					"Rejuvenative Aura - Players in the same zone that get cured of a status will develop immunity to it. You may turn this off/on, and may pick which players gain this.",
					"Head Growing - Each time you [or ally] gain an immunity, and/or a new day starts, gain a base ability charge [Max 5 per day from immunities]."],
				"Achievements": ["[Master Hydra] - Obtain all Hydra achievements",
					"[The Infinity Heads] - Gain immunity to 5 statuses or more",
					"[Battlecry] - Give or gain attack power of 3 or more with Visceral Roar",
					"[Pet Me] - Block 3 targets or more throughout the game using Head-Shield and Chomp"]
			},
			{
				"Name": "Judge",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "betrayalImages/judge.png",
				"Description": "You want the world to be a utopia, where it’s free of crime, poverty and hatred. You want the evils gone, but if you fail you will gradually weaken yourself.",
				"Abilities": ["Lawful Trial - x1 - Epic - 2800 - Changes the day to have two attacks per person. You have 1 more AP and 5 more max HP for 1 day.",
					"Overrule - x2 - Epic - 2400 - Each attack to the player of choice deals 1 more damage. Also removes any Death Immune.",
					"The Hammer - x1 - Epic - 2800 - Use this to completely stop daily attacks. No one can attack today."],
				"Perks": ["Justice - If all people killed during the Lawful trial are not your alignment then you gain a random Epic-Mythical tier item.",
					"Dystopia - If all people killed are your alignment during the Lawful trial then you take 2 HP damage and are despaired for 1 day."],
				"Achievements": ["[Master Judge] - Obtain all Judge achievements",
					"[Hammer time] - Save an ally with The Hammer",
					"[Bypasser] - Bypass 1 Death Immunity with overrules",
					"[Courts Master] - Gain the Justice perk"]
			},
			{
				"Name": "Manager",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "betrayalImages/manager.png",
				"Description": "You’re experienced at organization and managing people and will do whatever it takes to create the perfect alliance.",
				"Abilities": ["Kick - x4 - Uncommon - 1000 - 1 charge, Remove alliance coin and luck bonuses for 1 day from the target. 2 charges, Also make the target lose 25% of their total coins which is evenly spread throughout your alliance and your personal luck goes up by 1. Getting killed will stop any active kicks.",
					"Contract - x2 - Uncommon - 1000 - Give an ally +25% coins value. If they are your alignment, gain +25% for yourself too.",
					"Discount - x4 - Uncommon - 1000 - Give yourself or an ally a 50% reduced price on every buyable item until you/they buy one. Does not stack to get more reduction.",
					"Ban - x1 - Epic - 2800 - Remove all alliance coins and luck bonuses from a chosen player and allies for 1 day. If you die the ban goes off."],
				"Perks": ["Tradesman - Your luck goes up by 1 every time you receive an item from a player.",
					"Money Transfer - Allows you to transfer an amount of coins to anyone within your alliance. Any ally can also transfer the coins."],
				"Achievements": ["[Master Manager] - Obtain all Manager achievements",
					"[Client] - Contract the same person twice",
					"[Clearing price] - Discount an item 4 times",
					"[Removal] - Kick 2 people"]
			},
			{
				"Name": "Mecha",
				"HP": "10 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "betrayalImages/mecha.png",
				"Description": "You are a defensive robotic machine that takes pleasure in military and undercover procedures.",
				"Abilities": ["Entrapment - x2 - Rare - 1800 - Select someone, if they attempt to harm you within the next half a day, evade it and inflict the harm back on them, along with gaining a charge/item of whatever they used. If it is a base attack, gain that player’s attack power for half a day.",
					"Target Fire - x1 - Legendary - 4000 - Select 2 people, if one harms the other within the next day, both get hit by it 3 fold.",
					"Smoke Grenade - x2 - Rare - 2200 - Select someone, if they attempt to harm anyone within your alliance within the next day, cause it to fail, and give them 3 drunk stacks, burn, and curse.",
					"Last Resort - x1 - Epic - 4800 - Select someone, they are Death Immune. If saved from death, all attackers on the target will become paralyzed."],
				"Perks": ["Enhanced Learning - Each time your base abilities are successfully used, gain 1 luck and 5% coins.",
					"Lock On - Redirections will work on you, but also inflict your original target and redirection users with the ability/item as well"],
				"Achievements": ["[Master Mecha] - Obtain all Mecha achievements",
					"[It's a trap!] - Successfully trigger Entrapment 3 times",
					"[Now you see me...] - Use smoke grenade to protect an ally 3 times",
					"[Final Gambit] - Successfully use Last Resort"]
			},
			{
				"Name": "Medium",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "betrayalImages/medium.png",
				"Description": "You're a quiet, passionate and lonely soul who has the ability to talk to the dead.",
				"Abilities": ["Bury Alive - x2 - Rare - 2100 - Bury someone for 1 day, making them count as dead and finding out their role. They cannot act outside of what they could do when dead, except talk. Abilities that work on dead players will now work on your targets.",
					"Preserve - x2 - Uncommon - 2100 - If someone was killed, within 1 day, you can use this on them to make them survive for 1 more day. If they are healed, ethereal healed, breaked, saving grace, protection or blessed within that time they will avoid death and heal to full, if not, you take any money they have on them.",
					"Soul Seer - x1 - Uncommon - 1250 - Select a player, upon them being killed, you can see their role, their items, money and their last actions. If Medium, you gain a charge upon the selected player dying. If used on yourself and you are killed, you cannot be stolen from."],
				"Perks": ["Service - If you save anyone with Preserve, they deal half damage to you for the rest of the game.",
					"Haunted Tombstone - Cut a player of your choice's coins in half when you’re killed, you choose who gets the coins."],
				"Achievements": ["[Master Medium] - Obtain all Medium achievements",
					"[Preservation] - Gain 1000 coins or revive someone via preserve",
					"[Death Data] - Use Soul Seer on 3 people",
					"[Living Line Blur] - Bury someone alive, saving them from death, or getting a dead-only ability used on them"]
			},
			{
				"Name": "Nurse",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "betrayalImages/nurse.png",
				"Description": "Your only desire in life is to heal others and help the ones you need to survive yourself.",
				"Abilities": ["Heal - x3 - Uncommon - 2000 - Heal your target for 5 HP.",
					"Vaccinate - x3 - Uncommon - 1800 - Your target becomes immune to a status effect of your choice.",
					"Cure - x3 - Uncommon - 1500 - Cures your target of any status effect[s] of your choice."],
				"Perks": ["Powerful Immunity - Immune to negative status effects.",
					"Medical Bills - You may charge your target an amount of coins when using any of your abilities on somebody. If they refuse the bills, you will get your ability charge back."],
				"Achievements": ["[Master Nurse] - Obtain all Nurse achievements",
					"[Head Doctor] - Heal 3 people to full HP",
					"[Anti-vaxxers’ Worst Nightmare] - Vaccinate 1 person three times",
					"[Private Healthcare] - Earn 1500 coins or more from Medical Bills"]
			},
			{
				"Name": "Seraph",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "betrayalImages/seraph.png",
				"Description": "You believe yourself to be a higher angel incarnated in physical form, here to show sinners the correct path.",
				"Abilities": ["Purification - x2 - Uncommon - 1800 - Select someone, all negative statues on them are inflicted back on the original users.",
					"Ascend - x2 - Uncommon - 2200 - Soar into the air, and see who visits yourself and allies for the next half a day. You will avoid negatives while this is active.",
					"Holy Light - x2 - Uncommon - 2200 - Select someone, returning any positives lost within the previous half a day and heal them for 3 HP. If they hadn't lost any positives, the next positive performed by them and done to them is 2 fold."],
				"Perks": ["Cleansing Aura - Negative statuses on yourself and allies are degraded to not be as effective.",
					"Angelic - Positives inflicted by you on others will reward you with 200 coins. Positives inflicted on you will reward the inflictor with 100 coins, provided it's not you.",
					"Golden Thread - If you are killed, it is delayed by 1 day. Any sort of healing or preservation within this state will prevent you from being killed."],
				"Achievements": ["[Master Seraph] - Obtain all Seraph achievements",
					"[Angelic Clearing] - Inflict / remove 3 statuses using purification",
					"[Above it all] - Avoid 2 negatives using ascend",
					"[Holy Blessings] - Regain a positive using Holy Light"]
			},
			{
				"Name": "Terminal",
				"HP": "5 HP (10)",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "betrayalImages/terminal.png",
				"Description": "Once one of the greats, your time is nearing, power dwindling due to the falling of others, but you wont give up just yet.",
				"Abilities": ["Emotional Surge - x1 - Rare - 2400 - Inflict someone of choice with statuses that you have lost immunity to.",
					"Final Swing - x1 - Legendary - 5200 - While having less than or equal to 3 regrets, you can disable someone's perks and abilities until you die. If you have 4 or more, you can disable someone's perks or abilities until you die. Using this will add 3 regrets. If you aren’t Terminal, simply disable their perks and abilities until you die.",
					"Saving Grace - x3 - Rare - 2100 - Select someone, healing them for 3 HP every half a day for 1 day and saving them from negative effects for the next day.",
					"Body Shield - x1 - Epic - 2700 - Select someone, if they are attacked, they take no damage for a day, however, you lose an active perk of choice; but also lose 3 regrets. Cannot remove Hourglass of life or be self-used unless reflected/redirected. If you aren’t Terminal, they simply take no damage for a day."],
				"Perks": ["Hourglass of life: Every time an ally gets killed, gain 1 regret.",
					"Heartbeats: Immune to all negative statuses, but every time you gain a regret, lose an immunity of choice.",
					"Spiritual Remains: While without regrets, your max HP is 10.",
					"Shaking Hands: While having less than 3 regrets, you cannot be redirected.",
					"Shallow Breaths: While with less than 4 regrets, if an ally or yourself is attacked, you can choose to deal 3 damage to the attacker, or stop them, paralyzing and despairing them. Not dealing damage to them will remove a regret from yourself.",
					"Level Headed: While with less than 6 regrets, you will remove a negative status from yourself or an ally of choice every day."],
				"Achievements": ["[Master Terminal] - Obtain all Terminal achievements",
					"[Cleared] - Remove a total of 4+ statuses due to level-headed",
					"[Guardian Angel] - Have saving grace heal 6 HP",
					"[Breath-taking] - Save an ally with shallow breaths"]
			},
			{
				"Name": "Time Traveler",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "betrayalImages/timetraveler.png",
				"Description": "You have mastered the element of time, you know its entire construct and can control it as much as you want.",
				"Abilities": ["Double time - x1 - Legendary - 3800 - All allies will have their next ability happen twice, or if it involves time, either twice as fast or twice as long. Double time won't work on double time.",
					"Rewind - x2 - Rare - 2200 - Select someone, any statuses they had and items they used in the past day, they regain. Cannot use on the same person within 1 day - Global Cooldown.",
					"Loop - x1 - Epic - 2500 - Select someone, any negative abilities or item effects that have affected them within the past day and the next day, will affect them again for the next day."],
				"Perks": ["Timelines - You can choose with up to a half a day delay, when a status placed on you begins affecting you.",
					"Time Zoned - If your ability is reflected back onto you, or fails/blocked, you can re-use it."],
				"Achievements": ["[Master Time Traveller] - Obtain all Time Traveler achievements",
					"[Double Trouble] - Double an ally’s actions",
					"[Redone] - Use rewind to regain 3 items",
					"[Noose Loop] - Loop someone's negative statuses for the full time successfully"]
			},
			{
				"Name": "Undercover",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "betrayalImages/undercover.png",
				"Description": "You want to stay a secret to everyone, if you get exposed to what you really are, then the future will not be bright for you.",
				"Abilities": ["Black Cloak - x7 - Common - 750 - Next time someone visits you, they get redirected to a target of your choice.",
					"Deduct - inf - Uncommon - 1800 - Find the exact role of a player of your choice, and have a 1 day cooldown after use if you are Undercover.",
					"Investigate - x3 - Uncommon - 1500 - Find out who attacked your target and who your target attacked for the past day."],
				"Perks": ["Exposed - If three currently living people have declared you as the Undercover, you cannot use Deduct or Investigate anymore. If someone incorrectly declares, find out who they are, and you may reduce their coin bonus to 0% and inflict a negative (not Death Curse) status of choice, at any point once per incorrect guess.",
					"Paranoia - Cannot be redirected.",
					"White Clues - Gain a charge for Investigate every time you deduce an opposite aligned person."],
				"Achievements": ["[Master Undercover] - Obtain all Undercover achievements",
					"[No U] - Use black cloak to make someone target themselves",
					"[Under the Radar] - Don't get exposed for the whole game",
					"[Investigator] - Use Investigate 5 times"]
			},
			{
				"Name": "Wizard",
				"HP": "5 HP",
				"AP": "1 AP + Freeze/Paralyze/Burn (pick 1, no extra damage)",
				"Color": "lime",
				"Image": "betrayalImages/wizard.png",
				"Description": "You’re the master of spells. You’ve been practicing magic ever since you were young, and you will use the magic to your advantage.",
				"Abilities": ["Freeze - x1 - Common - 1500 - Freeze somebody, giving them a special 2 day, 1/3 thaw chance freeze. Can choose if it removes any other status effect they have apart from Cursed.",
					"Electrify - x1 - Common - 1500 - Electrify somebody, giving them a special Paralyzed which stuns for 1 day and a half. Can choose if it removes any other status effect they have apart from Cursed.",
					"Empower - x1 - Legendary - 6200 - Empower somebody, giving them Empowered. Removes any other status effect they have apart from Cursed. You can empower yourself as many times as you want, but cannot empower the empower ability.",
					"Fireball - x1 - Common - 1500 - Burn somebody, giving them a special Burned which burns every half day for 1 day. Can choose if it removes any other status effect they have apart from Cursed.",
					"Bless - x2 - Rare - 3200 - Bless somebody, removing all curses from them if they have any. It can also revive a dead player if they're preserved."],
				"Perks": ["Magic Barrier - Immune to Frozen, Paralyzed, Burned and Cursed. Reflects onto the inflictor."],
				"Achievements": ["[Master Wizard] - Obtain all Wizard achievements",
					"[Unlimited Power!] - Empower yourself",
					"[Warlock] -  Electrify, Freeze and Fireball the same person",
					"[Priest] - Bless 2 people who are cursed"]
			},
			{
				"Name": "Yeti",
				"HP": "10 HP",
				"AP": "2 AP + Freeze (no extra damage)",
				"Color": "lime",
				"Image": "betrayalImages/yeti.png",
				"Description": "You are a monster that thrives off sticking around in cold environments, you decided to help the person who helped you from a fateful encounter.",
				"Abilities": ["Encapsulate - x2 - Rare - 1500 - Target a player, freeze them. While frozen, they are unable to be visited by non-allies and you. However, they can be visited by anyone to cure Frozen.",
					"Sheltered in Ice - x2 - Rare - 1800 - Inflict Frozen on all allies, while frozen they are immune to negatives and heal for 3 HP. If they are immune, you will learn and choose to bypass it. You may choose to unfreeze them at any time.",
					"Nomadic Tribute - x1 - Rare - 2300 - Anyone currently frozen will take 1 damage and be unable to thaw entirely. Refresh the duration of all freezes."],
				"Perks": ["Winter Coat - You reflect freeze, don’t deal damage to allies with freeze, and may choose to give allies immunity to freeze. You may choose to also remove this immunity at any time.",
					"Nomadic - You can see who is currently frozen at any time in your zone and will be told if anyone thaws.",
					"Icicles - When any players thaw out naturally, you may choose to re-freeze them for 1 day."],
				"Achievements": ["[Master Yeti] - Obtain all Yeti achievements",
					"[Protector] - Heal someone with less than half their max HP",
					"[Bigfoot] - Kill someone using Nomadic Tribute",
					"[Ice Wizard] - Freeze 3 separate people"]
			}
		],
	},
	{
		"Neutral": 
		[
			{
				"Name": "Amalgamation",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "betrayalImages/amalgamation.png",
				"Description": "All for one, all for you.",
				"Abilities": ["Absorption - x2 - Legendary - 4800 - select someone, upon them dying, see their abilities and perks, pick 1 of each and gain 1 max HP, if Amalgamation, regain a charge of this after doing so."],
				"Perks": ["Eternal hunger - Every time something is used on you, gain a 5% coin bonus."],
				"Achievements": ["[Master Amalgamation] - Obtain all Amalgamation achievements",
					"[I’m Rich] - Gain a 50% coin bonus or higher",
					"[I’m Fat and Happy] - Gain 8 max HP or higher",
					"[I Like Your Taste] - Absorb the same player twice"]
			},
			{
				"Name": "Backstabber",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "betrayalImages/backstabber.png",
				"Description": "You’re a strong guy, and you can choose to help anyone you want, but you can also backstab anyone you want at any time. This is how you interpret life, betraying to survive.",
				"Abilities": ["Man's Blessing - x3 - Rare - 1250 - Select a player, this player has 1 less attack power for 1 day. This can stack and go across multiple players.",
					"Decode - x3 - Epic - 2500 - Reverse the effects of Man's Blessing, making the player have an increased attack power instead or reverse the effects of Fatality, making any attacks deal 1 damage more. If not Backstabber, choose to gain a reversed charge of Man’s Blessing or Fatality.",
					"Fatality - x2 - Epic - 2200 - For 1 day, all attacks on a selected player and the player’s allies deal 1 less damage."],
				"Perks": ["Manipulator - If you Decode someone and they have the lucky status, they get the unlucky status or vice versa. Same applies with burned & frozen. You can choose to turn this off.",
					"Finger of Death - When you get killed, you may pick a target to have the first attack to deal 2 extra damage. Once that target dies, you may choose another player.",
					"Counting Stars - Every time one of your allies gets killed, you gain a charge for Man's Blessing or Decode."],
				"Achievements": ["[Master Backstabber] - Obtain all Backstabber achievements",
					"[Night Sky] - Have at least 1 ally get killed at any time during the game",
					"[Force Fingered] - Have a target affected by Finger of Death die",
					"[Wishy Washy] - Decode or Man’s Blessing 4 times"]
			},
			{
				"Name": "Banker",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "betrayalImages/banker.png",
				"Description": "You love numbers, and really big ones at that. Even better if they're YOUR big numbers, and you will do anything you can to raise them.",
				"Abilities": ["Inheritance Tax - x1 - Uncommon - 1500 - You take all the money from a player that died.",
					"Last Will - x4 - Rare - 2000 - Take 50% of the coins of any player that attacked you in the last half a day.",
					"Payday - x1 - Rare - 2000 - Everyone currently alive must pay up to 200 coins to you or become Restrained for 2 days.",
					"Inflate - x1 - Rare - 2500 - Increases an item's price by 1000 coins."],
				"Perks": ["Bank Loans - All allies gain x1.2 more coins. Also allows you to transfer an amount of coins to anyone. Any ally can also transfer money to each other.",
					"Greedy - If 50% of living players pay payday, you gain 1 attack power for 1 day, if 75% pay, gain 2 attack power instead for 1 day.",
					"Shopkeeper - You will know when an item is bought, and what item it is."],
				"Achievements": ["[Master Banker] - Obtain all banker achievements",
					"[Pretty Penny] - Gain over 500 coins using inheritance tax",
					"[Written Off] - Reduce 4 people's money using last will",
					"[Payday Payoff] - Gain 800 coins or more with Payday"]
			},
			{
				"Name": "Bard",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "betrayalImages/bard.png",
				"Description": "*Panicked flute sounds as boss approaches*",
				"Abilities": ["Charisma Chant - x3 - Uncommon - 1250 - Select a player, their luck goes up by +2 and +50% until a luck event occurs. Any statuses on them that are negative will be degraded.",
					"Damage Dance - x2 - Rare - 2200 - Select a player, their next offensive ability / item use will be 2-fold.",
					"Protective Prance - x2 - Uncommon - 1500 - Select a player, the next negative on them will be blocked.",
					"Tactical Tune - x1 - Legendary - 4800 - Upon use, become immune to damage and negative statuses, lasts 1 day. If attacked at this time, add 1 day onto this - loops."],
				"Perks": ["Bards Charisma - x2 luck and coins from all sources. The Luck status does not affect coins.",
					"Lullaby - If killed, your attackers will be blackmailed and be given unlucky.",
					"On Deaf Ears - You may fake-use any base abilities of yours on people."],
				"Achievements": ["[Master Bard] - Obtain all Bard achievements",
					"[Again and Again] - Loop Tactical Tune",
					"[Musical Chairs] - Use 4 fake abilities",
					"[And His Music was Electric] - Block a negative, degrade a negative, and make an item or ability 2 fold"]
			},
			{
				"Name": "Bomber",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "betrayalImages/bomber.png",
				"Description": "You are a mad explosives expert, whose actions are very hard to track.",
				"Abilities": ["Sticky Bomb - x3 - Legendary - 4500 - Put a sticky bomb on a player without them knowing. When the holder is visited, the visitor gets the bomb. Detonates after 1 day, dealing 3 damage.",
					"Gas Bomb - x1 - Epic - 2600 - Gas a player. Them and any visitors get Paralyzed, Disabled, and take 1 damage per half a day for a 1 day period. Gas goes away after 1 day. Self-visits will not gas you.",
					"Tagger Bomb - x1 - Epic - 2600 - Tag a player. Every time the tagged player visits someone they also get tagged. You can see tagged people's visits."],
				"Perks": ["Bomber's Mask - Allows you to track the locations of your bombs, including 6 Point Bombs when held.",
					"Cautious Nature - When going to use an ability or item on someone, you will know if an ability is active on or around them.",
					"Resistant Vest - Immune to any effects of a bomb and any damaging item effects."],
				"Achievements": ["[Master Bomber] - Obtain all Bomber achievements",
					"[Tick Tick Boom] - Kill someone using a sticky bomb",
					"[Chambers] - Gas bomb 3 people",
					"[Tag, you're it!] - Tag 6 people"]
			},
			{
				"Name": "Cheater",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "betrayalImages/cheater.png",
				"Description": "You're a crazy maniac who'll do anything to win, and doesn't play by the rules.",
				"Abilities": ["Bend - x2 - Uncommon - 2000 - Change someone's alignment to an alignment of your choice. If Cheater: Gain a charge of this every day.",
					"Interception - x5 - Uncommon - 1000 - Target a person, receive the next feedback that they would receive from an ability/item.",
					"Break - x1 - Legendary - 4200 - For 1 day, if whoever you select gets killed, they will immediately revive."],
				"Perks": ["Rulebreaker - Negative item effects from the alignment you currently are will not affect you.",
					"Wilful Ignorance - Your actions cannot be blocked in any way."],
				"Achievements": ["[Master Cheater] - Obtain all Cheater achievements",
					"[Cheating Death] - Save someone with break",
					"[All Seeing Eyes] - Obtain 3 investigative feedback results using interception",
					"[Can't Touch This] - Be unaffected by 3 status effects due to Rulebreaker"]
			},
			{
				"Name": "Cyborg",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "betrayalImages/cyborg.png",
				"Description": "You're a human swarming with nanobots and mechanical parts, upgrading and destroying to better yourself and others around you.",
				"Abilities": ["Upgrade - x3 - Epic - 3200 - Select someone, they can now upgrade a perk or ability. Max once per ability or perk.",
					"Overclock - x3 - Rare - 2500 - Select someone, they can now upgrade an item of choice. Max once per item.",
					"Hyperdrive - x1 - Legendary - 4500 - Select someone, they gain a new charge for an ability of choice, once every 2 days.",
					"Degrade - x1 - Rare - 2500 - Select someone, you learn their role and see their abilities and perks, you can degrade an ability or perk of choice."],
				"Perks": ["Perfection - You're already perfect, you can't use Upgrade on yourself. Hyperdrive on yourself will give 1/2 charges when applying them to AAs, and 1/3 to base abilities. Your self-hyper runs off a different timer than other hypers given to you.",
					"Tinkering - You can upgrade any Common items you obtain once per item type, and any Uncommon items you obtain once.",
					"Robotic Nature - You're immune to Paralyzed, Frozen, Burned, Despaired, Blackmailed and Drunk."],
				"Achievements": ["[Master Cyborg] - Obtain all Cyborg achievements",
					"[Tink tonk] - Tinker an item",
					"[Hyperactive] - Hyperdrive someone",
					"[Better, Faster, Stronger] - Upgrade an ability or perk"]
			},
			{
				"Name": "Entertainer",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "betrayalImages/entertainer.png",
				"Description": "Put on a show, for public and private audiences.",
				"Abilities": ["Opening Act - x4 - Common - 750 - Select someone, they will have -10% or +10% immunity card chances, you decide.",
					"Sideshow - x3 - Uncommon - 1000 - Select someone, adding their alliance bonuses to your alliance for 1 day.",
					"The Twist - x2 - Uncommon - 1800 - Select someone, preventing them from attacking you with any damaging ability and preventing you from attacking them with any damaging ability.",
					"Finale - x1 - Legendary - 5000 - Select a player, all the player’s allies must vote on someone to deal 3 damage to. Ties will send both tied players to death. If that player has no allies, deal 3 damage to them."],
				"Perks": ["Lead Actor - You gain 2 luck from Good/Evil, for every good and evil ally, gain an additional 2 luck.",
					"Top-hat Tip - You start the game lucky, you are immune to unlucky. You can see yours and all your allies' luck at all times.",
					"False-Smile - If someone attacks you after giving you any positive status, use a free charge of opening act on them automatically, or, you can inflict unlucky, freeze, or disabled."],
				"Achievements": ["[Master Entertainer] - Obtain all Entertainer achievements",
					"[Are You Not Entertained?] - Have Finale kill someone",
					"[Dora the Explorer] - Use an ability on every alliance",
					"[Hidden Friendliness] - Use False-Smile once on an enemy"]
			},
			{
				"Name": "Ghost",
				"HP": "5 HP",
				"AP": "1 AP + Curse",
				"Color": "yellow",
				"Image": "betrayalImages/ghost.png",
				"Description": "You’re not really a human. You’re just a lone spirit casting an illusion unknown to the others. Your spirit is still alive, and it doesn’t want to be around others.",
				"Abilities": ["Invisibility - x4 - Uncommon - 2000 - Go invisible which allows nobody to visit you for half a day.",
					"Curse - x4 - Common - 1250 - Curse somebody, giving them Cursed. Removes any other status effects they have.",
					"Death Curse - x1 - Legendary - 4500 - Curse somebody, giving them a special Cursed which can only be cured by the Bless.",
					"Disappear - x1 - Legendary - 6200 - Vanish for up to a day, making nothing happen to you, nobody being able to visit you, and attacks don’t work. You may reappear at any time once you vanish."],
				"Perks": ["Ghost’s Blood - Immune to Cursed.",
					"Secret Spirit - You can still use your items and abilities when you’re in death. You still gain AA's and items from power drops/item rains.",
					"Confusion - If you're investigated, the investigator will receive a random result instead."],
				"Achievements": ["[Master Ghost] - Obtain all Ghost achievements",
					"[Ghost's Grudge] - Kill someone with Death Curse",
					"[Magical Warfare] - Kill someone with a normal curse",
					"[Vanishing Act] - Use Disappear during Final 4"]
			},
			{
				"Name": "Goliath",
				"HP": "10 HP",
				"AP": "2 AP",
				"Color": "yellow",
				"Image": "betrayalImages/goliath.png",
				"Description": "A temperamental mortal with godly amounts of strength stored in his massive body. The only mortal to rival Juggernaut.",
				"Abilities": ["Bloody Knuckles - x2 - Uncommon - 2000 - Target somebody, you learn their status immunities and deal 2 damage. Choose a status immunity to remove from them permanently. If the target has no immunities they leave a blood trail which tracks their next visit for you even through Shatter. (who they visited and the nature of the visit)",
					"Wall Breaker - x2 - Uncommon - 1500 - Target somebody, publicly reveal their alliance.",
					"Dimensional Shatter - x0 - Legendary - 6200 - Gain a charge of this ability only after Rage has activated 3 times. For 1 day all visits are untraceable, any players that died are not revealed but still happen. In the case of a draw, everybody involved is killed. All investigation abilities reveal nothing."],
				"Perks": ["Rage - When you or an ally is negatively afflicted, gain another charge of Bloody Knuckles. You can only gain 1 charge per person who negatively inflicts you or your allies every day.",
					"God's Fist - Once Rage activates 5 times gain a powerful upgrade for one use of Bloody Knuckles that strips all immunities including death immunity, can’t be blocked or redirected.",
					"Crippling Strike - When an ally is attacked, you will know who did it even through Shatter, and can choose to paralyze them. Status immunities you have chosen to remove with Bloody Knuckles prior to the attack will be removed permanently from the attacker.",
					"Instinct - When you use Dimensional Shatter you gain 5 max HP and Crippling Strike also activates for both status infliction and attacks."],
				"Achievements": ["[Master Goliath] - Obtain all Goliath achievements",
					"[Broken Barriers] - Active the God’s Fist perk",
					"[Knock, Knock] - Reveal the first two alliances you use Wall Breaker on",
					"[Jaw Crusher] - Successfully use Crippling Strike to remove more than 3 status immunities"]
			},
			{
				"Name": "Incubus",
				"HP": "10 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "betrayalImages/incubus.png",
				"Description": "Charm magic isn't needed so much when your way with words bends the mind of mortals alone.",
				"Abilities": ["Demonic embrace - inf - Epic - 2200 - Pick someone once every day if Incubus. They will be told they have been embraced. Embraced targets will have x2 attack power when voting with you or an embraced person and you also have x2 attack power when voting with embraced, as long as Sinister Smile isn't on.",
					"Sinister Smile - x2 - Epic - 2800 - Embraced players deal half damage to you for 1 day. Embraced players will not know. If not Incubus, all players will deal half damage to you for half a day.",
					"Hair Pulling - x3 - Rare - 2200 - Force all embraced to attack the same target as you for this day. If not Incubus, force all allies to attack the same target as you for this day.",
					"Gentle Holdings - x3 - Uncommon - 1800 - Only works on embraced targets. Give them +2 max HP for half a day. If not Incubus, works on all targets."],
				"Perks": ["Sexual Findings - Every time someone new uses something on you, gain 25 coins. Every time you use something, gain 25 coins.",
					"Kiss Of Death - Each time an embraced player gets killed, gain 500 coins.",
					"Master - You will be told if an embraced player is attacking you. If you take 3 or more damage from embraced players, you can soul suck one player of choice, dealing 3 damage.",
					"Utter Affection - If you have 3 or more embraced players, if attacked, your latest embraced player will take half the damage for you. This also activates if 33% of alive players are embraced players.",
					"Hard-On - If 2 embraced players are killed, gain a charge of hair pulling, and become able to self-use gentle holdings.",
					"Love-Hate Duet - Evade the first negative from an embraced player each day, you learn what it was and who did it.",
					"Lick-Up - If one of your embraced players gets killed from soul suck, you gain a random item, going up in rarity for base-level. eg, 1st player killed is common, second is uncommon, etc"],
				"Achievements": ["[Master Incubus] - Obtain all Incubus achievements",
					"[Loved By All] - Embrace 3 players or more",
					"[Sucky Sucky] - Gain 2 items from Lick-Up",
					"[Uno Card] - Kill someone using Utter Affection"]
			},
			{
				"Name": "Masochist",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "betrayalImages/masochist.png",
				"Description": "You love attention, especially the kind to cause you torment. Attacks on you give you pleasure, among other things.",
				"Abilities": ["Allure - x5 - Common - 300 - Make someone attack you once.",
					"Repulse - x0 - Rare - 2500 - Make any attacks on you reflected back to the attacker, but still gain a stack. Activates with 2 charges at 5 stacks. If not Masochist, does the same thing but doesn’t give stacks.",
					"Submission - x0 - Epic - 3000 - All attacks don't work on you apart from giving you charge. Every attack you receive now counts towards your attack power. Activates with 1 charge at 8 stacks. If not Masochist, does the same thing but doesn’t give stacks.",
					"Cross Eyes - x0 - Uncommon - 1800 - Works for 1 day on use. If you have a negative status put on you - it fails, giving the user frozen. Gives you 3 stacks per success. Activates with 1 charge at 11 stacks. If not Masochist, does the same thing but doesn’t give stacks."],
				"Perks": ["Pleasure - Receive a stack of pleasure every time you get attacked.",
					"Masochism - Gain 100 coins and 1 HP for every stack you receive.",
					"Bliss - When you're attacked, you give the attacker Blackmailed. Gives you 3 stacks. Activates at 10 stacks.",
					"Euphoria - Gives additional perks when at high amounts of stacks.<br>12 Stacks = You get an extra attack power if you have a negative status effect.<br>14 Stacks = All negative status effects don't work on you apart from Cursed.<br>16 Stacks = You now get an extra attack power for every negative status effect.<br>18 Stacks = You now may swap 3 stacks in for Death immunity for 1 day. Deactivates when under 18 stacks again.",
					"Pain Chaser - If an ally has a negative status happen, you get it instead.",
					"One Track Mind - Immune to Lucky."],
				"Achievements": ["[Master Masochist] - Obtain all masochist achievements",
					"[Orgasmic] - Gain 18 stacks",
					"[Submissive] - Successfully use submission to gain 4+ attack power",
					"[Eye rolling] - Blackmail 2 players with Bliss"]
			},
			{
				"Name": "Mimic",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "betrayalImages/mimic.png",
				"Description": "You have no identity, you live your life imitating other people, being behind other peoples shadows.",
				"Abilities": ["Reenact - x3 - Epic - 2700 - Select someone, you copy and gain a charge of their next ability they use.",
					"Replay - x1 - Rare - 2200 - Select someone, any attack power they have - you gain that as your attack power for the next day. Can be used on yourself.",
					"Reaction - x3 - Rare - 1500 - The next action done to you also affects the person doing it to you.",
					"Reuse - x3 - Epic - 2700 - Select a person, gain a copy of the next item they use."],
				"Perks": ["Blend In - When you and someone else take the same damage total at the end of the day, only the other player takes damage.",
					"Personal Mimicry - Upon a successful Reaction, you may copy a perk from the person. Max 2 at a time.",
					"Shifting - Your alignment will change to whatever the players in your zone’s dominant faction are luck wise. If there's a 'tie' then you may pick between the alignments."],
				"Achievements": ["[Master Mimic] - Obtain all mimic achievements",
					"[Shifted] - Make a tie between alignments",
					"[Mirrored] - Successfully use Reaction",
					"[Perfect Copy] - Gain a unique ability or Legendary item using your abilities"]
			},
			{
				"Name": "Nephilim",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "betrayalImages/nephilim.png",
				"Description": "Born from the gods, but not one to walk with them.",
				"Abilities": ["Spatial Followings - x2 - Rare - 2000 - Defensive: When used, for 1 day, you will disarm anyone of their items used against you or an ally and claim them for yourself, you will know who you disarmed. Offensive: Select someone, breaking their arms, preventing item use and passing for 1 day and inflicting paralysis. Pick either form’s use if not Nephilim.",
					"Ready Stance - x2 - Rare - 2000 - Defensive: Upon use, anything used on you in the next day you will know about, you can choose to stop the effect entirely, inflict it on an ally, or take it. Offensive: Select someone, anything negative that happens to you in the next half a day, also happens to them, if they try to do a negative onto you, disable, restrain, and blackmail them, preventing the action. You will be told who does what to you during this, and for every negative action done to you, the timer increases by 1/12 of a day. Pick either form’s use if not Nephilim.",
					"Brute Force - x1 - Epic - 2500 - Offensive only: Bind someone's alliance, causing them only to target each other for the next day. If not in an alliance, break their arms preventing item use and passing for 1 day. Usable always if not Nephilim.",
					"Iron Will - x1 - Epic - 4800 - Defensive only: If killed within the next day, don’t die until you get attacked again, gaining immunity to all negative statuses for the next day. Usable always if not Nephilim."],
				"Perks": ["Stinging Serenity - You may change between offensive and defensive states, with a half a day cooldown from changes. You start off in a state of choice.",
					"Stable enough - <br>Defensive: Immune to 3 statuses of choice.<br>Offensive: Negative Status-inflicting items/AA last twice as long, or are twice as damaging depending on the status.",
					"Bloodied - <br>Defensive: Every time an ally dies, your coin bonus increases by 15%.<br>Offensive: Every time someone you have harmed dies, gain 10% of their coins.",
					"Iron-body - <br>Defensive: Attacks will create a shield of 2 HP every day.<br>Offensive: Attacks will allow you to strike back 2 fold onto the attacker."],
				"Achievements": ["Defensive - ",
					"[Personal Space Stealing] - Claim 3 items using Spatial Followings",
					"[Readied up] - Successful have at least 3 visits when using Ready Stance",
					"[Tough as nails] - Successfully survive death for 1 day with iron body",
					"Offensive - ",
					"[Smack Down] - Activate Ready Stance while in offensive to harm someone",
					"[Brutality] - Use Brute Force on 4 or more people in one use",
					"[Pain Gains] - Inflict 3 lots of double strength/length statuses"]
			},
			{
				"Name": "Pathologist",
				"HP": "10 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "betrayalImages/pathologist.png",
				"Description": "You’re interested in the dead and you enjoy examining dead bodies. It’s all you do, even in your free time. You’re so obsessed with it that you want others to be killed just to be examined.",
				"Abilities": ["Body Examine - x4 - Uncommon - 750 - Find the role of a player who is dead.",
					"Act Out - x2 - Legendary - 4800 - Choose a perk and an ability to gain from somebody who is dead. Max 2 times per person. If not Path: Max 1 perk at a time, unable to gain multiple. Can choose to not get a perk when using it.",
					"Disrespectful Peek - x6 - Common - 750 - Check what items a dead player has.",
					"Confiscate - x3 - Uncommon - 1500 - Take all the items from a dead player for yourself."],
				"Perks": ["Dead Inside - Immune to any effects from somebody’s perk or ability that can happen to you when they’re killed.",
					"Corpse Raider - Every time someone is killed, gain a 5% coin bonus."],
				"Achievements": ["[Master Pathologist] - Obtain all Pathologist achievements",
					"[Forensic] - Act Out a non-AA/unique ability",
					"[Grave Robber] - Confiscate 5 items",
					"[Mortician] - Block someone's perk/ability that activates on you when killed"]
			},
			{
				"Name": "Sidekick",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "betrayalImages/sidekick.png",
				"Description": "You are an amazing team player and will always help others, making you a strong ally. Helping others allows you to help yourself too.",
				"Abilities": ["Safeguard - x3 - Uncommon - 1250 - Shield somebody for 3 HP for the next day. Cannot be yourself. Whoever you protect won't be notified.",
					"Surveillance - x3 - Uncommon - 2200 - Protect all allies from outside visitors for 1 day.",
					"Steel Guard - x0 - Epic - 2500 - Shield all allies for 3 HP for the next day. Can be used solo.",
					"Silver Finger - x1 - Rare - 1800 - You have 1 more attack power and 5 more max HP for 1 day."],
				"Perks": ["Security - Every time you successfully protect someone with Safeguard, gain a charge for Steel Guard.",
					"Sympathetic - Prevents any ally from dealing damage to any other ally accidentally."],
				"Achievements": ["[Master Sidekick] - Obtain all Sidekick achievements",
					"[Reliable Friend] - Have all 3 safeguards shield damage",
					"[Steel Saviour] - Save an ally with steel guard",
					"[Patrol Officer] - Stop 3 different visitors with Surveillance"]
			},
			{
				"Name": "Succubus",
				"HP": "10 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "betrayalImages/succubus.png",
				"Description": "You're a mass seducer, but not so good at hiding what you do.",
				"Abilities": ["Charm - inf - Epic - 2200 - Pick someone to charm, your attack power doubles if a charmed player attacks the same player as you, charmed players will also get x2 attack power when voting with you. If Succubus, 1 day cooldown.",
					"Gag - x3 - Common - 1000 - Gag a player, blackmailing them. Refer to perks if a charmed player.",
					"Contract Break - inf - Common - 500 - Pick a charmed person to free from charm and gain a charge for Gag. 1 day cooldown. If not Succubus, gain 500 coins."],
				"Perks": ["Sexual Encounter - Every time someone new uses something on you, gain 50 coins.",
					"Sadistic - If one of your charmed targets is killed, you gain 300 coins along with a charge for Gag.",
					"Chain Puller - If your charmed targets attack a Death Immune target, you may force all your charmed targets to attack another person of your choice.",
					"Soul Sucker - If a person gets killed from having their Soul Sucked, gain 2 charges for Gag.",
					"Muffled Moans - Blackmailing a charmed person causes them to become seduced - meaning if they try to do anything non-positive to you, they get soul sucked, dealing 3 damage and ignoring everything. This does not blackmail them, it only changes charmed -> seduced.",
					"Blinding Desire - Charmed people cannot detect your actions when they involve charming other people.",
					"Dominatrix - Immune to blackmail."],
				"Achievements": ["[Master Succubus] - Obtain all Succubus achievements",
					"[Seductive] - Charm 3 people",
					"[Silenced] - Have 2 gagged and charmed people alive at once",
					"[Collar Tugger] - Activate the chain puller perk"]
			},
			{
				"Name": "Tinkerer",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "betrayalImages/tinkerer.png",
				"Description": "Alteration of everything and anything to get a step ahead the others, even power itself.",
				"Abilities": ["Override - x3 - Epic - 2800 - Use an AA without using up a charge. Using this on an AA more than once will delete the AA from your inventory afterwards. Cannot be used on empower nor hyperdrive when empowered.",
					"Matter Reconstruction - x2 - Rare - 2200 - Transform an item into a random equally rare AA. If Unique, gain a random AA of Uncommon or more. Ultimate and Mythical items become a Legendary AA. You can't use shop bought items.",
					"Upsurge - x2 - Uncommon - 1800 - Merge 2 AA's of the same rarity into one of choice from the rarity above. Will have a charge if both used AA's had one. Can be used to merge multiple pairs of AA’s in one go.",
					"Down Surge - x2 - Uncommon - 1800 - Break down an AA into 2 of choice from the rarity below. Both will have a charge if broken down one did. If not, only one of them will.",
					"Assimilate - x2 - Epic - 3000 - Select someone, taking AA’s of choice from them."],
				"Perks": ["Power Handling: You may pass AA’s to other players.",
					"Low-Power Hotwire: You may use a Common AA for free every day, even if it has 0 charges.",
					"Assimilation Copy: If you use Assimilate on someone with immunities, copy them.",
					"Eye of Power: You can see what AA’s your allies get in Power Drops and from AA based items."],
				"Achievements": ["[Master Tinkerer] - Obtain all Tinkerer achievements",
					"[Unlimited Power] - Get a legendary AA through Matter Reconstruction",
					"[The Real Mimic] - Copy 4 or more immunities with Assimilate",
					"[Back to Basics] - Use common AAs for 3 days straight"]
			},
			{
				"Name": "Villager",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "betrayalImages/villager.png",
				"Description": "You’re just a villager who wants to survive. You may have to fight for survival, but it’s your desire to live and get back to your village, everyone loves you.",
				"Abilities": ["Bond - x4 - Common - 1000 - Bond with a player of choice, giving them +30% coin bonus. Cannot be used on the same person again within half a day. Can stack."],
				"Perks": ["Loveable - Gain 2 luck and +5% coins per ally.",
					"Jack of All Trades - Gain an additional Any Ability from events and items that usually give AAs."],
				"Achievements": ["[Master Villager] - Obtain all Villager achievements",
					"[Around the World] - Gain 2 additional AAs from events",
					"[Bonding] - Bond 1 person 3 times",
					"[MVP Teammate] - Use bond on 2 different allies"]
			},
			{
				"Name": "Wanderer",
				"HP": "10 HP",
				"AP": "2 AP",
				"Color": "yellow",
				"Image": "betrayalImages/wanderer.png",
				"Description": "You're a level headed loner, trying to get away from the chaos.",
				"Abilities": ["Serene State - x3 - Uncommon - 1500 - When activated, the next action on you will fail, you know what it was, and who did it.",
					"Forceful Resignation - x2 - Rare - 1500 - Select someone, if they have an ally alive, prevent them from receiving positive buffs besides from an ally. If all allies are dead, they become paralyzed and blackmailed.",
					"Off The Beaten Path - x3 - Common - 1000 - Select someone, you swap coin bonuses for the next coin phase. You also swap luck if yours is lower. Luck is swapped until a luck influencing event occurs."],
				"Perks": ["Lonesome - You gain 35% coin boost and +3 luck. If you are the last in your alliance standing, gain 70% coin boost and +6 luck.",
					"Calming Silence - You gain +1 luck every day. If you are the last in your alliance standing, you gain +3 luck every day.",
					"Observant - You will know what's used on you.",
					"Wolf - Attacks on you will trigger your wolf to deal 3 damage to the attacker."],
				"Achievements": ["[Master Wanderer] - Obtain all Wanderer achievements",
					"[Run-down] - Use forceful resignation on the same player twice",
					"[Lone Wolf] - Kill someone using your Wolf",
					"[Not Today] - Avoid 3 negative actions using Serene State"]
			}
		],
	},
	{
		"Evil": 
		[
			{
				"Name": "Anarchist",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "betrayalImages/anarchist.png",
				"Description": "You believe democracy oppresses the will of the individual. You like to cause anarchy, switching things up and making the battlefield change.",
				"Abilities": ["Purge - x5 - Rare - 1500 - Choose someone and they will have their attack blocked. If their attack power is personally buffed due to a perk or ability, their attack power will only be decreased by 1.",
					"Imperium - x1 - Rare - 2000 - Cast three attacks. Must all be for different people.",
					"Isolate - x1 - Rare - 2200 - Isolate someone for 1 day, making them unable to do anything, but also not able to be visited.",
					"Sunder - x1 - Epic - 2500 - Split the players in the zone into 2 equal groups of your choice. Everyone can only visit people in that group for 1 day."],
				"Perks": ["One Step Ahead - Each day you may select up to two players (you cannot switch to different players after selection). You will know who these players are attacking for 1 day."],
				"Achievements": ["[Master Anarchist] - Obtain all Anarchist achievements",
					"[Purge Night] - Have 3 or more players unable to attack due to purge uses",
					"[Division Decision] - Use sunder, and kill someone in your group",
					"[Lonesome Survival] - Save someone via isolation"]
			},
			{
				"Name": "Arsonist",
				"HP": "5 HP",
				"AP": "1 AP + burn (no extra damage)",
				"Color": "red",
				"Image": "betrayalImages/arsonist.png",
				"Description": "Some men just want to watch the world burn.",
				"Abilities": ["Douse - inf - Uncommon - 1250 - Every day, you may douse someone, not notifying the person you douse. Using this on a doused will remove the douse, but give you +1 luck. If not Arsonist, give the target +1 luck and frame them.",
					"Incineration - x2 - Epic - 1800 - Upon use, burn all doused players, destroying all of their items, giving them burned. If not Arsonist, select any 2 players.",
					"Ignite - x3 - Rare - 1800 - Select a doused player, burning them, destroying their highest tier item, and removing doused on them. Alternatively, give burned to all doused. If not Arsonist, can select anyone.",
					"Chemical Burning - x1 - Epic - 2000 - Select someone, giving a special burn, which burns ability charges instead of items. Can be cured using 2 lots of burn removal items/abilities. Can only select doused targets, removes doused on them. If not Arsonist, can select anyone."],
				"Perks": ["Ashes to Ashes - Your items cannot be burnt away/destroyed nor stolen. Anyone you douse is also 'framed' and shown as Arsonist / Evil.",
					"Flamed - Reflect burn, and every time someone tries to burn you, gain a charge of ignite, and douse them.",
					"Gasoline Fumes - For every doused person, get +10% coins. For every 2 doused people, get +1 luck.",
					"Hellish Landscape - If every living player is doused; remove all burn immunities people have and then inflict everyone with a half a day burn. You also gain a random Epic-Mythical item. You may now also douse corpses.",
					"Heat Vision - You can see who is currently burning."],
				"Achievements": ["[Master Arsonist] - Obtain all Arsonist achievements",
					"[Firebender] - Gain 2 charges of ignite using Flamed",
					"[Apocalypse] - Activate Hellish Landscape",
					"[Pyromaniac] - Burn 6 items with any burn"]
			},
			{
				"Name": "Bartender",
				"HP": "5 HP",
				"AP": "1 AP + Drunk",
				"Color": "red",
				"Image": "betrayalImages/bartender.png",
				"Description": "You're completely obsessed with alcohol, all you do is drink and pressure others into drinking a lot.",
				"Abilities": ["On The House - inf - common - 750 - Pick someone to give them Drunk. If Bartender - Has a 1 day cooldown.",
					"Intoxication - x2 - Rare - 2400 - Upon activation, select a person, them and all people currently with Drunk will gain an extra stack of Drunk as well as Blackmailed, Disabled, and Paralyzed for 1 day.",
					"Clink - x1 - Epic - 2700 - Select a person, their entire inventory will become Iron Balls.",
					"Moonshine - x2 - Rare - 2100 - Select a person, remove any other status effects aside from Cursed that they currently have and they will become 100% Drunk for 1 day."],
				"Perks": ["Drinking Buddies - Gain a Beer every time someone else in the game gets a Beer.",
					"Alcoholic - Anytime someone tries to inflict you with Drunk, it gets reflected back to them.",
					"Staggering Suggestions - You know who is drunk. Allies can only be the target of positive drunk actions. You can select 25% of players who are not within your alliance to never be the target of positives, and always the target of negatives."],
				"Achievements": ["[Master Bartender] - Obtain all Bartender achievements",
					"[Drunkception] - Have a drunk person accidentally target you with a drunk giving item/ability and have it reflect back to them",
					"[House Party] - Intoxicate 4 or more people",
					"[Ferrate Fabricate] - Turn 3 items into Iron Balls"]
			},
			{
				"Name": "Consort",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "betrayalImages/consort.png",
				"Description": "Your charm, charisma and good looks gets you anything you want and you will manipulate that as much as you possibly can.",
				"Abilities": ["Private Show - x3 - Uncommon - 1500 - Select someone, any actions they attempt to do for the next half a day will be blocked, they will not be informed unless it's a feedback action.",
					"Public Display - x2 - Rare - 2500 - Select someone, any actions themselves or their allies attempt to do for the next day will be blocked, they will not be informed unless it's a feedback action.",
					"Revealing Attraction - x2 - Rare - 2200 - Select someone, if they use any positive actions or send items or money for the next day, you receive it instead. This does not include self-use positives."],
				"Perks": ["Backstage Practice - Every time you're visited by someone new, gain a charge for a Private Show.",
					"Tips for Tips - Gain 50 coins for every action you stop",
					"Viruses - Spread negative status effects you have upon every successful action stopped. You can gain statuses you are immune to, and not be affected by them. Losing the immunity while having the status, will remove the status with it.",
					"Redressing - If a harmful status effect or harmful action is used on you by someone you're using an original ability on, your ability cancels."],
				"Achievements": ["[Master Consort] - Obtain all Consort achievements",
					"[Pornstar] - Stop at least 4 actions using public display",
					"[Stripper] - Stop 4 actions using private show",
					"[Gold Digger] - Get more than 300 coins in 1 day from your abilities"]
			},
			{
				"Name": "Cultist",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "betrayalImages/cultist.png",
				"Description": "A dark minded individual who \"gifts\" their targets with a secret incantation that marks them as a sacrifice to dark powers.",
				"Abilities": ["Mark of the Fallen - x2 - Uncommon - 1500 - The targeted player becomes marked. Any action marked people do to someone else passes along the mark. This is not known to the target. It can be spread indefinitely. If not a Cultist, simply put a curse on them.",
					"Forbidden Knowledge - x3 - Uncommon - 1800 - See all actions performed on all allies for 1 day and prevent them from being redirected.",
					"Sacrifice - x1 - Legendary - 4500 - You can only target Marked people with this. Whoever is chosen by you will be marked for a death curse, they have 1 day to pass it onto someone else by visiting them. People will be notified when they are marked for a death curse. If not a Cultist, simply put a death curse on them."],
				"Perks": ["Mob Mentality - The number of marked players the Cultist has grants different bonuses. Each marked player counts as 2 marks.",
					"2 Marked = Coin bonus increases 10%.<br>3 Marked = Allies receive a private Item Rain.<br>4 Marked = Given a Cursed Relic (Epic item).<br>5 Marked = Forbidden Knowledge now also works on all marked people and reveals all the marks to the Cultist.<br>6 Marked = Gain 50% coin Bonus, and a charge of Forbidden Knowledge.<br>7 Marked = You can cure a player of all Status effects at once.<br>8 Marked = You can give a player any negative status effect of choice (basic) once per day. Cannot inflict blackmail or restrain twice in a row.<br>9+ Marked = Gain an extra 5% coin bonus for every marked person from this point onwards.",
					"Dark Company - You are immune to Curse. If an ally is marked then they get Curse Immunity as long as they're in this alliance/marked.",
					"Martyr - If all players alive are marked then they all receive Cursed. You can see who gets targeted by attacks by the cursed players."],
				"Achievements": ["[Master Cultist] - Obtain all Cultist achievements",
					"[Intolerable] - Find at least 5 actions done to your allies using Forbidden Knowledge",
					"[Festivities] - Mass curse everyone and trigger Martyr",
					"[Marked for Death] - Death curse someone, and have them die"]
			},
			{
				"Name": "Doll",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "betrayalImages/doll.png",
				"Description": "You're a husk, empty on the inside, but seemingly perfect on the outside.",
				"Abilities": ["Soul Seeking - inf - Common - 1000 - Check someone - finding out their luck, coins and statuses. If Doll, start with 2 charges and gain a charge each time you get a status and every day.",
					"Soul Swap - x3 - Rare - 1800 - Swap statuses between 2 players of choice.",
					"Coin Flip - x2 - Uncommon - 1200 - Select 2 people, swapping coin bonuses for 1 day.",
					"Luck Transfer - x2 - Rare - 2000 - Permanently swap 2 people's luck. If you use it on yourself, you will only swap if yours is lower.",
					"Survival Swap - x1 - Epic - 2800 - You swap immunities between 2 players permanently.",
					"Body Swap - x1 - Uncommon - 1800 - Select 2 people, actions on 1 go to the other, and vice versa, for 1 day."],
				"Perks": ["Façade - You may fake your role, alignment, items, immunities, etc - If someone tries to check anything about you, your false info is given instead in its place.",
					"Breakable - Upon taking a lethal attack for the first time, you survive with 1 HP, lose 2 ability charges of choice, and lose Façade."],
				"Achievements": ["[Master Doll] - Obtain all Doll achievements",
					"[Picture Perfect] - Have someone investigate you while your Façade is still functional",
					"[Degeneration] - Cause someone to lose multiple immunities due to survival swap",
					"[Soul Watcher] - Use soul swap 3 times or more"]
			},
			{
				"Name": "Forsaken Angel",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "betrayalImages/forsakenangel.png",
				"Description": "Not everything from paradise is friendly.",
				"Abilities": ["Blackened Chains - x5 - Rare - 1800 - Select someone, the next negative that happens to you, happens to them 2 fold.",
					"Erasure - x1 - Epic - 3200 - Select someone, and remove a positive perk of choice from them if they have visited you or an ally within the last day. They gain it back upon your death. Cannot be used on the same person more than once per game.",
					"Broken Blade - x1 - Epic - 2500 - Select someone, destroying all currently-lasting positive abilities on them, and destroy any positive items within their inventory.",
					"Wing Tear - x1 - Legendary - 4200 - If Forsaken Angel, gain a charge after dying or surviving an attack at 1 HP. Select someone, upon dying, deal 3 damage. You can use your abilities, coins & items when dead."],
				"Perks": ["Halo-less - Positive effects on you can be turned into equally powerful negatives, and put on a person of choice.",
					"Forsaken Already - Curses on you act as heals while active. It will not deal damage to you upon its end. Death curses will additionally act as Death Immune till gone.",
					"Spiteful - Upon being killed without successfully using Wing Tear - all negatives acquired throughout the game, will be put onto your attackers."],
				"Achievements": ["[Master Forsaken Angel] - Obtain all Forsaken Angel achievements",
					"[Blood Web] - Use Wing Tear on 2 different people",
					"[Abyssal Bindings] - Successfully use Blackened Chains 4 times",
					"[Painful Exchange] - Swap 3 positives into negatives"]
			},
			{
				"Name": "Gatekeeper",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "betrayalImages/gatekeeper.png",
				"Description": "You’ve always been taking in prisoners, whether they’re sickly evil or perfectly innocent and abusing your power by using them. You like to stop your threats by putting them through misery and pain instead of killing them.",
				"Abilities": ["Restrain - x2 - Uncommon - 1250 - Restrain someone, giving them Restrained. Removes any other status effect they have apart from Cursed. Will be removed on your death. If you are a Gatekeeper, you will know your prisoner's role.",
					"Force Ability x7 - Uncommon - 1250 - Force your prisoner to use any of their abilities on any player. If you are not Gatekeeper, find out their abilities that they can use.",
					"Release - x2 - Common - 1250 - Select someone, removing Restrained from them."],
				"Perks": ["Armored - Immune to Restrained, Paralyzed, and Freeze.",
					"Preserved - Items cannot be stolen. It will notify anyone who tries to steal them that they have no items.",
					"Spare Cuffs - If someone is inflicted with Restrained, you can use your abilities on them as if they are a prisoner."],
				"Achievements": ["[Master Gatekeeper] - Obtain all Gatekeeper achievements",
					"[Kevlar] - Have Armored save you from all 3 statuses",
					"[Forced Trigger] - Kill someone using Force Ability",
					"[Enslaver] - Inflict Restrain on 3 or more people"]
			},
			{
				"Name": "Hacker",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "betrayalImages/hacker.png",
				"Description": "You love hacking, and you will try to hack as much as possible to survive, it’s your only choice. You can really change the results of things, you can mess up anyone you want.",
				"Abilities": ["False Result - x4 - Uncommon - 750 - Choose three targets, for 1 day, if your first target attacks your second target, they instead attack your third target.",
					"Troll - x1 - Epic - 3000 - For 1 day, you become immune to attacks, but attacks on any of your allies are now doubled.",
					"Silence - x2 - Common - 1000 - Give a player Blackmailed.",
					"Disable - x2 - Common - 1000 - Give someone Disabled. Removes any other status effects apart from Cursed. "],
				"Perks": ["Escapist - Immune to Disabled and Blackmailed."],
				"Achievements": ["[Master Hacker] - Obtain all Hacker achievements",
					"[Escape Artist] - Have someone try to Disable or Blackmail you",
					"[Corruption] - Have 2 false results cause someone to be killed",
					"[Owned] - Save yourself using Troll"]
			},
			{
				"Name": "Highwayman",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "betrayalImages/highwayman.png",
				"Description": "You're a crazy bandit who goes to insane levels of crazy to make things go your way and increase your chance of survival.",
				"Abilities": ["Ruthless Murder - x3 - Legendary - 4500 - Reveal your role and shoot someone of your choice for 3 damage. If you kill someone with the same alignment as you, you will be Despaired for 1 day.",
					"Hold Up - x2 - Epic - 2800 - Threaten to kill someone, they can either die, give you all their money, or all of their items. The target cannot act until a decision is made. Cannot select the same target within half a day.",
					"Armed Friend - x1 - Legendary - 4500 - You give somebody Ruthless Murder.",
					"Bloody Escape - x1 - Rare - 2400 - Choose a person to hide behind permanently. If you’re attacked, they will attack your target instead. The person you hide behind will appear as Highwayman if investigated."],
				"Perks": ["Suspicious - If someone in your alliance is investigated they will investigate you instead."],
				"Achievements": ["[Master Highwayman] - Obtain all Highwayman achievements",
					"[Red Handed] - Successfully use ruthless murder",
					"[Held] - Successfully hold-up someone",
					"[Meat Shield] - Successfully have bloody escape save you"]
			},
			{
				"Name": "Hunter",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "betrayalImages/hunter.png",
				"Description": "You've hid in the shadows, waiting to strike at the right times to benefit yourself. Your life is made of isolation and taking risks.",
				"Abilities": ["Mask - x3 - Common - 1000 - Select someone, giving them a mask which makes all information about them hidden.",
					"Hunt - x3 - Legendary - 4500 - Guess someone’s role. Their role is revealed to everyone and you deal 3 damage to them. If the hunt fails, you become Despaired for 1 day.",
					"Scent Marker - x1 - Rare - 1500 - Mark someone with a special scent, when they take damage, you gain a Stack for Thrill of the Hunt and gain another charge for Scent Marker. If not Hunter, gain one attack power if the target takes damage."],
				"Perks": ["Thrill of the hunt - Gain a Stack every time somebody takes damage with your Scent Marker.<br>1 Stack = Gain +1 Luck.<br>2 Stacks = Gain a charge for Mask.<br>3 Stacks = Mask now cures status effects.<br>4 Stacks = Your attack power becomes 2.<br>5 Stacks = You become immune to attacks.<br>6 Stacks = First attack against you is dodged.<br>7+ Stacks = Gain coins equal to 50 times your stack count."],
				"Achievements": ["[Master Hunter] - Obtain all Hunter achievements",
					"[Hunter's trophy] - Gain 7 stacks on Thill of the Hunt",
					"[Predator] - Kill someone using Hunt",
					"[Façade] - Successfully have your mask stop detection"]
			},
			{
				"Name": "Imp",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "betrayalImages/imp.png",
				"Description": "A trickster of the demonic world, looking for fun!",
				"Abilities": ["Mischief - x3 - Rare - 1250 - Reverse someone's coin percentage for 1 day. If you are Imp, gain a charge for every 2 luck up's used.",
					"Luck Up - x2 - Uncommon - 1250 - Select someone giving them lucky, if they are lucky, give them unlucky and restrained. If you are Imp gain a charge every time someone you had visited before dies.",
					"Gathering Trick - x1 - Epic - 2200 - Select someone, steal all coin percentages and positive statuses from them and their allies for the next coin phase. You get half the coin bonus % stolen.",
					"Impish Grin - x2 - Rare - 1800 - Select someone, doubling their current coin bonus until the next coin phase."],
				"Perks": ["Background laughter - If someone puts a negative status on you or an ally, you'll know who did it, and when using mischief on them, they'll gain the same status back.",
					"Trickster - Upon being investigated in any way shape or form, you will know and can decide to 0 their coin bonuses for the next coin phase. Mass invest effects do not activate this.",
					"Money dump - Any coins people lose due to your abilities, you gain.",
					"Chaotic Nature - Immune to Despaired and Paralyzed.",
					"Double Edged Smile - Upon dying, pick someone. If the selected is who attacked you, strip them of all positive effects and inflict them with any of your remaining abilities of choice - using up charges."],
				"Achievements": ["[Master Imp] - Obtain all Imp achievements",
					"[Mania] - At any point have a total of +100% coin bonuses due to gathering trick",
					"[Broke] - Get someone to -100% or more coin bonuses",
					"[Yoink] - Gain a total of at least 100 coins via Money Dump"]
			},
			{
				"Name": "Jester",
				"HP": "5 HP",
				"AP": "1 AP + Despair",
				"Color": "red",
				"Image": "betrayalImages/jester.png",
				"Description": "Your whole life is a joke. You're such a worthless being that all you do is spread chanting and haunting laughters.",
				"Abilities": ["Jokester - x4 - Common - 750 - Give someone Despair for 1 day, removing all other status effects other than Cursed.",
					"Depressing Ballad - x2 - Rare - 2500 - Select a target, they and their allies will be inflicted with Paralyzed and Despaired for 1 day.",
					"Entire Circus - x1 - Epic - 2800 - Everyone who has visited you or an ally during the game will have their attack power as 0 for 1 day."],
				"Perks": ["Last Laugh - Upon dying, everyone who attacked you will become Despaired. If you survive with 1 HP, all attackers will become Despaired for the next day, and remove despair immunity from anyone who had it, permanently - you learn the roles that lost immunity.",
					"Loose Noose Lasso - If attacked, redirect it to a random despaired person, if this fails, your attacker will become despaired. If immune to these, remove the immunity only.",
					"Party Trick - If you gain a negative status, you will share it with all visitors while it's active on you. You can turn this off."],
				"Achievements": ["[Master Jester] - Obtain all Jester achievements",
					"[Circus Show] - Have Entire Circus hit 3 people",
					"[Jest a prank] - Activate Last Laugh and survive",
					"[Spread the Love] - Have Party trick share the Despair status"]
			},
			{
				"Name": "Juggernaut",
				"HP": "10 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "betrayalImages/juggernaut.png",
				"Description": "You’re a beast, and all you do is become more powerful as the days go by, but you also become more evil and more of a threat to those around you.",
				"Abilities": ["Peek of the Grave - x0 - Uncommon - 1500 - Find the exact role of a player who is dead. If Juggernaut - Gain 1 extra use for Peek of the Living when used.",
					"Peek of the Living - x2 - Uncommon - 1500 - Find the exact role of a player. If Juggernaut -  When the player you investigated gets killed, you gain 1 extra use for Peek of the Grave.",
					"Resilient Aura - x1 - Legendary - 3600 - If you are supposedly killed by the end of day attacks, a player of your choice instead will be dealt this damage and you will heal for 5 HP. If successful, you will heal 5 HP the next day too."],
				"Perks": ["Power Up - When 85% of players are left alive: Heal for 5 HP, Cursed immunity, +1 item per item rain, and 25% added coin bonus.",
					"Power Up Mega - When 60% of players are left alive: Heal for 5 HP, Cursed, Frozen, & Paralyzed immunity, +2 item per item rain, 50% added coin bonus and you have 2 attack power. Disables Power Up if active.",
					"Final Gambit - When 30% of players are left alive: Heal for 5 HP, immunity to bad status effects, +2 item per item rain, 50% added coin bonus and you have 3 attack power. Disables Power Up & Power Up Mega if active."],
				"Achievements": ["[Master Juggernaut] - Obtain all Juggernaut achievements",
					"[Peeping Tom] - Use Peek of the Living and Grave 5 times in a game",
					"[Unstoppable] - Have all perks activate",
					"[Ping pong] - Use Resilient Aura to kill someone"]
			},
			{
				"Name": "Overlord",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "betrayalImages/overlord.png",
				"Description": "You’re extreme. You’re the leader of all evil, you have power over all the evil, you’re what created the word evil. And evil is how you survive.",
				"Abilities": ["Demon Hunt - x6 - Common - 300 - Find out if a player is evil or not.",
					"Reanimate - x2 - Legendary - 4000 - Reanimate a dead player and be able to use any abilities they didn't use.",
					"Discover - x1 - Rare - 1800 - Find the exact role of a player ignoring everything."],
				"Perks": ["Evil Aura - You get x1.5 higher Immunity Card chances and +2 Luck if  all allies are not opposite your alignment."],
				"Achievements": ["[Master Overlord] - Obtain all Overlord achievements",
					"[Hunting Haul] - Find 4 or all evil players in a game",
					"[Uniquely Deceased] - Use a legendary AA with reanimate",
					"[All for One] - Successfully get 2 immunity cards"]
			},
			{
				"Name": "Phantom",
				"HP": "5 HP",
				"AP": "1 AP + Abyssal Curse",
				"Color": "red",
				"Image": "betrayalImages/phantom.png",
				"Description": "Inflicting special curses on many, the days go by, their life ticks down.",
				"Abilities": ["Abyssal Curse - inf - Epic - 2000 - Select someone, gain a use of this every day. The person will suffer the longer the curse is on them. Refer to perks. If not Phantom, simply inflict a status of choice.",
					"Shadowed Hands - x2 - Common - 750 - Speed up all Abyssal affected by a day. Gain a charge if someone gets killed once past/at 3 days. If not Phantom, simply gain a status of choice (not empower or death curse).",
					"Abyssal Blessings - inf - Common - 750 - Give someone of your choice Lucky. If Phantom is using this, it only works on abyssal cursed players, alongside freeing them from the curse."],
				"Perks": ["Abyssal Cursing - The longer it goes on, the more they suffer:<br>0 Days - Inflict a status of choice [excluding DC/Emp].<br>0.5 Days - Inflicted with 2 statuses of choice [^] that they are not immune to, if immune to all, remove 2 immunities.<br>[Cannot inflict blackmail twice in a row to the same target]<br>1 Day - Their actions have a 10% chance to affect someone randomly.<br>1.5 Days - They have a degraded ability of their choice. <br>2 Days - They have a degraded perk of their choice. 10% more chance to affect someone randomly.<br>2.5 Days - All abilities, including AAs are degraded.<br>3 Days - All perks are degraded. 10% more chance to affect someone randomly.<br>3.5 Days - Wipe half their coins and items. 20% more chance to affect someone randomly.<br>4 Days or more - Additional 10% per day to affect someone randomly.",
					"Phantom's Grasp - If you die, all abyssal curses will stop functioning, but will come back once you are back.",
					"Abyssal Shadow - You may gain the investigation results of an abyssal cursed person of choice."],
				"Achievements": ["[Master Phantom] - Obtain all Phantom achievements",
					"[Dying of Old Age] - Have a curse reach 4 days or more",
					"[A Curse Among Us] - Spread the curse to all living players",
					"[Status Machine] - Inflict every status possible to inflict with on any player"]
			},
			{
				"Name": "Psychotherapist",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "betrayalImages/psychotherapist.png",
				"Description": "A name given to those who help psychos and the like - however, you are the psycho here, toying with the insane.",
				"Abilities": ["Gaslighted Discussion - x3 - Rare - 1800 - Select someone, inflicting despair and disable, but also giving Death Immune for 1 day. Next day they will have x2 attacks against them.",
					"Silver Tongue - x3 - Uncommon - 1500 - Select someone, inflicting despair and disable.",
					"Ignorance Bubble - x1 - Rare - 1800 - You and your allies have 5 max HP for 1 day, but take x2 attacks."],
				"Perks": ["Strong Manipulator - You ignore ally affecting negative abilities.",
					"Abusive - If someone uses a negative item on you more than once, inflict paralysis and burn on them, along with finding out their identity.",
					"Corruption - Each time you save someone from death with your abilities, gain +3 luck. Each time your abilities assist in killing them, gain +30% coins.",
					"Watchful Eye - The second time and onwards somebody attacks you; you will be told their identity."],
				"Achievements": ["[Master Psychotherapist] - Obtain all Psychotherapist achievements",
					"[Psycho Protector] - Save someone from death",
					"[Mental Warfare] - Find 2 people’s identity with Abusive or Watchful Eye",
					"[Shieldmaiden] - Avoid 2 or more ally affecting negative abilities"]
			},
			{
				"Name": "Slaughterer",
				"HP": "5 HP",
				"AP": "2 AP",
				"Color": "red",
				"Image": "betrayalImages/slaughterer.png",
				"Description": "Puts the laughter in slaughter.",
				"Abilities": ["Double Edged - x1 - Legendary - 5000 - Select 2 people, both will be forced into a public duel, much like that of an excalibur duel. The first 2 rounds cannot get external help effects. You claim the coins, items and AAs of whoever gets killed, potentially both. If you are Slaughterer - if you enter the duel yourself, your opponent will have external help do nothing for them. Duels work like this: one player calls a number from 1 to 3 in offense and one in defense; the offense player will deal 3 damage to the defense player if they call the same number and exit the duel.",
					"Skinning - x2 - Rare - 2000 - Select someone, stripping them of all their AA's, you gain a random one.",
					"Bone Breaker - x1 - Rare - 2500 - Smash someone up, giving unlucky, burning, paralyzing, disable, frozen, despairing, and restraining them for 1 day.",
					"Corpse Shield - x1 - Uncommon - 1500 - Pick someone, once they are dead, they will take any hits from you for 3 HP. Upon target hit, regain a charge if you are Slaughterer."],
				"Perks": ["Freakish Nature - Your non-aligned allies have their luck added to yours (not taking their luck). This is added before your own lucky/unlucky but after their lucky/unlucky/perk calculations.",
					"Blood Luster - Killing items cannot send you to death when you use them, and can be manipulated by you to a degree.",
					"Body Count - Each time you kill someone, gain an immunity of choice, including Death Immunity for 1 day, along with +30% coin bonuses."],
				"Achievements": ["[Master Slaughterer] - Obtain all Slaughterer achievements",
					"[Meat Shield] - Successfully redirect 2 attacks through the use of Corpse Shield",
					"[Last Laugh] - Kill someone with Double Edged",
					"[Flayed] - Destroy 5 AA's with the use of Skinning"]
			},
			{
				"Name": "Threatener",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "betrayalImages/threatener.png",
				"Description": "Your only way of living is by threatening other people to do what you want.",
				"Abilities": ["Steal - x3 - Rare - 2500 - If the player you chose has any items, you will take them all.",
					"Shutdown - x3 - Uncommon - 1800 - Target a player, blackmail them and prevent them from attacking for 1 day.",
					"Redirect - x3 - Uncommon - 1500 - Redirect a player to visit a player of your choice next time they visit somebody. They will not be informed.",
					"Survivalists Threaten - x2 - Epic - 2200 - Prevent two players from attacking two players of your choice for 1 day. Can prevent players from attacking you."],
				"Perks": ["Dealer - Allows you to transfer coins to somebody. Any ally can also transfer money to each other."],
				"Achievements": ["[Master Threatener] - obtain all Threatener achievements",
					"[Thief] - Steal a total of 5 items",
					"[Bully] - Shutdown 2 people that attacked you",
					"[Takeover] - Use Survivalist's Threaten on 1 person that attacked you"]
			},
			{
				"Name": "Witch Doctor",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "betrayalImages/witchdoctor.png",
				"Description": "You were born with crazy magical healing powers, but instead of making good use of them, you decided you abuse them. Your abuse has made you into a devious Sorceress who causes chaos and disruption.",
				"Abilities": ["Soul Binding - x1 - Legendary - 4500 - Choose 2 players. Those players are now connected, and if one of them dies, the other dies too. All status ailments/effects and buffs are shared as well. Link is broken when you are killed.",
					"Voodoo Doll - x1 - Legendary - 4000 - Make a Voodoo Doll of someone, anything that happens to you will also happen to them. This Voodoo Doll becomes an item in your inventory and whoever holds the item has this power.",
					"Hex - x1 - Epic - 2500 - Whoever is affected by the Hex, can use their next item twice. You cannot loop this ability via empower giving items."],
				"Perks": ["Insane - You cannot become Despaired, Drunk or Blackmailed.",
					"Magic Mind - Your actions cannot be controlled by anyone or anything."],
				"Achievements": ["[Master Witchdoctor] - Obtain all Witchdoctor achievements",
					"[Blood Bound] - Kill someone via Soul Binding",
					"[Hexed] - Have someone use an item twice due to your Hex",
					"[Play Time] - Transfer 3 effects due to Voodoo Doll"]
			}
		]
	}
]