roles = 
[
	{
		"Good": 
		[
			{
				"Name": "Agent",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "Your whole life, you've been watching others. Your scouting skills have stayed intact and led you to prepare for a life-threatening moment like this.",
				"Abilities": ["Follow - x3 - Common - 1000 - You will know everything your target does for 1 day from use. Does not include perk-based actions.",
					"Spy - x3 - Common - 1000 - You will know everything that happens to your target 1 day from use.",
					"Hidden - x2 - Uncommon - 1500 - For 1 day from the usage of the ability, anything done on you will be reflected back to the user."],
				"Perks": ["Hawkeye - If someone steals from you, you will know who did it.",
					"Organized - Your attack cannot be blocked or tampered with in any way.",
					"Tracker - If anyone does a positive action to your allies, you will know who gave who and what it was."],
				"Achievements": ["[Master Agent] - Obtain all Agent achievements",
					"[Pro Hider] - Successfully reflect 4 actions with Hidden",
					"[Stalker] - See 3 abilities or items used out of Follow",
					"[Observer] - See 3 abilities or items used out of Spy"]
			},
			{
				"Name": "Analyst",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "You're a street smart person, capable of using signs and signals to see past the surface. You might just be the smartest there ever was, or at least you think so.",
				"Abilities": ["Chemistry - x3 - Common - 500 - Select 2 people by name, if they are allies, you will be told, and can select another person, this loops multiple times.",
					"Vibe Check - x5 - Common - 750 - Select 2 people, you will know if they are the same alignment. You cannot select the same person more than twice.",
					"Subtraction - x3 - Uncommon - 1000 - Select someone, view their alliance’s items. These items will be shown combined with each other. You also find out about any inventory affecting effects on the player you chose.",
					"Inspection Zone - x1 - Uncommon - 1500 - Upon use, you will know everything to affect you within the next day, and who did it. If someone tries to attack you, you will dodge it. If someone tries to inflict you with a negative status, it will reflect back onto them."],
				"Perks": ["Face Reader - If an ally gains info feedback from anything, you will be told the information as well.",
					"That Much Smarter - Information items can be upgraded freely by you, or, have 2 uses. Info AAs can be upgraded by you as well.",
					"X-Ray Vision - Any form of investigation done by you cannot be affected by perks or abilities, assuming the target is visitable."],
				"Achievements": ["[Master Analyst] - Obtain all Analyst achievements",
					"[Full View] - Use Subtraction to see a legendary or greater item or 4 or more items",
					"[Well Connected] - Use chemistry 2 times with one charge",
					"[Inspected] - View at least 3 visits via inspection zone"]
			},
			{
				"Name": "Biker",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "Apparently nobody else in this damn game owns a vehicle, all you want is the wind in your hair though. Who cares if a few people get run over?",
				"Abilities": ["Burning Rubber - x4 - Rare - 2000 - Target somebody, either: Clear all negative statuses on them, and everybody who visits them negatively or neutrally for the next day will be burned OR burn them, and everybody who visits them positively within the next day will also burn.",
					"Stick With the Pack - x1 - Epic - 4500 - Target an ally, inflicting them with Rev Up permanently.",
					"Lunch Break - x1 - Epic - 4500 - Disable Rev Up, Rider of the Storm, and all uses of Burning Rubber for 1 day and be Death Immune. If not Biker, just become Death Immune for 1 day."],
				"Perks": ["Motor Gang - If you have an alive ally, you have 2 AP. Every good within your alliance gains an additional +1 luck, as well as yourself.",
					"Rider of the Storm - If you have an alive ally, you gain immunity to paralysis, burn, freeze, and your ability usage can’t be blocked.",
					"Rev Up - All timed statuses and abilities happen in half the time for you, not including curse, burn, paralysis, or mass game effects.",
					"Full-Throttle Slam - If an ally is attacked, ram the attacker with your bike, dealing 3 damage to them, you find out who they are and their role."],
				"Achievements": ["[Master Biker] - Obtain all Biker achievements",
					"[Fastest Bike in the West] - Have Rev Up and Stick With the Pack affect 4 or more timed statuses and abilities",
					"[Fueled Up] - Have Lunch Break allow you to avoid death for a day",
					"[Eye For An Eye] - Kill someone with Full-Throttle Slam"]
			},
			{
				"Name": "Cerberus",
				"HP": "10 HP",
				"AP": "1 AP + Burn + Freeze (no extra damage)",
				"Color": "lime",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "A demon tasked with protecting the gates of hell, having followed the overlord, takes up protecting others as its main task.",
				"Abilities": ["Fire Guard - x2 - Epic - 2200 - Select someone, for 1 day you will know of any negative visits to the person, and can decide to reverse each effect, burn the visitor, or do nothing at all. This includes all negatives such as damage.",
					"Ethereal Healing - x2 - Epic - 3800 - Select 2 people, removing all negatives from the first and putting them on the second, and removing all positives from the second onto the first. You can select dead people.",
					"Lava Wall - x2 - Rare - 2200 - When used, if an ally is visited within the next day, burns the visitor and destroys their lowest tier item. The burn fails if already burning, but still has an item destroyed."],
				"Perks": ["Spare Heads - Burn and freeze attackers.",
					"Hades Hound - You are immune to Frozen and Burned.",
					"Ash Formation - Any items you cause to be burnt away, you gain. This includes Lava Walls' item destruction."],
				"Achievements": ["[Master Cerberus] - Obtain all 3 Cerberus achievements",
					"[Underworld's Guard] - Successfully save allies from 5 negatives via Fire Guard",
					"[Ethereal Sight] - Successfully use Ethereal Healing to swap 4 positives/negatives",
					"[Ashes to Riches] - Gain 3 items via Ash Formation"]
			},
			{
				"Name": "Detective",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "Your life revolves around finding information and using it to your advantage, and that's what you plan to do.",
				"Abilities": ["Search - x5 - Common - 700 - Find out what type of action your target most recently did (investigative, killing, healing etc) and the player they used it on.",
					"Interrogate - x3 - Uncommon - 1500 - You're given 2 possible roles that the person you select could be, one is a random false role and the other is their actual role.",
					"Solve - x0 - Uncommon - 1000 - Figure out any piece of information of your choice about a player. Gain a charge for this every day if you are a Detective."],
				"Perks": ["Clever - Immune to Blackmailed, Disabled and Despaired.",
					"Self-Defence - If anyone tries to attack you, they will fail and you will give them Blackmailed. Additionally, you find out their name & role."],
				"Achievements": ["[Master Detective] - Obtain all Detective achievements",
					"[Karate Block] - Have someone attack you and fail",
					"[Caveira] - Interrogate 3 different people from 3 different factions",
					"[Dedicated] - Use Solve 5 times in a game"]
			},
			{
				"Name": "Fisherman",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "You're a relaxed, level-handed guy who just likes to catch fish, so much that you can use your fishing skills for various other things",
				"Abilities": ["Reel - x3 - Uncommon - 1000 - Select a person and steal their most recent item; if they are opposite your alignment, you will see their inventory and can choose what item to steal.",
					"Fishing Trip - x3 - Rare - 1500 - You receive a random common item or AA (you choose which). The more times you use Fishing Trip the higher the rarity of item/AA you will get. Upon mythical loop to common.",
					"Hooked - x2 - Epic - 2800 - For 1 day, any items/AAs your target gives or receives, you'll take instead.",
					"Bait - x2 - Epic - 3100 - Select someone: For 1 day any action people use on another player in your zone (excluding you & the target) will redirect towards the target. If the user or the target dies, this ability stops."],
				"Perks": ["Fishing Buddies - If you have an alive ally, gain an extra item during item rains."],
				"Achievements": ["[Master Fisherman] - Obtain all Fisherman achievements",
					"[Gone Fishin'] - Obtain a legendary item/AA with Fishing Trip",
					"[Good Haul] - Steal an epic or higher item/AA",
					"[The Loch-Ness Monster] - Redirect 4 visits"]
			},
			{
				"Name": "Gunman",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "You want to stop evil and prove yourself worthy, that is your only goal. You only have one shot at life, literally. Make sure it’s worth it or it will really haunt you.",
				"Abilities": ["Fire - x3 - Legendary - 4500 - Shoot a player, dealing 3 damage. If you deal damage to someone of your own alignment, deal 3 damage to yourself."],
				"Perks": ["Confidence - Once you’ve killed someone not with your alignment, you become immune to negative status effects.",
					"Ignorant - Cannot be redirected to another target when you attack somebody.",
					"Justice’s Gift - If you kill someone with the opposite alignment, you will obtain an Unreliable Wish and any AAs, items and money they had."],
				"Achievements": ["[Master Gunman] - Obtain all Gunman achievements",
					"[Demon Slayer] - Kill 2 people successfully",
					"[Trigger Happy] - Gain the Confidence perk",
					"[Dictator] - Shoot someone who has attacked you multiple times (more then twice)"]
			},
			{
				"Name": "Hero",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "Your ambition was always to do something magnificent and brave. It’s always what you wanted to do, and you will try as hard as you can to achieve that goal.",
				"Abilities": ["Venture - x6 - Common - 300 - Find out if a player is good or not.",
					"Mentor - x1 - Epic - 2800 - Learn one ability of an ally of your choice.",
					"Protection - x3 - Uncommon - 2500 - Make an alliance member Death Immune. If Hero, you can give a charge of this as an AA to others. Can’t self pick."],
				"Perks": ["Heroic Power - You get x1.25 higher Immunity Card chances and +3 Luck.",
					"Gilded - Every immunity card you get, increase the immunity card chances by 2.5%. This is added after other chance effects. Hero can get bonuses in an alliance alone."],
				"Achievements": ["[Master Hero] - Obtain all Hero achievements",
					"[Uniquely Taught] - Successfully use Mentor on a non AA",
					"[Good Doers] - Find 4 good people or find all good people in the game",
					"[Legendary Protector] - Save 2 people using protection"]
			},
			{
				"Name": "Hydra",
				"HP": "10 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "A multi-headed beast out on a quest to redeem itself for a place with God.",
				"Abilities": ["Head Slam - x0 - Rare - 2000 - Select someone, destroy their lowest tier item and inflict a negative status you are immune to of choice. Must cycle through all immunities before inflicting the same again.",
					"Chomp - x0 - Uncommon - 1800 - Select someone; they will be unable to perform actions to people other than their allies for half a day. Can stack.",
					"Tear Out - x0 - Rare - 2000 - Select someone, dealing 1 damage. Inflict a negative status of choice you are not immune to. Must cycle through all non-immunities before inflicting the same again.",
					"Head Shield - x0 - Epic - 3200 - Select as many players as things you are immune to. If 0, pick 1. Negative actions on them will fail to work, the person using it will keep the charge but be unable to act for a quarter of a day. Neutral visits will inform you and the target what occurred and who did it. Lasts half a day. Can stack. You can bypass this.",
					"Visceral Roar - x0 - Epic - 2000 - Select someone, they will pick as many negative statuses they want and will gain attack power equal. Will be inflicted with them all the next day. Selecting immunities will remove immunities."],
				"Perks": ["Regenerative - If inflicted with a negative status, gain immunity to it after it is cured/worn off. If blocked or redirected, develop immunity to that interaction - all immunities develop on day end.",
					"Multi-headed Stare-down - If you perform multiple actions, you can have them all register as a single visit, even to multiple people. Your action will register as the most convenient type.",
					"Rejuvenative Aura - Players in the same zone that get cured of a status will develop immunity to it. You may turn this off/on, and may pick which players gain this.",
					"Head Growing - Each time you [or ally] gain an immunity, and/or a new day starts, gain a base ability charge [Max 5 per day from immunities]."],
				"Achievements": ["[Master Hydra] - Obtain all Hydra achievements",
					"[The Infinity Heads] - Gain immunity to 5 statuses or more",
					"[Battlecry] - Give or gain attack power of 3 or more with Visceral Roar",
					"[Pet Me] - Block 3 targets or more throughout the game using Head-Shield and Chomp"]
			},
			{
				"Name": "Judge",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "You want the world to be a utopia, where it’s free of crime, poverty and hatred. You want the evils gone, but if you fail you will gradually weaken yourself.",
				"Abilities": ["Lawful Trial - x1 - Epic - 2800 - Changes the day to have two attacks per person. You have 1 more AP and 5 more max HP for 1 day.",
					"Overrule - x2 - Epic - 2400 - Each attack to the player of choice deals 1 more damage. Also removes any Death Immune.",
					"The Hammer - x1 - Epic - 2800 - Use this to completely stop daily attacks. No one can attack today."],
				"Perks": ["Justice - If all people killed during the Lawful trial are not your alignment then you gain a random Epic-Mythical tier item.",
					"Dystopia - If all people killed are your alignment during the Lawful trial then you take 2 HP damage and are despaired for 1 day."],
				"Achievements": ["[Master Judge] - Obtain all Judge achievements",
					"[Hammer time] - Save an ally with The Hammer",
					"[Bypasser] - Bypass 1 Death Immunity with overrules",
					"[Courts Master] - Gain the Justice perk"]
			},
			{
				"Name": "Manager",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "You’re experienced at organization and managing people and will do whatever it takes to create the perfect alliance.",
				"Abilities": ["Kick - x4 - Uncommon - 1000 - 1 charge, Remove alliance coin and luck bonuses for 1 day from the target. 2 charges, Also make the target lose 25% of their total coins which is evenly spread throughout your alliance and your personal luck goes up by 1. Getting killed will stop any active kicks.",
					"Contract - x2 - Uncommon - 1000 - Give an ally +25% coins value. If they are your alignment, gain +25% for yourself too.",
					"Discount - x4 - Uncommon - 1000 - Give yourself or an ally a 50% reduced price on every buyable item until you/they buy one. Does not stack to get more reduction.",
					"Ban - x1 - Epic - 2800 - Remove all alliance coins and luck bonuses from a chosen player and allies for 1 day. If you die the ban goes off."],
				"Perks": ["Tradesman - Your luck goes up by 1 every time you receive an item from a player.",
					"Money Transfer - Allows you to transfer an amount of coins to anyone within your alliance. Any ally can also transfer the coins."],
				"Achievements": ["[Master Manager] - Obtain all Manager achievements",
					"[Client] - Contract the same person twice",
					"[Clearing price] - Discount an item 4 times",
					"[Removal] - Kick 2 people"]
			},
			{
				"Name": "Mecha",
				"HP": "10 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "You are a defensive robotic machine that takes pleasure in military and undercover procedures.",
				"Abilities": ["Entrapment - x2 - Rare - 1800 - Select someone, if they attempt to harm you within the next half a day, evade it and inflict the harm back on them, along with gaining a charge/item of whatever they used. If it is a base attack, gain that player’s attack power for half a day.",
					"Target Fire - x1 - Legendary - 4000 - Select 2 people, if one harms the other within the next day, both get hit by it 3 fold.",
					"Smoke Grenade - x2 - Rare - 2200 - Select someone, if they attempt to harm anyone within your alliance within the next day, cause it to fail, and give them 3 drunk stacks, burn, and curse.",
					"Last Resort - x1 - Epic - 4800 - Select someone, they are Death Immune. If saved from death, all attackers on the target will become paralyzed."],
				"Perks": ["Enhanced Learning - Each time your base abilities are successfully used, gain 1 luck and 5% coins.",
					"Lock On - Redirections will work on you, but also inflict your original target and redirection users with the ability/item as well"],
				"Achievements": ["[Master Mecha] - Obtain all Mecha achievements",
					"[It's a trap!] - Successfully trigger Entrapment 3 times",
					"[Now you see me...] - Use smoke grenade to protect an ally 3 times",
					"[Final Gambit] - Successfully use Last Resort"]
			},
			{
				"Name": "Medium",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "You're a quiet, passionate and lonely soul who has the ability to talk to the dead.",
				"Abilities": ["Bury Alive - x2 - Rare - 2100 - Bury someone for 1 day, making them count as dead and finding out their role. They cannot act outside of what they could do when dead, except talk. Abilities that work on dead players will now work on your targets.",
					"Preserve - x2 - Uncommon - 2100 - If someone was killed, within 1 day, you can use this on them to make them survive for 1 more day. If they are healed, ethereal healed, breaked, saving grace, protection or blessed within that time they will avoid death and heal to full, if not, you take any money they have on them.",
					"Soul Seer - x1 - Uncommon - 1250 - Select a player, upon them being killed, you can see their role, their items, money and their last actions. If Medium, you gain a charge upon the selected player dying. If used on yourself and you are killed, you cannot be stolen from."],
				"Perks": ["Service - If you save anyone with Preserve, they deal half damage to you for the rest of the game.",
					"Haunted Tombstone - Cut a player of your choice's coins in half when you’re killed, you choose who gets the coins."],
				"Achievements": ["[Master Medium] - Obtain all Medium achievements",
					"[Preservation] - Gain 1000 coins or revive someone via preserve",
					"[Death Data] - Use Soul Seer on 3 people",
					"[Living Line Blur] - Bury someone alive, saving them from death, or getting a dead-only ability used on them"]
			},
			{
				"Name": "Nurse",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "Your only desire in life is to heal others and help the ones you need to survive yourself.",
				"Abilities": ["Heal - x3 - Uncommon - 2000 - Heal your target for 5 HP.",
					"Vaccinate - x3 - Uncommon - 1800 - Your target becomes immune to a status effect of your choice.",
					"Cure - x3 - Uncommon - 1500 - Cures your target of any status effect[s] of your choice."],
				"Perks": ["Powerful Immunity - Immune to negative status effects.",
					"Medical Bills - You may charge your target an amount of coins when using any of your abilities on somebody. If they refuse the bills, you will get your ability charge back."],
				"Achievements": ["[Master Nurse] - Obtain all Nurse achievements",
					"[Head Doctor] - Heal 3 people to full HP",
					"[Anti-vaxxers’ Worst Nightmare] - Vaccinate 1 person three times",
					"[Private Healthcare] - Earn 1500 coins or more from Medical Bills"]
			},
			{
				"Name": "Seraph",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "You believe yourself to be a higher angel incarnated in physical form, here to show sinners the correct path.",
				"Abilities": ["Purification - x2 - Uncommon - 1800 - Select someone, all negative statues on them are inflicted back on the original users.",
					"Ascend - x2 - Uncommon - 2200 - Soar into the air, and see who visits yourself and allies for the next half a day. You will avoid negatives while this is active.",
					"Holy Light - x2 - Uncommon - 2200 - Select someone, returning any positives lost within the previous half a day and heal them for 3 HP. If they hadn't lost any positives, the next positive performed by them and done to them is 2 fold."],
				"Perks": ["Cleansing Aura - Negative statuses on yourself and allies are degraded to not be as effective.",
					"Angelic - Positives inflicted by you on others will reward you with 200 coins. Positives inflicted on you will reward the inflictor with 100 coins, provided it's not you.",
					"Golden Thread - If you are killed, it is delayed by 1 day. Any sort of healing or preservation within this state will prevent you from being killed."],
				"Achievements": ["[Master Seraph] - Obtain all Seraph achievements",
					"[Angelic Clearing] - Inflict / remove 3 statuses using purification",
					"[Above it all] - Avoid 2 negatives using ascend",
					"[Holy Blessings] - Regain a positive using Holy Light"]
			},
			{
				"Name": "Terminal",
				"HP": "5 HP (10)",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "Once one of the greats, your time is nearing, power dwindling due to the falling of others, but you wont give up just yet.",
				"Abilities": ["Emotional Surge - x1 - Rare - 2400 - Inflict someone of choice with statuses that you have lost immunity to.",
					"Final Swing - x1 - Legendary - 5200 - While having less than or equal to 3 regrets, you can disable someone's perks and abilities until you die. If you have 4 or more, you can disable someone's perks or abilities until you die. Using this will add 3 regrets. If you aren’t Terminal, simply disable their perks and abilities until you die.",
					"Saving Grace - x3 - Rare - 2100 - Select someone, healing them for 3 HP every half a day for 1 day and saving them from negative effects for the next day.",
					"Body Shield - x1 - Epic - 2700 - Select someone, if they are attacked, they take no damage for a day, however, you lose an active perk of choice; but also lose 3 regrets. Cannot remove Hourglass of life or be self-used unless reflected/redirected. If you aren’t Terminal, they simply take no damage for a day."],
				"Perks": ["Hourglass of life: Every time an ally gets killed, gain 1 regret.",
					"Heartbeats: Immune to all negative statuses, but every time you gain a regret, lose an immunity of choice.",
					"Spiritual Remains: While without regrets, your max HP is 10.",
					"Shaking Hands: While having less than 3 regrets, you cannot be redirected.",
					"Shallow Breaths: While with less than 4 regrets, if an ally or yourself is attacked, you can choose to deal 3 damage to the attacker, or stop them, paralyzing and despairing them. Not dealing damage to them will remove a regret from yourself.",
					"Level Headed: While with less than 6 regrets, you will remove a negative status from yourself or an ally of choice every day."],
				"Achievements": ["[Master Terminal] - Obtain all Terminal achievements",
					"[Cleared] - Remove a total of 4+ statuses due to level-headed",
					"[Guardian Angel] - Have saving grace heal 6 HP",
					"[Breath-taking] - Save an ally with shallow breaths"]
			},
			{
				"Name": "Time Traveler",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "You have mastered the element of time, you know its entire construct and can control it as much as you want.",
				"Abilities": ["Double time - x1 - Legendary - 3800 - All allies will have their next ability happen twice, or if it involves time, either twice as fast or twice as long. Double time won't work on double time.",
					"Rewind - x2 - Rare - 2200 - Select someone, any statuses they had and items they used in the past day, they regain. Cannot use on the same person within 1 day - Global Cooldown.",
					"Loop - x1 - Epic - 2500 - Select someone, any negative abilities or item effects that have affected them within the past day and the next day, will affect them again for the next day."],
				"Perks": ["Timelines - You can choose with up to a half a day delay, when a status placed on you begins affecting you.",
					"Time Zoned - If your ability is reflected back onto you, or fails/blocked, you can re-use it."],
				"Achievements": ["[Master Time Traveller] - Obtain all Time Traveler achievements",
					"[Double Trouble] - Double an ally’s actions",
					"[Redone] - Use rewind to regain 3 items",
					"[Noose Loop] - Loop someone's negative statuses for the full time successfully"]
			},
			{
				"Name": "Undercover",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "lime",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "You want to stay a secret to everyone, if you get exposed to what you really are, then the future will not be bright for you.",
				"Abilities": ["Black Cloak - x7 - Common - 750 - Next time someone visits you, they get redirected to a target of your choice.",
					"Deduct - inf - Uncommon - 1800 - Find the exact role of a player of your choice, and have a 1 day cooldown after use if you are Undercover.",
					"Investigate - x3 - Uncommon - 1500 - Find out who attacked your target and who your target attacked for the past day."],
				"Perks": ["Exposed - If three currently living people have declared you as the Undercover, you cannot use Deduct or Investigate anymore. If someone incorrectly declares, find out who they are, and you may reduce their coin bonus to 0% and inflict a negative (not Death Curse) status of choice, at any point once per incorrect guess.",
					"Paranoia - Cannot be redirected.",
					"White Clues - Gain a charge for Investigate every time you deduce an opposite aligned person."],
				"Achievements": ["[Master Undercover] - Obtain all Undercover achievements",
					"[No U] - Use black cloak to make someone target themselves",
					"[Under the Radar] - Don't get exposed for the whole game",
					"[Investigator] - Use Investigate 5 times"]
			},
			{
				"Name": "Wizard",
				"HP": "5 HP",
				"AP": "1 AP + Freeze/Paralyze/Burn (pick 1, no extra damage)",
				"Color": "lime",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "You’re the master of spells. You’ve been practicing magic ever since you were young, and you will use the magic to your advantage.",
				"Abilities": ["Freeze - x1 - Common - 1500 - Freeze somebody, giving them a special 2 day, 1/3 thaw chance freeze. Can choose if it removes any other status effect they have apart from Cursed.",
					"Electrify - x1 - Common - 1500 - Electrify somebody, giving them a special Paralyzed which stuns for 1 day and a half. Can choose if it removes any other status effect they have apart from Cursed.",
					"Empower - x1 - Legendary - 6200 - Empower somebody, giving them Empowered. Removes any other status effect they have apart from Cursed. You can empower yourself as many times as you want, but cannot empower the empower ability.",
					"Fireball - x1 - Common - 1500 - Burn somebody, giving them a special Burned which burns every half day for 1 day. Can choose if it removes any other status effect they have apart from Cursed.",
					"Bless - x2 - Rare - 3200 - Bless somebody, removing all curses from them if they have any. It can also revive a dead player if they're preserved."],
				"Perks": ["Magic Barrier - Immune to Frozen, Paralyzed, Burned and Cursed. Reflects onto the inflictor."],
				"Achievements": ["[Master Wizard] - Obtain all Wizard achievements",
					"[Unlimited Power!] - Empower yourself",
					"[Warlock] -  Electrify, Freeze and Fireball the same person",
					"[Priest] - Bless 2 people who are cursed"]
			},
			{
				"Name": "Yeti",
				"HP": "10 HP",
				"AP": "2 AP + Freeze (no extra damage)",
				"Color": "lime",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "You are a monster that thrives off sticking around in cold environments, you decided to help the person who helped you from a fateful encounter.",
				"Abilities": ["Encapsulate - x2 - Rare - 1500 - Target a player, freeze them. While frozen, they are unable to be visited by non-allies and you. However, they can be visited by anyone to cure Frozen.",
					"Sheltered in Ice - x2 - Rare - 1800 - Inflict Frozen on all allies, while frozen they are immune to negatives and heal for 3 HP. If they are immune, you will learn and choose to bypass it. You may choose to unfreeze them at any time.",
					"Nomadic Tribute - x1 - Rare - 2300 - Anyone currently frozen will take 1 damage and be unable to thaw entirely. Refresh the duration of all freezes."],
				"Perks": ["Winter Coat - You reflect freeze, don’t deal damage to allies with freeze, and may choose to give allies immunity to freeze. You may choose to also remove this immunity at any time.",
					"Nomadic - You can see who is currently frozen at any time in your zone and will be told if anyone thaws.",
					"Icicles - When any players thaw out naturally, you may choose to re-freeze them for 1 day."],
				"Achievements": ["[Master Yeti] - Obtain all Yeti achievements",
					"[Protector] - Heal someone with less than half their max HP",
					"[Bigfoot] - Kill someone using Nomadic Tribute",
					"[Ice Wizard] - Freeze 3 separate people"]
			}
		],
	},
	{
		"Neutral": 
		[
			{
				"Name": "Amalgamation",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "All for one, all for you.",
				"Abilities": ["Absorption - x2 - Legendary - 4800 - select someone, upon them dying, see their abilities and perks, pick 1 of each and gain 1 max HP, if Amalgamation, regain a charge of this after doing so."],
				"Perks": ["Eternal hunger - Every time something is used on you, gain a 5% coin bonus."],
				"Achievements": ["[Master Amalgamation] - Obtain all Amalgamation achievements",
					"[I’m Rich] - Gain a 50% coin bonus or higher",
					"[I’m Fat and Happy] - Gain 8 max HP or higher",
					"[I Like Your Taste] - Absorb the same player twice"]
			},
			{
				"Name": "Backstabber",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "You’re a strong guy, and you can choose to help anyone you want, but you can also backstab anyone you want at any time. This is how you interpret life, betraying to survive.",
				"Abilities": ["Man's Blessing - x3 - Rare - 1250 - Select a player, this player has 1 less attack power for 1 day. This can stack and go across multiple players.",
					"Decode - x3 - Epic - 2500 - Reverse the effects of Man's Blessing, making the player have an increased attack power instead or reverse the effects of Fatality, making any attacks deal 1 damage more. If not Backstabber, choose to gain a reversed charge of Man’s Blessing or Fatality.",
					"Fatality - x2 - Epic - 2200 - For 1 day, all attacks on a selected player and the player’s allies deal 1 less damage."],
				"Perks": ["Manipulator - If you Decode someone and they have the lucky status, they get the unlucky status or vice versa. Same applies with burned & frozen. You can choose to turn this off.",
					"Finger of Death - When you get killed, you may pick a target to have the first attack to deal 2 extra damage. Once that target dies, you may choose another player.",
					"Counting Stars - Every time one of your allies gets killed, you gain a charge for Man's Blessing or Decode."],
				"Achievements": ["[Master Backstabber] - Obtain all Backstabber achievements",
					"[Night Sky] - Have at least 1 ally get killed at any time during the game",
					"[Force Fingered] - Have a target affected by Finger of Death die",
					"[Wishy Washy] - Decode or Man’s Blessing 4 times"]
			},
			{
				"Name": "Banker",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "You love numbers, and really big ones at that. Even better if they're YOUR big numbers, and you will do anything you can to raise them.",
				"Abilities": ["Inheritance Tax - x1 - Uncommon - 1500 - You take all the money from a player that died.",
					"Last Will - x4 - Rare - 2000 - Take 50% of the coins of any player that attacked you in the last half a day.",
					"Payday - x1 - Rare - 2000 - Everyone currently alive must pay up to 200 coins to you or become Restrained for 2 days.",
					"Inflate - x1 - Rare - 2500 - Increases an item's price by 1000 coins."],
				"Perks": ["Bank Loans - All allies gain x1.2 more coins. Also allows you to transfer an amount of coins to anyone. Any ally can also transfer money to each other.",
					"Greedy - If 50% of living players pay payday, you gain 1 attack power for 1 day, if 75% pay, gain 2 attack power instead for 1 day.",
					"Shopkeeper - You will know when an item is bought, and what item it is."],
				"Achievements": ["[Master Banker] - Obtain all banker achievements",
					"[Pretty Penny] - Gain over 500 coins using inheritance tax",
					"[Written Off] - Reduce 4 people's money using last will",
					"[Payday Payoff] - Gain 800 coins or more with Payday"]
			},
			{
				"Name": "Bard",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "yellow",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			}
		],
	},
	{
		"Evil": 
		[
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			},
			{
				"Name": "",
				"HP": "5 HP",
				"AP": "1 AP",
				"Color": "red",
				"Image": "https://upload.wikimedia.org/wikipedia/en/6/62/Agent_47_in_Hitman_Absolution.png",
				"Description": "",
				"Abilities": [],
				"Perks": [],
				"Achievements": []
			}
		]
	}
]