data = 
[
	{
		"Roles": 
		[
			{
				"Name":"Alchemist",
				"Color": "white",
				"Image": "",
				"Description": "Mix a bunch of materials together to destroy your enemy.",
				"HP": "10 HP",
				"Difficulty": "Hard",
				"Tags": "Human",
				"Actives": ["Gather Materials (1 day cooldown, 2 charges a day) - Gather 2 materials of your choice between Strange Gems (G), Strange Herbs (H), and Strange Liquids (L).",
					"Create Potion - Choose a potion and create it based on the materials you have.",
					"=======================================================================",
					"List of Potions: Combine the materials as listed above to create that potion. You can basically combine 2 potions of any kind a day.",
					"Stoneskin Potion (G G) - Give someone a potion to shield them for 10 HP for today.",
					"Explosive Potion (G H) - Give someone a potion that explodes, dealing 3 damage to them and anyone that visits them today (avoiding friendly fire unless you want it).",
					"Revealing Potion (G L) - Give someone a potion to find out what role they are.",
					"Pain Potion (H G) - Give someone a potion that deals 5 damage to them.",
					"Power Potion (H H) - Give someone a potion to have their next damaging ability deal 3 more damage.",
					"Healing Potion (H L) - Give someone a potion to heal them for 5 HP.",
					"Detection Potion (L G) - Give someone a potion to find out who they visit for today.",
					"Poison Potion (L H) - Give someone a potion to make them poisoned, dealing 1 damage for every action they do today.",
					"Invisibility Potion (L L) - Give someone a potion to make them unvisitable for today."],
				"Passives": ["None."]
			},
			{
				"Name":"Angry Mob",
				"Color": "white",
				"Image": "",
				"Description": "Apes together strong, and apes together extremely angry.",
				"HP": "5 HP",
				"Difficulty": "Hard",
				"Tags": "Human",
				"Actives": ["Riot (2 day cooldown) - Riot and attack someone, dealing damage increased by the number of mob members you have. If you have 5 HP, you deal 5 damage. Lose half your mob members (HP).",
					"Arm the Mob (1 day cooldown, 3 charges) - Add arms to the mob, increasing their violence and damage, giving 3 HP to you (therefore giving 3 damage).",
					"Angry Protest (2 day cooldown) - Occupy 3 people today, and gain 3 HP.",
					"Twitter Mob (1 day cooldown) - Rant on twitter, gaining 1 HP.",
					"Suicidal Mob (2 day cooldown) - Have 3 mob members suicide onto someone, dealing 3 damage to both of you, but gaining 1 HP.",
					"Stampede (3 day cooldown) - Create a stampede at someone’s house, trampling anyone that visits and deal 5 damage to both you and anyone that visits.",
					"Incite Violence (2 charges) - Incite violence at home, gaining 2 HP and dealing 1 damage to anyone who comes to your house, including allies."],
				"Passives": ["Mob Mentality - You must grow the mob by inciting violence and chaos, each mob member counts as 1 HP and you must constantly grow the mob. You take double damage to everything. If you don’t do something each day, you lose 2 mob members (2 HP). Cannot be healed by others."]
			},
			{
				"Name":"Battle Drone",
				"Color": "white",
				"Image": "",
				"Description": "Take the air and decimate your enemies with your powerful AI.",
				"HP": "5 HP",
				"Difficulty": "Hard",
				"Tags": "Mechanical, Air",
				"Actives": ["Single Shot (1 day cooldown) - Shoot someone and deal 3 damage. Deal 5 damage to Air targets.",
					"Targeting Laser (1 day cooldown) - Mark someone, making all attacks on the target unable to be dodged.",
					"Data Collection (2 charges) - Collect data on someone, taking pictures of them. Gives a charge of Reinforcement Learning.",
					"Reinforcement Learning (0 charges) - Gain significant intel on someone, allowing you to ask a question to get some useful intel on that player.",
					"Drone Bomb (1 day cooldown, 2 charges) - Bomb someone, dealing 8 damage to that player but deal 4 damage to yourself.",
					"Drone Repairs (1 day cooldown, 2 charges) - Occupy yourself and block any other abilities done today, but heal to full HP and make small hitbox have a 100% chance to dodge abilities."],
				"Passives": ["Targeting Computer - Cannot miss any attacks.",
					"Small Hitbox - Have a 50% chance to dodge any damaging and negative abilities used on you."]
			},
			{
				"Name":"Biker From Hell",
				"Color": "white",
				"Image": "",
				"Description": "Driving right through hell, and back, and back to hell.",
				"HP": "5 HP",
				"Difficulty": "Hard",
				"Tags": "Mechanical",
				"Actives": ["Hellish Burns (1 day cooldown) - Drive into someone with burning wheels, dealing 2 damage to them today and tomorrow.",
					"Catch a Ride (2 charges) - Drive on the Road to Hell with someone of choice, making them unvisitable today. You still need time to refuel, making yourself vulnerable. Cannot be used with Road to Hell.",
					"Road to Hell (2 charges) - Drive on the Road to Hell and become unvisitable today. Cannot be used with Catch a Ride.",
					"Wheels of Hell (3 charges) - Give yourself a 50% chance to dodge any attack today. Cannot be used with Catch a Ride.",
					"Wall of Hell (1 charge) - Create a wall at your house and all allies for 2 days, burning anyone who isn’t allied, dealing 2 damage to them today and tomorrow."],
				"Passives": ["To Hell and Back (1 charge) - The first time you die, occupy yourself for 1 whole day, and then respawn with 3 HP. Unable to be healed or granted HP."]
			},
			{
				"Name":"Bloodzerker",
				"Color": "white",
				"Image": "batImages/bloodzerker.png",
				"Description": "A powerful berzerker with the biggest of swords, was last seen defending a group of mages using their last spell. Credit to Rafi for this role.",
				"HP": "10 HP",
				"Difficulty": "Medium",
				"Tags": "Human",
				"Actives": ["Sword Slam (1 HP) - Use a huge sword to attack someone with, dealing 3 damage.",
					"Blood Rush (3 HP) - Charge forward at two people, stunning them for this day and dealing 3 damage.",
					"Whirlwind (5 HP) - Spin like a beyblade, dealing 3 damage to everyone hostile.",
					"Death Beam (8 HP) - Use a secret scroll, shooting a beam of death, dealing 7 damage to everyone hostile.",
					"Defensive Stance (2 charges) - Steel yourself against attacks and your own blood magic, reducing all damage by 50%.",
					"Potion of Immunity (2 charges) - Make someone immune to damage today. Does not make you immune to blood magic."],
				"Passives": ["Blood Magic - Abilities cost health.",
					"Vampirism - Whenever you kill someone, gain 5 HP.",
					"Human Ballista - Use your pocket ballista, shooting a random enemy for 2 damage at the end of every day that avoids all counterattacks.",
					"Nimbleness - Have a 25% chance to dodge each attack."]
			},
			{
				"Name":"Celestial Dragon",
				"Color": "white",
				"Image": "",
				"Description": "Control time and space, bending it in any direction.",
				"HP": "20 HP",
				"Difficulty": "Hard",
				"Tags": "Creature",
				"Actives": ["Fast Aging (1 day cooldown) - Force someone to age faster, dealing 1 damage to them. ",
					"Time Return (2 charges) - Cleanse someone of all negative effects done in the past day and make them immune to negative effects today.",
					"Time Loop (2 charges) - Redo any effects and damage done to someone yesterday for today.",
					"Speed Up Clock (2 charges) - Damage over time effects applied on someone will immediately happen today.",
					"Slow Down Clock (2 charges) - Damage over time effects applied on someone will be delayed for one day.",
					"Speed of Light (2 charges) - Put a blessing on someone, allowing them to reset any cooldown for tomorrow.",
					"Time Revival (1 charge) - Put a blessing on someone, reviving someone for half their HP if they die today.",
					"Time Freeze (1 charge) - Freeze an entire day, processing that entire day’s actions immediately, such as damage over time, and then play the game from that game state."],
				"Passives": ["None."]
			},
			{
				"Name":"Chaos Sorcerer",
				"Color": "white",
				"Image": "",
				"Description": "Summon demons of hell, and of whatever chaos gods you believe in.",
				"HP": "10 HP",
				"Difficulty": "Hard",
				"Tags": "Human",
				"Actives": ["Demon Spawn (1 day cooldown) - Summon a demon of your choice today. Each demon has their own abilities.",
					"Absorb Demon - Kill your own demon and heal 5 HP.",
					"Fire of Hell (1 day cooldown) - Throw a cursed fireball at someone, dealing 3 damage."],
				"Passives": ["None.",
					"=======================================================================",
					"Summonable Demons:",
					"Imp - 5 HP<br>A weak but spammable demon. Create two every time you choose to make one.",
					"Passive:<br>Portal of Hell - Spawn 2 every time you spawn 1.",
					"Bloodletter - 10 HP<br>A standard blood god’s demon.",
					"Abilities:<br>Bloodletting (2 day cooldown) - Stab someone, dealing 2 damage today and 2 damage tomorrow.",
					"Passive:<br>Blood for the Blood God - Attacks make the person weaker, increasing all damage done to the target by 1 damage for each attack.",
					"Void Guard - 10 HP<br>A sturdy, meat shield of a demon.",
					"Abilities:<br>Guard of Hell (1 day cooldown) - Protect someone, tanking all damage done to them today.",
					"Unclean One - 10 HP<br>A gassy demon with control.",
					"Abilities:<br>Gas Extrusion (1 day cooldown) - Plant a gas bomb on someone, dealing 2 damage to anyone who visits that player.",
					"Passive:<br>Poison Gas - Taking damage will deal back 2 damage to the attacker.",
					"Shadow Demon - 10 HP<br>A tricky demon with many niche utilities.",
					"Abilities:<br>Illusion (2 charges) - Create an illusion of someone, making attacks to that player have a 50% chance to hit them.",
					"Shadowy Cloak (1 charge) - Become unvisitable for today.",
					"Shadow’s Wisdom (2 charges) - Find out someone’s tags."]
			},
			{
				"Name":"Combat Medic",
				"Color": "white",
				"Image": "",
				"Description": "Time to heal your allies and kill your enemies.",
				"HP": "10 HP",
				"Difficulty": "Easy",
				"Tags": "Human",
				"Actives": ["Combat Scalpel (1 day cooldown) - Stab someone for 2 damage.",
					"First Aid (3 charges) - Heal someone for 5 HP.",
					"Extended Surgery (2 charges) - Heal someone for 3 HP each of the next 3 days.",
					"Vaccinate (2 charges) - Vaccinate someone, making them immune to occupation and damage over time for this day."],
				"Passives": ["Human Anatomy – Healing humans will increase healing done by 2 HP. Damaging humans will increase damage done by 2 damage.",
					"Vital Sign Sensors - Know what everyone’s HP is."]
			},
			{
				"Name":"Commando",
				"Color": "white",
				"Image": "",
				"Description": "Armed to the teeth, with as many guns as you can possibly carry.",
				"HP": "10 HP",
				"Difficulty": "Medium",
				"Tags": "Human",
				"Actives": ["Assault Rifle Fire (10 Ammo) - Fire your assault rifle at someone, dealing 5 damage.",
					"Machine Gun Suppression (10 Ammo) - Fire your machine gun at someone, preventing them from visiting anyone today.",
					"Rocket Launch (10 Ammo) - Fire your rocket launcher at someone, dealing 3 damage to them and all visitors. Deal double damage to anyone that is Mechanical.",
					"Shotgun Blast (10 Ammo) - Fire your shotgun at someone, inflicting a bleed with scattershot, dealing 3 damage to them today and 3 damage to them tomorrow.",
					"Sniper Tagging (5 Ammo) - Fire your sniper at someone, revealing who visits them and deal 1 damage to them.",
					"Blank Shots (5 Ammo) - Shoot blanks into the air, occupying anyone who visits you today.",
					"Reload (2 charges) - Reload your ammunition."],
				"Passives": ["Limited Ammo - Don’t have cooldowns, but have a limited amount of ammunition every day (10 per day)."]
			},
			{
				"Name":"Double Barreled Tank",
				"Color": "white",
				"Image": "",
				"Description": "One of the finest pieces of military equipment ever to be created.",
				"HP": "20 HP",
				"Difficulty": "Medium",
				"Tags": "Mechanical",
				"Actives": ["Double Barreled (2 day cooldown) - Shoot both cannons at someone, dealing 8 damage.",
					"Ramming Speed (1 day cooldown) - Ram someone, crushing them with your enlarged tank tracks, dealing 5 damage. Does not work on Air units.",
					"Sandbags (1 day cooldown, 2 charges) - Place sandbags down, protecting yourself and reducing damage by 50% today. Be unable to visit others.",
					"Repair Kit (3 charges) - Occupy yourself for the rest of the day and heal yourself for 5 HP."],
				"Passives": ["Armored Shell - Take 1 less damage from attacks that do not increase damage to Mechanical units.",
					"Grinder Threads - Anyone that tries to occupy you or control you will take 3 damage."]
			},
			{
				"Name":"Druid",
				"Color": "white",
				"Image": "",
				"Description": "Shapeshift into many creatures and bend nature to your will.",
				"HP": "10 HP",
				"Difficulty": "Hard",
				"Tags": "Human, Creature",
				"Actives": ["Switch Form (1 day cooldown) - Choose a form of your choice. Each form has their own HP. Keep your previous buffs from your previous forms.",
					"=======================================================================",
					"Eagle Form (Air)",
					"Abilities:<br>Claw (1 day cooldown) - Claw someone, dealing 2 damage.",
					"Eagle Eye (2 charges) - Scout above someone’s house, knowing who visits them today.",
					"Bird Eye View (2 charges) - Know who attacked who today.",
					"Tiger Form",
					"Abilities<br>Bite (1 day cooldown) - Bite someone, dealing 3 damage.",
					"Apex Predator (1 day cooldown, 2 charges) - Assert dominance, preventing them from doing their next action today.",
					"Cat’s Mobility (2 charges) - Hide in a place where no one can reach for today. Be unable to attack others today.",
					"Rhino Form",
					"Abilities<br>Ram (1 day cooldown) - Ram someone, dealing 5 damage.",
					"Hardened Skin (2 charges) - Shield yourself for 3 HP permanently.",
					"Unstoppable (2 charges) - Be immune to occupation today."],
				"Passives": ["None."]
			},
			{
				"Name":"Fencer",
				"Color": "white",
				"Image": "",
				"Description": "Pinpoint weak points in your enemies and dodge everything to gain power.",
				"HP": "10 HP",
				"Difficulty": "Easy",
				"Tags": "Human",
				"Actives": ["Lunge (1 day cooldown) - Stab someone for 5 damage.",
					"Parry (2 day cooldown) - Parry all damage incoming today from single target damage, all attacks targeting you directly will be dodged.",
					"Riposte (2 day cooldown) - Anyone who attacks you today will be attacked right back for 5 damage.",
					"Feint (1 day cooldown) - Fake an attack on someone, not dealing any damage, but visiting them.",
					"Posture Check (3 charges) - Identify someone’s posture, knowing their tags.",
					"Pressure Point (3 charges) - Identify someone’s weak points, knowing their HP."],
				"Passives": ["None."]
			},
			{
				"Name":"Hydra",
				"Color": "white",
				"Image": "",
				"Description": "Use your versatile heads to cause chaos, combining elements to swing the game in your favor.",
				"HP": "20 HP",
				"Difficulty": "Hard",
				"Tags": "Creature",
				"Actives": ["Multi-headed Attack (1 day cooldown) - Bite someone, dealing 1 damage per head, and inflicting 2 statuses of choice based on the heads biting.",
					"Flame Breath (1 day cooldown, singular head) - Breathe fire and deal 2 damage to someone for today and tomorrow, dealing double damage to Humans and Creatures.",
					"Cold Breath (1 day cooldown, singular head) - Freeze someone and deal 2 damage to someone, occupying them today and dealing double damage to Air units.",
					"Electrifying Shock (1 day cooldown, singular head) - Electrify someone and deal 3 damage to someone, dealing double damage to Mechanical targets.",
					"Regrowth (1 day cooldown, singular head) - Heal for 4 HP, gaining back a head.",
					"Earthquake (1 day cooldown, singular head) - Create an earthquake, damaging all enemies by 2 damage that are not Air units."],
				"Passives": ["5 Headed - Every 4 HP you take will remove a head of your choice. Healing back the 4 HP will add the head back. You have a fire head, an ice head, an electric head, a natural head, and an earth head. You can only use one ability with a singular head a day.",
					"Using your Head - Every time you are allowed to, you can inflict a status of choice between burning them for 1 damage today and tomorrow, freezing them to occupy their last action of the day, electrifying them to occupy their first action of the day, regrowing and healing yourself for 2 HP, and shaking the ground to deal 1 damage to all non-allied visitors to the target."]
			},
			{
				"Name":"Jet Fighter",
				"Color": "white",
				"Image": "",
				"Description": "Time to kick the tires and light the fires.",
				"HP": "10 HP",
				"Difficulty": "Medium",
				"Tags": "Air",
				"Actives": ["Missile Fire (1 day cooldown, 1 missile) - Launch your missiles at someone, dealing 3 damage to them. Deal double damage to Air units.",
					"Strafe (3 charges, 2 missiles) - Pick two players to strafe, hitting a missile into both of them, dealing 3 damage to both.",
					"Dogfighting (2 charges, 2 missiles) - Dogfight someone, deal 3 damage to them today and tomorrow and only allow that player to attack you tomorrow.",
					"Electronic Countermeasures (3 day cooldown) - Dodge all attacks and negative actions against you today.",
					"Fly Over (2 day cooldown) - Fly over someone, knowing who visits them and who they visit today.",
					"Rearm (1 day cooldown) - Rearm your missiles to fire again, be unable to do anything else today."],
				"Passives": ["Payload - You can fire a maximum of 4 missiles until you need to reload."]
			},
			{
				"Name":"Kirov War Blimp",
				"Color": "white",
				"Image": "",
				"Description": "A huge airship with a big payload, time to drop that payload all over your foes.",
				"HP": "30 HP",
				"Difficulty": "Medium",
				"Tags": "Air",
				"Actives": ["Bomb Dropping (1 day cooldown) - Drop bombs on someone, dealing 8 damage to them. Cannot damage Air units.",
					"Mine Dropping (2 charges) - Drop mines on someone, anyone visiting them that isn’t allied will take 2 damage.",
					"Ramming Speed (1 day cooldown) - Ram into someone, dealing 10 damage to both of you. If they aren’t an Air unit, cancel this attack.",
					"Gastroburners (2 day cooldown) - Activate 10 damage to yourself and avoid all damage done to yourself today."],
				"Passives": ["Propellers - You are extra slow and will be revealed that a War Blimp went to the players you went to.",
					"Extended Vision - You can see who else visits who you visit today.",
					"Anti-Air Gun - Air units deal double damage to you, but take 2 damage whenever they attack you."]
			},
			{
				"Name":"Mammoth Rider",
				"Color": "white",
				"Image": "",
				"Description": "Ride the mammoth into battle and crush anyone who opposes you, literally.",
				"HP": "20 HP",
				"Difficulty": "Easy",
				"Tags": "Creature",
				"Actives": ["Tusks of Pain (1 day cooldown) - Ram your tusks into someone, dealing 7 damage to them.",
					"Trample (2 day cooldown) - Trample someone, making them unvisitable, but deal 3 damage to them. They cannot do anything today.",
					"Charge! (2 charges) - Run through 3 players, dealing 3 damage to all of them in consecutive order.",
					"Mammoth’s Bellow (1 day cooldown, 3 charges) - Bellow loudly, demoralizing all enemies, making any damage they do 2 lesser today."],
				"Passives": ["Ice Age Skin - Avoid damage over time effects and only take the initial damage.",
					"Imposing Presence - Make all allies stronger with your presence, giving them 2 max HP and 2 damage to all attacks."]
			},
			{
				"Name":"Mech",
				"Color": "white",
				"Image": "",
				"Description": "Build your weapons pre-game in order to be versatile for any situation.",
				"HP": "15 HP",
				"Difficulty": "Medium",
				"Tags": "Mechanical",
				"Actives": ["Light Punch (1 day cooldown) - Punch someone for 3 damage.",
					"Fire Right Arm (1 day cooldown) - Fire your weapon on your right arm.",
					"Fire Left Arm (1 day cooldown) - Fire your weapon on your left arm.",
					"Armored Core (2 charges) - Shield yourself for 5 HP today.",
					"Computerized Scan (2 charges) - Check what tags someone has."],
				"Passives": ["Into the Mechlab - Build a loadout before the game. Possible weapons of choice are below- you can outfit your right arm and left arm with one of any weapon.",
					"=======================================================================",
					"Minigun - Spray your minigun at someone, dealing 5 damage.",
					"Rocket Launcher - Shoot a rocket at someone, dealing 3 damage to them and anyone who visits.",
					"Laser Rifle - Shoot a laser at someone, identifying their role and dealing 2 damage.",
					"Power Sword - Increase your melee damage by 2 and shield yourself for 2 HP today.",
					"Flamethrower - Burn someone, dealing 3 damage for today and tomorrow.",
					"Cryo Gun - Freeze someone, dealing 1 damage and preventing them from visiting anyone today."]
			},
			{
				"Name":"Operation Leader",
				"Color": "white",
				"Image": "",
				"Description": "A refugee from the Untrusted universe, now you are here to get revenge on the sociopaths who have killed you.",
				"HP": "10 HP",
				"Difficulty": "Medium",
				"Tags": "Human",
				"Actives": ["Download Intel (1 day cooldown) - Get a random piece of information about the game state.",
					"Spearphishing Execution (1 day cooldown) - Hack someone’s computer, dealing 1 damage to them and making all damage to them deal an extra 1 damage.",
					"Denial of Service (2 charges) - Occupy anyone who visits someone of your choice.",
					"Rollback (1 charge) - Pick someone, rollbacking every single action that happened yesterday to them, including HP.",
					"0 Day Exploit (1 charge) - Hack someone’s computer with a powerful hack, dealing 5 damage to them. Cannot be dodged.",
					"Midnight Meet (1 day cooldown) - Occupy someone, discussing life and your ability to hack.",
					"Misdirection (2 charges) - Occupy anyone who tries to visit you today."],
				"Passives": ["Topology Knowledge - Know what abilities are used today on anyone you use an ability on."]
			},
			{
				"Name":"Poison Crossbowman",
				"Color": "white",
				"Image": "batImages/poisoncrossbowman.png",
				"Description": "A powerful berzerker with the biggest of swords, was last seen defending a group of mages using their last spell. Credit to Rafi for this role.",
				"HP": "10 HP",
				"Difficulty": "Medium",
				"Tags": "Human",
				"Actives": ["Poison Bolt (2 day cooldown) - Shoot a poisonous arrow, dealing 1 damage to them initially and leaving a poison that deals 3 damage per day for 2 days.",
					"Crossbow Fire (1 day cooldown) - Shoot someone with a crossbow, dealing 5 damage.",
					"Bullseye (2 charges) - Shoot a target’s vital spot, wounding them for 5 damage and making them unable to heal or buff themselves.",
					"Contagion (2 charges) - Spread the poisonous love from one target to all others, spreading all negative effects to all enemies that visit a target.",
					"Explosive Bolt (1 charge) - Shoot an explosive arrow, dealing 10 damage to the target and all enemies that visit the target."
				],
				"Passives": ["Extreme Poison - Every attack has a 30% chance to daze a target (forcing the target to misuse their actions) upon applying poison to an already poisoned target.",
					"Ranged - Any attempts to inflict damage via counterattack made by characters using melee weapons are rendered useless due to range advantage.",
					"High Mobility - Speeding through the battlefield, you are harder to hit, having a 30% chance to dodge non-aoe attacks.",
					"Adrenaline Rush - Whenever you dodge an attack, you evade another attack on the same day, thus receiving no damage or negative effects."
				]
			},
			{
				"Name":"Possessor",
				"Color": "white",
				"Image": "",
				"Description": "Steal people’s abilities, and minds.",
				"HP": "10 HP",
				"Difficulty": "Hard",
				"Tags": "Human",
				"Actives": ["Possess (1 day cooldown) - Possess someone, occupying them and play with their role card today.",
					"Mimic (3 charges) - Steal an ability from someone permanently.",
					"Juxtapose (1 charge) - Steal a passive from someone permanently."],
				"Passives": ["Cover - Any role revealing abilities will make you look like the Possessed player’s role."]
			},
			{
				"Name":"Pyromaniac",
				"Color": "white",
				"Image": "",
				"Description": "Burn everyone to the ground, just like any Arsonist would.",
				"HP": "10 HP",
				"Difficulty": "Medium",
				"Tags": "Human",
				"Actives": ["Douse (1 day cooldown) - Douse someone, making any role revealing abilities show that the player is a Pyromaniac.",
					"Fire Senses (3 charges) - See a doused player’s real role.",
					"Ignite (1 day cooldown) - Set all doused players on fire, dealing 3 damage, removing doused from all doused players.",
					"Oil Leak (1 charge) - Douse all living players.",
					"Napalm Strike (2 day cooldown) - Launch napalm at someone, burning them for 3 days, dealing 2 damage per day."],
				"Passives": ["Fight Fire with Fire - Burning yourself heals you for 3 HP."]
			},
			{
				"Name":"Reaper from Overwatch",
				"Color": "white",
				"Image": "",
				"Description": "He took \"just a phase\" too seriously and became edginess itself. Credit to Progamer for this role.",
				"HP": "10 HP",
				"Difficulty": "Easy",
				"Tags": "Creature",
				"Actives": ["Hellfire Shotguns (1 day cooldown) - You shoot twice with your shotguns (why are you using two at the same time), and deal 3 damage to 2 different targets (can be the same target).",
					"Shadow Step (1 day cooldown) - You teleport in front of an enemy to scare the shit out of them, increasing the damage they take by 2 for 1 day.",
					"Wraith Form (2 day cooldown) - Become mist and cleanse yourself of any negative statuses affecting you. You also don't take damage from attacks for 1 day, and can use Hellfire Shotguns again.",
					"Death Blossom (must deal 20 damage to become usable) - You deal 5 damage to a target, and the 2 people above and below them on the player list. You can also use Hellfire Shotguns again."
				],
				"Passives": ["The Reaping - For every 3 damage you deal, heal for 1 HP.",
				]
			},
			{
				"Name":"Regular Dude with Banjo and Kazoo",
				"Color": "white",
				"Image": "",
				"Description": "Just a dude with a banjo and kazoo playing some music. Credits to Lobster for making this role.",
				"HP": "3 HP",
				"Difficulty": "Easy",
				"Tags": "Human",
				"Actives": ["Banjo Smash - Do 1 damage. Your banjo breaks.",
					"Kazoo Throw - Do 1 damage. Your kazoo goes missing."],
				"Passives": ["I Play Music Because I Cannot Speak - You are muted for the duration of the game, but definitely not because you want to be even more afk in an already chill game and basically be a spectator.",
					"Ouch - Your action is canceled this turn if you lose hp for any reason.",
					"I’m Going Home - If your hp falls to or below 1, you retire and live the rest of your days cursed with dreams about a bear and a bird for some reason."]
			},
			{
				"Name":"Shieldmaiden",
				"Color": "white",
				"Image": "",
				"Description": "Protecc and attacc, but also is a chadcc.",
				"HP": "15 HP",
				"Difficulty": "Easy",
				"Tags": "Human",
				"Actives": ["Shield Bash (1 day cooldown) - Bash someone with your shield, dealing 3 damage.",
					"Shieldwall (1 day cooldown, 3 charges) - Protect someone, reducing 50% of all damage dealt to them.",
					"Escort (1 day cooldown) - Protect someone, tanking any damage done to them.",
					"On Guard (2 charges) - Be on guard, dealing 1 damage to anyone who attacks you today if you are escorting someone."],
				"Passives": ["Assertive - Refuse to be occupied by people.",
					"Protected - Cannot be reduced in max HP or have buffs removed.",
					"Hunker Down - Protect yourself on the first attack per day, negating the first attack."]
			},
			{
				"Name":"Sniper",
				"Color": "white",
				"Image": "",
				"Description": "A veteran with marksman skills that are unparalleled. Made for Neon.",
				"HP": "10 HP",
				"Difficulty": "Medium",
				"Tags": "Human",
				"Actives": ["Snipe (1 ammo) - Snipe someone from afar, dealing 5 damage.",
					"Tagger Shot (1 ammo) - Snipe someone with your tagger ammo, dealing 1 damage and finding out who visits them.",
					"Wounding Shot (1 ammo) - Snipe someone from afar targeting the legs, dealing 1 damage and occupying them.",
					"Overwatch (2 ammo) - Snipe the first person who visits someone that you choose to overwatch today, dealing 5 damage to them and occupying them.",
					"Supporting Fire (1 ammo) - Support someone, firing at who they visit next, dealing 5 damage.",
					"Reload (2 charges) - Reload your ammunition."],
				"Passives": ["Limited Ammo - Don’t have cooldowns, but have a limited amount of ammunition every day (2 per day).",
					"Sniper Elite - Take double damage from melee attacks, but don’t get attacked back by passives or reflection damage when attacking others. Don’t visit using abilities."]
			},
			{
				"Name":"Stargazer",
				"Color": "white",
				"Image": "",
				"Description": "Predict every possible weather condition and planet change in the near future.",
				"HP": "10 HP",
				"Difficulty": "Hard",
				"Tags": "Human",
				"Actives": ["Sunny Day (1 day cooldown, weather) - Make the weather sunny, revealing a role of a player of your choice globally.",
					"Drizzle (1 day cooldown, weather) - Drop a healing drizzle, healing everyone for 2 HP.",
					"Thunderstorm (1 day cooldown, weather) - Create a thunderstorm, damaging everyone for 2 damage.",
					"Snowy Days (2 day cooldown, weather) - Make it snow, not allowing them to leave their houses, occupying them today.",
					"Suns Out, Guns Out (2 day cooldown, weather) - Make the sun disappear today, making all intel abilities not reveal any information.",
					"Volcano (1 day cooldown, planet) - A volcano spawns on someone, burning them for 2 damage today and 2 damage tomorrow.",
					"Meteorite Strike (1 day cooldown, planet) - Drop a meteorite on someone, dealing 5 damage after they have done their actions today.",
					"Black Hole (2 day cooldown, planet) - Pull everyone to a single player, making them all target that player today.",
					"Planet Movement (2 day cooldown, planet) - Move everyone’s targets today to a random player, each target unique.",
					"Supernova (2 day cooldown, planet) - Melt everyone with the power of a star, making them all burn for 1 damage for today and 1 damage tomorrow."],
				"Passives": ["Weatherman - Globally reveal whenever the weather or planet changes. Can only change the weather once a day.", 
					"Mr. Worldwide - Can only affect the planet once a day."]
			},
			{
				"Name":"Swordmaster",
				"Color": "white",
				"Image": "",
				"Description": "Walk tall and carry a big sword.",
				"HP": "10 HP",
				"Difficulty": "Easy",
				"Tags": "Human",
				"Actives": ["Striking Blow (1 day cooldown) - Stab someone for 5 damage.",
					"Empowered Strike (2 charges) - The next damaging ability you use will deal double damage.",
					"Cleave (2 day cooldown) - Strike a powerful blow, hitting 3 people of your choice for 5 damage.",
					"Power Attack (1 charge) - Charge up a powerful attack today, doing nothing else. Tomorrow, choose someone of your choice and attack for 10 damage."],
				"Passives": ["Melee Expertise - Take 2 less damage from melee attacks. You’ll know when damage was done by a melee attack.",
					"Honorable Duel - You will not attack people who are occupied. You will not be attacked when occupied."]
			},
			{
				"Name":"T-Rex",
				"Color": "white",
				"Image": "",
				"Description": "Send your enemies into the prehistoric times, ripping and tearing them apart.",
				"HP": "15 HP",
				"Difficulty": "Medium",
				"Tags": "Creature",
				"Actives": ["Ferocious Bite (1 day cooldown) - Bite someone for 5 damage. Does 2 extra damage to Humans and Creatures.",
					"Extinction (1 charge) - Drop a meteorite on everyone, dealing 5 damage to everyone. Deal 7 damage to yourself.",
					"Apex Predator (1 charge) - With your powerful form, globally assert dominance on everyone, making them want to avoid visiting you today and tomorrow.",
					"Carnivorous (2 charges) - Eat a dead player, healing yourself for 5 HP.",
					"Scavenge (3 charges) - Check a dead player, checking what role they had."],
				"Passives": ["Strong Skeleton - Take 2 reduced damage from attacks. Attacks must at least deal 1 damage to you. Any damage that deals only 1 damage to you will allow you to figure out who attacked you.",
					"Grounded - Deal 3 less damage to Air units. Avoid occupation from Air units."]
			},
			{
				"Name":"War Bear",
				"Color": "white",
				"Image": "",
				"Description": "You are a beary good boy, gotta go get some food.",
				"HP": "15 HP",
				"Difficulty": "Easy",
				"Tags": "Creature",
				"Actives": ["Maul (1 day cooldown) - Claw through someone, dealing 5 damage.",
					"Amplified Roar (1 day cooldown) - Roar loudly at someone, stunning them today and occupying them.",
					"Warcry (1 day cooldown) - Roar loudly, bolstering you and all allies to do an extra 1 damage per attack.",
					"Eat Honey (1 charge) - Eat a bunch of honey, becoming invulnerable for today.",
					"Devour - Choose someone, if they are down to their last 10% HP, eat them whole and kill them instantly, no matter what they are."],
				"Passives": ["Armored Plating - Take 1 less damage from any attack.",
					"The Flesh is Weak - Deal 1 extra damage to all Human and Creature enemies."]
			},
			{
				"Name":"Zombie",
				"Color": "white",
				"Image": "",
				"Description": "Just a normal zombie on your way to infect some people, nothing to see here.",
				"HP": "15 HP",
				"Difficulty": "Medium",
				"Tags": "Human",
				"Actives": ["Bite (1 day cooldown) - Bite someone, dealing 3 damage to them, choosing whether to infect them or not. If you infect them, infect will be on cooldown.",
					"Infect (1 day cooldown) - Infect someone, allowing you to control their max HP. Infected people can infect other people by visiting them with any ability. They won’t be told about this.",
					"Infected Spit (2 charges) - Deal 1 damage to an infected player. They take 2 damage once tomorrow, and again the day after.",
					"Infected Gas (2 charges) - Heal an infected player for 3 HP.",
					"Zombie Dance (2 day cooldown) - Taunt someone to you, any abilities used by them will target you today."],
				"Passives": ["Rotting Aura - All infected can either be increased by 2 max HP or reduced by 2 max HP.",
					"Corrosive Skin - People dealing damage to you will take 1 damage back."]
			}
		]
	}
]