data = 
[
	{
		"The Bad Guys": 
		[
			{
				"Name":"Netsec",
				"Color": "lime",
				"Summary":"The majority faction that wants to eliminate all other factions",
				"Image": "netsec.png",
				"Description": "“We’re here to hack to the final target. Surely everyone here is here for hacking right?”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).<br><br>Note the difference in win condition. You cannot hack to win anymore.",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"Netsec Special": 
		[
			{
				"Name":"Operation Leader",
				"Color": "lime",
				"Summary":"Broadcast in real channel and root",
				"Image": "operationleader.png",
				"Description": "This role is unique (one Operation Leader should spawn).<br>“It’s time to lead this OPSEC to victory, Operation Leader.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Hack Target (High) - Select a white node and attempt to hack it. Leaves a log.",
					"0-Day Exploit (1 charge) - Select a white node and instantly hack it. Leaves a log.",
					"Give Root Access (1 charge) - Select an operative to give root to. They become any of Operation Leader, Blackmailed Leader, Sociopath Leader, W3C Operation Leader, Paragon Operation Leader, or are simply an agent, neutral, Paragon Leader, or W3C Leader with access to the special channel. A Neutral Leader can only spawn in."],
				"Night": ["Move Hideout (1 charge) - Move your hideout, protecting yourself unless you are occupied.",
					"Emergency Extraction (N1 -> N3 cooldown, 3 charges) - Select an operative to escort, does not occupy them and makes them immune to everything unless otherwise stated."],
				"Passives": ["Authority - You have two votes. Only the starting Operation Leader role has this passive.",
					"Covert Broadcast - You should be given access to talk to all players in a specialized channel (global Opsec info).",
					"Operation Leader - You are one of the leading roles and should spawn every operation."]
			},
			{
				"Name":"Former Agent Leader",
				"Color": "lime",
				"Summary":"Weaker abilities but ability to see entire topology, cannot reveal to others",
				"Image": "agentleader.png",
				"Description": "This role is unique (one Operation Leader should spawn).<br><br>“That fucking bastard stole your job! You’ve risen up the ranks of Netsec for one purpose, revenge, here’s your chance Former Agent Leader.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Hack Target (Moderate) - Select a white node and attempt to hack it. Leaves a log.",
					"Rollback (1 charge) - Select a green node, return the node to a white node, un-hacking the node. Connections to nodes ahead fail.",
					"Give Root Access (1 charge) - Select an operative to give root to. They become any of Operation Leader, Blackmailed Leader, Sociopath Leader, W3C Operation Leader, Paragon Operation Leader, or are simply an agent, neutral, Paragon Leader, or W3C Leader with access to the special channel. A Neutral Leader can only spawn in."],
				"Night": ["Midnight Meet (N1 -> N3 cooldown) - Select a target operative. Visit and occupy them, talking about the hack. Do not reveal yourself to them.",
					"Investigation (N1 -> N3 cooldown) - Select a target operative. Learn between three subclasses. One is the real subclass, which pierces any cover and frame. Visit them."],
				"Passives": ["Authority - You have two votes. Only the starting Operation Leader role has this passive.",
					"Covert Broadcast - You should be given access to talk to all players in a specialized channel (global Opsec info).",
					"Operation Leader - You are one of the leading roles and should spawn every operation.",
					"Topology Access - You can access the full topology and connection logs as if you were an agent.",
					"Agent Scum - Any doxx attempts on you doxx you as Agent."]
			},
			{
				"Name":"Hack God",
				"Color": "lime",
				"Summary":"Incredible hacking potential",
				"Image": "hackgod.png",
				"Description": "This role is unique (one Operation Leader should spawn).<br><br>“They worship you for your hacking ability, Hack God.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["0-Day Exploit - Select a white node and instantly hack it. Infinite charges. Leaves a log.",
					"Give Root Access (1 charge) - Select an operative to give root to. They become any of Operation Leader, Blackmailed Leader, Sociopath Leader, W3C Operation Leader, Paragon Operation Leader, or are simply an agent, neutral, Paragon Leader, or W3C Leader with access to the special channel. A Neutral Leader can only spawn in."],
				"Night": ["Move Hideout (1 charge) - Move your hideout, protecting yourself unless you are occupied.",
					"Gift Computer (2 charges) - Select a target operative. Permanently grants target operative High hack chance, even if it lowers their hack chance. Visit them."],
				"Passives": ["Authority - You have two votes. Only the starting Operation Leader role has this passive.",
					"Ghost in the System - You can choose whether or not to leave connection logs upon hacking.",
					"Covert Broadcast - You should be given access to talk to all players in a specialized channel (global Opsec info).",
					"Operation Leader - You are one of the leading roles and should spawn every operation.",
					"Worship Me - Upon arrest or murder (not from vote), every operative gets a hacking chance increase by one stage."]
			}
		]
	},
	{
		"Netsec Field Operations": 
		[
			{
				"Name":"Enforcer",
				"Color": "lime",
				"Summary":"Keeps Interrogate",
				"Image": "enforcer.png",
				"Description": "“You don’t mind being arrested again as long as you can keep your friends safe, Enforcer.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Desperate Measures (1 charge) - Turn into an Improvised Hacker."],
				"Night": ["Escort - Escort a target operative, protecting the operative from arrests and murders. Arrest attempts will arrest this operative instead, and anyone attempting to murder the protected operative will be killed. Visit and occupy them.",
					"Interrogate (3 charges) - Select a target operative and occupy them. The host will ask them for their logs, giving you what they send.",
					"Disorganized Murder - Select an operative and attempt to murder them. Visit the target."],
				"Passives": ["None."]
			},
			{
				"Name":"CCTV Specialist",
				"Color": "lime",
				"Summary":"Perform CCTV is passive, also CCTVs can’t communicate to each other",
				"Image": "cctvspecialist.png",
				"Description": "“Your watchful eye is Netsec’s hidden guardian, CCTV Specialist.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Create Hideout (D1 -> D4 cooldown, 2 charges) - Grants you one charge of Move Hideout.",
					"Bait Law Enforcement (D1 -> D3 cooldown) - Select a target operative, inform agents that the target is one working for Netsec. (Leaves the same message as Bounty Hunter’s Spill the Beans).",
					"Desperate Measures (1 charge) - Turn into an Improvised Hacker. Breaks previous cameras."],
				"Night": ["Install CCTV Surveillance (D1 -> D3 cooldown, 2 charges) - Selects a target operative and places a camera on their hideout. The camera is destroyed upon moving hideout or getting escorted. Visit the target.",
					"Move Hideout (1 charge) - Move your hideout, protecting yourself unless you are occupied."],
				"Passives": ["Perform CCTV Surveillance - Passively see who visits the target operatives that the cameras are attached to."]
			},
			{
				"Name":"Rookie Hacker",
				"Color": "lime",
				"Summary":"Insider knowledge changed to Follow, small amounts of utility",
				"Image": "rookiehacker.png",
				"Description": "“You need to help Netsec in any way you can, even if you aren’t the best at it, Rookie Hacker.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Download Intel - Select a green node and attempt to download from it. If there is intel, and you download and remove it first, you will get class intel, target node, or faction intel. Leaves a log.",
					"Desperate Measures (1 charge) - Turn into an Improvised Hacker. Breaks previous cameras."],
				"Night": ["Install Private Camera (1 charge) - Selects a target operative and places a camera on their hideout. The camera is destroyed upon moving hideout or getting escorted. Visit the target.",
					"Experienced Hiding (2 charges) - Move your hideout, protecting yourself unless you are occupied.",
					"Throw Under the Bus (1 charge) - Select a target operative. All skills used on you will be used on the target operative.",
					"Follow (1 charge) - Select a target operative and follow them, visiting them and checking if they left their hideout and met anyone. If they were occupied, you’d only know that they could not leave their hideout.",
					"Dumpster Dive - Increases hacking chances on a random node."],
				"Passives": ["Amateur - You have one less charge of every ability, already listed within the abilities."]
			},
			{
				"Name":"Improvised Hacker",
				"Color": "lime",
				"Summary":"Same",
				"Image": "improvisedhacker.png",
				"Description": "This role is ONLY through desperate measures, not a starting role. Do NOT claim this role.<br><br>“Desperate times call for desperate measures, Improvised Hacker.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Hack Target (Very Low) - Select a white node and attempt to hack it. Leaves logs.",
					"Download Intel - Select a green node and attempt to download from it. If there is intel, and you download and remove it first, you will get class intel, target node, or faction intel. Leaves a log."],
				"Night": ["Study (N1 -> N3 cooldown) - Increases your hacking stage by one the following day.",
					"Move Hideout (1 charge) - Move your hideout, protecting yourself unless you are occupied.",
					"Dumpster Dive - Increases hacking chances on a random node."],
				"Passives": ["None."]
			},
			{
				"Name":"Nightclub Guard",
				"Color": "lime",
				"Summary":"Has ways to set misdirect on other operatives",
				"Image": "nightclubguard.png",
				"Description": "“Netsec pays a lot more than those 24 hour clubs, Nightclub Guard.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Bait Law Enforcement (D1 -> D3 cooldown) - Select a target operative, inform agents that the target is one working for Netsec. (Leaves the same message as Bounty Hunter’s Spill the Beans).",
					"Desperate Measures (1 charge) - Turn into an Improvised Hacker. "],
				"Night": ["Bouncer (N1 -> N3 cooldown, 2 charges) - Select a target operative. You will visit and occupy them like a Midnight Meet, and anyone who visits them will be occupied, like a Misdirection.",
					"Interrogate (3 charges) - Select a target operative and occupy them. The host will ask them for their logs, giving you what they send.",
					"Call Backup (N1 -> N4 cooldown) - Escort yourself. If you are targeted by an arrest or murder, attack them right back, killing the arrester or murderer."],
				"Passives": ["None."]
			},			
			{
				"Name":"Hardware Hacker",
				"Color": "lime",
				"Summary":"Disable both day and night actions to topology",
				"Image": "hardwarehacker.png",
				"Description": "“You are hired for your massive knowledge on embedded systems and Internet of Things, Hardware Hacker.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Hack Target (Low) - Select a white node and attempt to hack it. Leaves a log.",
					"Bait Law Enforcement (D1 -> D3 cooldown) - Select a target operative, inform agents that the target is one working for Netsec. (Leaves the same message as Bounty Hunter’s Spill the Beans).",
					"Internet of Things Breach - Select a white node, increasing hacking chances of getting this node. This does not leave a log."],
				"Night": ["Smash Hardware (N1 -> N3 cooldown) - Select an operative and disable all day actions related to the topology. Occupies and visits them. (Same as Midnight Meet).",
					"Tamper Wiring (2 charges) - Select an operative and disable all night actions related to the topology. Visit them."],
				"Passives": ["None."]
			},			
			{
				"Name":"Brothel Owner",
				"Color": "lime",
				"Summary":"Loan Shark previous concept without move/emergency",
				"Image": "brothelowner.png",
				"Description": "“You can help calm Netsec’s anxiety over this difficult hack, Brother Owner.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Desperate Measures (1 charge) - Turn into an Improvised Hacker."],
				"Night": ["Send Entertainment (N1 -> N3 cooldown) - Select a target operative. Visit and occupy them, doing some dirty deeds. (Same as Midnight Meet). Leave a “present” for them.",
					"Extra Presents (2 charges) - Occupy all operatives that have been given a “present” previously with Send Entertainment.",
					"Throw Under the Bus (2 charges) - Select a target operative. All skills used on you will be used on the target operative."],
				"Passives": ["None."]
			},
			{
				"Name":"Getaway Driver",
				"Color": "lime",
				"Summary":"Transporter + Setup + Suicide/kill",
				"Image": "getawaydriver.png",
				"Description": "“You are needed to make sure people in this Opsec can get from place to place quickly, Getaway Driver.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Repair Vehicle (1 charge) - Regain the Hit the Nitrous passive.",
					"Desperate Measures (1 charge) - Turn into an Improvised Hacker."],
				"Night": ["Switch Gears (N1 -> N3 cooldown) - Select two operatives, all abilities that were used on the first player will be used on the second player, and vice versa. Visits the first operative.",
					"Setup (2 charges) - Select two operatives. The first operative will visit and occupy the second operative, occupying both operatives. You may be the first target. Visits the first operative.",
					"Ramming Speed (1 charge) - Select an operative and murder them. Cannot be dodged in any way, and cannot be occupied. Occupies and visits the target. Also kills yourself. Can only be used past night 2 onwards."],
				"Passives": ["Hit the Nitrous - The first time you are arrested or murder attempted, hit the nitrous, dodging the arrest or murder."]
			}
		]
	},
	{
		"Netsec Investigative": 
		[
			{
				"Name":"Analyst",
				"Color": "lime",
				"Summary":"ARTQ can find hack chance",
				"Image": "analyst.png",
				"Description": "“Adept at mathematics and statistics, you’ll find the fake hackers, Analyst.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Hack Target (Low) - Select a white node and attempt to hack it. Leaves a log.",
					"Download Intel - Select a green node and attempt to download from it. If there is intel, and you download and remove it first, you will get class intel, target node, or faction intel. Do not go through frames or cover. Leaves a log.",
					"Log Analysis - Select a green node and clear any fake logs from Alter Logs or Rollback. Leaves a log."],
				"Night": ["Midnight Meet (N1 -> N3 cooldown) - Select a target operative. Visit and occupy them, talking about the hack. Do not reveal yourself to them.",
					"Ask the Right Question (N1 -> N4 cooldown, 2 charges) - Select a target operative, find their hacking chance. Do not go through frames or cover. Visit them."],
				"Passives": ["None."]
			},
			{
				"Name":"Social Engineer",
				"Color": "lime",
				"Summary":"Impersonate added back, keeps throw + misdirect and buffs doxx (unironically need it for C)",
				"Image": "socialengineer.png",
				"Description": "“With your tactics in social engineering, you’ll learn who any operative sides with, Social Engineer.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Hack Target (Low) - Select a white node and attempt to hack it. Leave a log.",
					"Impersonate (1 charge) - Permanently rename your operative to whatever name you want. If you name it the same as another operative, targeting that operative will randomly target either operative of the same name."],
				"Night": ["Doxx and Stalk (N1 -> N4 cooldown, 2 charges) - Select a target operative. Do not go through frames or cover. Learn this operative’s faction alignment and visit them.",
					"Throw Under the Bus (2 charges) - Select a target operative. All skills used on you will be used on the target operative.",
					"Misdirection (1 charge) - Occupy anyone that visits you directly, blocking any attempts to visit, occupy, and kill directly. Does not save you from Raids, Stings, and other indirect methods of killing this operative."],
				"Passives": ["None."]
			},
			{
				"Name":"Computer Technician",
				"Color": "lime",
				"Summary":"Has a way to upload intel and check subclass",
				"Image": "computertechnician.png",
				"Description": "“Your combined knowledge on embedded systems and ability to decipher fellow operative’s skill set allows you to help this Opsec, Computer Technician.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Hack Target (Low) - Select a white node and attempt to hack it. Leaves a log.",
					"Download Intel - Select a green node and attempt to download from it. If there is intel, and you download and remove it first, you will get class intel, target node, or faction intel. Do not go through frames or cover. Leaves a log.",
					"Upload Intel (0 charges) - Select a green node and upload intel that is downloadable by others. Whoever downloading will get class intel, target node, or faction intel. Leaves a log."],
				"Night": ["Steal Intel (1 charge) - Steal intel and gain one charge of upload intel.",
					"Review Specialization (N1 -> N4 cooldown, 2 charges) - Select a target operative. Learn their subclass, or framed or cover subclass. Do not go through frames or cover. Visit them.",
					"Review Connection Logs (2 charges) - Selects a target operative. Check if their connection was altered through ISP Isolation or Jam Network the previous day, and make them immune to ISP Isolation or Jam Network the following day. Visit them."],
				"Passives": ["None."]
			},			
			{
				"Name":"Inside Man (Detective)",
				"Color": "lime",
				"Summary":"Niche of intelling cover",
				"Image": "insidemandetective.png",
				"Description": "“You don’t have high clearance at the target company, but any little bit helps. Cash out and get out, Inside Man (Detective).”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Review TCP Packets (N1 -> N4 cooldown, 2 charges) - Select a target operative and check if they used a hack today.",
					"Insider Knowledge (D1 -> D3 cooldown, 2 charges) - Tells you the IP of a node with downloadable intel on it."],
				"Night": ["Throw Under the Bus (2 charges) - Select a target operative. All skills used on you will be used on the target operative.",
					"Investigation (N1 -> N3 cooldown) - Select a target operative. Learn between three subclasses. One is the real subclass, which pierces any cover and frame. Visit them."],
				"Passives": ["Target Knowledge - You can see which node is the final target. This target will not win the game outright, but will allow you to gain significant global intel if hacked."]
			},			
			{
				"Name":"Dark Web Contact",
				"Color": "lime",
				"Summary":"Has doxx and wireshark, no impersonate",
				"Image": "darkwebcontact.png",
				"Description": "“The dark web calls and you are an absolute sadist for dark web content, Dark Web Contact.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Hack Target (Moderate) - Select a white node and attempt to hack it. Leaves a log.",
					"Wireshark (D1 -> D4 cooldown) - Tells you the name of any operative that did a Denial of Service.",
					"Dark Web Connections (2 charges) - Select a white node. If the node isn’t hacked, the node’s connection logs are revealed to you anyway."],
				"Night": ["Doxx and Stalk (N1 -> N4 cooldown, 2 charges) - Select a target operative. Do not go through frames or cover. Learn this operative’s faction alignment and visit them.",
					"Cover Your Tracks (2 charges) - Move your hideout, protecting yourself unless you are occupied. Arrest attempts will show a result similar to a target that is immune to arrest, like No Dirt On Me."],
				"Passives": ["None."]
			},			
			{
				"Name":"Natural Linguist",
				"Color": "lime",
				"Summary":"Maid from ToL, can compare two operatives’ win condition",
				"Image": "naturallinguist.png",
				"Description": "“You are an expert in linguistics and Natural Language Processing, Natural Linguist.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Hack Target (Low) - Select a white node and attempt to hack it. Leaves a log.",
					"Impersonate (1 charge) - Permanently rename your operative to whatever name you want. If you name it the same as another operative, targeting that operative will randomly target either operative of the same name.",
					"Log Analysis - Select a green node and clear any fake logs from Alter Logs or Rollback."],
				"Night": ["Speech Analysis (N1 -> N3 cooldown) - Start with a random operative. Select a target operative and compare their speech, checking if they can win together. Do not go through frames or cover. Visit them.",
					"LSTM Speech Recognition (N1 -> N3 cooldown) - Select a target operative and check if any talking happened in that operative’s hideout. If there was a Midnight Meet of some sort, get that knowledge. Visit them."],
				"Passives": ["None."]
			},			
			{
				"Name":"Computer Vision Engineer",
				"Color": "lime",
				"Summary":"Takes pictures and gets intel the next day on them",
				"Image": "computervisionengineer.png",
				"Description": "“You know how to analyze pictures using machine learning models and computer vision, Computer Vision Engineer.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Hack Target (Low) - Select a white node and attempt to hack it. Leaves a log.",
					"Image Recognition (0 charges) - Predict what the earliest operative is doing at night, gives three actions which could be what he did last night. Doing nothing may be an action. Goes through frames and cover.",
					"Image Classification (0 charges) - Predict what the earliest operative did in the day, gives three actions which could be what he did yesterday. Doing nothing may be an action. Goes through frames and cover."],
				"Night": ["Data Gathering - Select a target operative and take a picture of their hideout. Grants one charge of Image Recognition or Image Classification targeting this operative- your choice. Visit them.",
					"Study (N1 -> N3 cooldown) - Increases your hacking stage by one the following day."],
				"Passives": ["None."]
			},			
			{
				"Name":"Technical Project Manager",
				"Color": "lime",
				"Summary":"Setup on a Netsec role, and can figure out who hacks a node",
				"Image": "technicalprojectmanager.png",
				"Description": "“You know how to check for discrepancies in our hacking workforce, Technical Project Manager.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Hack Target (Very Low) - Select a white node and attempt to hack it. Leaves a log.",
					"Check Version Control - Select a green node and figure out who hacked the node. Leaves a log.",
					"Manage Tickets (D1 -> D4 cooldown) - Select a target operative and check if they hacked today."],
				"Night": ["Setup (2 charges) - Select two operatives. The first operative will visit and occupy the second operative, occupying both operatives. You may be the first target. Visits the first operative.",
					"Midnight Meet (N1 -> N3 cooldown) - Select a target operative. Visit and occupy them, talking about the hack. Do not reveal yourself to them.",
					"Prepare Sprint (1 charge) - The next day you can do two different day actions."],
				"Passives": ["None."]
			},			
			{
				"Name":"Search Engine Optimizer",
				"Color": "lime",
				"Summary":"Background Search and some significant topology actions",
				"Image": "searchengineoptimizer.png",
				"Description": "“You know how to get extra clicks or break any website, Search Engine Optimizer.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Hack Target (Low) - Select a white node and attempt to hack it. Leaves a log.",
					"Download Intel - Select a green node and attempt to download from it. If there is intel, and you download and remove it first, you will get class intel, target node, or faction intel. Do not go through frames or cover. Leaves a log.",
					"Information Retrieval - Search the web and scrape the web for intel. Finds if there is intel on currently hacked nodes. Do not leave a log.",
					"Background Search (D1 -> D3 cooldown) - Check a target operative’s background. You’ll be given a (non-unique) random skill that they have, either day or night. Do not go through frames or cover.",
					"Overload Website (2 charges) - Select a green node, increasing hacking chances of getting this node permanently. Strongest hacking chance buff. Do not leave a log."],
				"Night": ["Cover Your Tracks (2 charges) - Move your hideout, protecting yourself unless you are occupied. Arrest attempts will show a result similar to a target that is immune to arrest, like No Dirt On Me."],
				"Passives": ["Linear Runtime - You are extremely optimized, you know how to optimize your code. If you hack, download intel, or retrieve info, you can do another action."]
			}
		]
	},
	{
		"Netsec Offensive": 
		[
			{
				"Name":"Network Specialist",
				"Color": "lime",
				"Summary":"Review Spec prevents getting ISP’d next day",
				"Image": "networkspecialist.png",
				"Description": "“Your history in computers and networks will help greatly, Network Specialist.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Hack Target (Moderate) - Select a white node and attempt to hack it. Leaves a log.",
					"Probe Node - Select a white node, increasing hacking chances of getting this node. Strongest hacking chance buff. Leaves a log.",
					"Wireshark (D1 -> D4 cooldown) - Tells you the name of any operative that did a Denial of Service."],
				"Night": ["Cover Your Tracks (2 charges) - Move your hideout, protecting yourself unless you are occupied. Arrest attempts will show a result similar to a target that is immune to arrest, like No Dirt On Me.",
					"Review Connection Logs (2 charges) - Selects a target operative. Check if their connection was altered through ISP Isolation or Jam Network the previous day, and make them immune to ISP Isolation or Jam Network the following day. Visit them."],
				"Passives": ["Network Insights - For every Hack Target used on a node, you get a higher hack chance to get the node."]
			},
			{
				"Name":"Blackhat",
				"Color": "lime",
				"Summary":"Sprint allows 2 actions a single day",
				"Image": "blackhat.png",
				"Description": "“You are one of the most skilled hackers in Netsec’s arsenal, Blackhat.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Hack Target (Very High) - Select a white node and attempt to hack it. Leaves a log.",
					"Denial of Service (2 charges) - Select a green or white node and block all connections to the node this day. Do not leave a log.",
					"Exploit Vulnerability (2 charges) - Select a white node and attempt to hack it with a low hack chance and increasing hacking chances of getting this node."],
				"Night": ["Midnight Meet (N1 -> N3 cooldown) - Select a target operative. Visit and occupy them, talking about the hack. Do not reveal yourself to them.",
					"Prepare Sprint (1 charge) - The next day you can do two different day actions."],
				"Passives": ["None."]
			},
			{
				"Name":"Prodigy",
				"Color": "lime",
				"Summary":"Hacker with DDOS and hideouts",
				"Image": "prodigy.png",
				"Description": "“You are a natural, at least all the teachers said that. But you didn’t have fun until you used that talent to break the rules, Prodigy.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Hack Target (Moderate) - Select a white node and attempt to hack it. Leaves a log.",
					"Hit the Books (D1 -> D3 cooldown, 2 charges) - Increases your hacking stage by one, permanently.",
					"Create Hideout (D1 -> D4 cooldown, 2 charges) - Grants you one charge of Move Hideout.",
					"Denial of Service (2 charges) - Select a green or white node and block all connections to the node this day. Do not leave a log."],
				"Night": ["Move Hideout (1 charge) - Move your hideout, protecting yourself unless you are occupied.",
					"Study (N1 -> N3 cooldown) - Increases your hacking stage by one the following day.",
					"Dumpster Dive - Increases hacking chances on a random node."],
				"Passives": ["None."]
			},
			{
				"Name":"Laptop Specialist",
				"Color": "lime",
				"Summary":"% chances on override is gone and root is attainable all game",
				"Image": "laptopspecialist.png",
				"Description": "“You’ve broken into hundreds of personal computers, Laptop Specialist.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Hack Target (Low) - Select a white node and attempt to hack it. Leaves a log. If it is a laptop, the chance of a hack is high.",
					"Hack ROOT Access - Select a white node. If there is no rooted operative or OL, you can hack into root access by trying to hack a node with the OL’s connection and become an Operation Leader. Leaves a log."],
				"Night": ["Research Servers (2 charges) - Increases your hacking stage by one against servers the following day.",
					"Overdrive (1 charge) - Tomorrow, you can select a white laptop and instantly hack it, or select a server and have a very high chance to hack a server. Leaves a log."],
				"Passives": ["Laptop Expert - You have high hack chances on laptops, and low hack chances on servers. You will be known as someone with a low hack chance."]
			},
			{
				"Name":"Steadfast Student",
				"Color": "lime",
				"Summary":"Gains more power over time, has kill later",
				"Image": "steadfaststudent.png",
				"Description": "“Netsec taught you everything you know, you can’t let them fail, Steadfast Student.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Hack Target (Moderate) - Select a white node and attempt to hack it. Leaves a log. If Determined, the hack chance is high, and if Weathering the Storm, the hack chance is very high.",
					"Download Intel - Select a green node and attempt to download from it. If there is intel, and you download and remove it first, you will get class intel, target node, or faction intel. Do not go through frames or cover. Leaves a log."],
				"Night": ["Midnight Meet (N1 -> N3 cooldown) - Select a target operative. Visit and occupy them, talking about the hack. Do not reveal yourself to them.",
					"Move Hideout (1 charge) - Move your hideout, protecting yourself unless you are occupied.",
					"Determined<br>=======================================================================<br>Disorganized Murder - Select an operative and attempt to murder them. Visit the target. Only usable when Determined.",
					"Experienced Hiding (3 charges) - Move your hideout, protecting yourself unless you are occupied. Only usable when Determined.",
					"Weathering the Storm<br>=======================================================================<br>Murder (1 charge) - Select an operative and murder them. Cannot be dodged in any way. Occupies and visits the target. Only usable when Weathering the Storm."],
				"Passives": ["Determined - If approximately one third of the operatives have fallen, become Determined.",
					"Weathering the Storm - If approximately two thirds of the operatives have fallen, become Weathering the Storm."]
			},
			{
				"Name":"Network Architect",
				"Color": "lime",
				"Summary":"Add route and remove route",
				"Image": "networkarchitect.png",
				"Description": "“Network Architecture is your specialty, and you know every bit about routing and connecting clients and servers, Network Architect.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Hack Target (Moderate) - Select a white node and attempt to hack it. Leaves a log.",
					"Denial of Service (2 charges) - Select a green or white node and block all connections to the node this day. Do not leave a log."],
				"Night": ["Experienced Hiding (3 charges) - Move your hideout, protecting yourself unless you are occupied.",
					"Add Route (N1 -> N3 cooldown, 2 charges) - Select two nodes and add a route between them.",
					"Remove Route (N1 -> N3 cooldown, 2 charges) - Select an edge and remove the route, if it doesn’t isolate the node it connects to."],
				"Passives": ["None."]
			},
			{
				"Name":"Inside Man (Software Engineer)",
				"Color": "lime",
				"Summary":"Replace servers with laptops",
				"Image": "insidemansoftwareengineer.png",
				"Description": "“You don’t have high clearance at the target company, but any little bit helps. Cash out and get out, Inside Man (Software Engineer).”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Hack Target (Very Low) - Select a white node and attempt to hack it. Leaves a log.",
					"Download Intel - Select a green node and attempt to download from it. If there is intel, and you download and remove it first, you will get class intel, target node, or faction intel. Do not go through frames or cover. Leaves a log.",
					"Insider Knowledge (D1 -> D3 cooldown, 2 charges) - Tells you the IP of a node with downloadable intel on it.",
					"Plant Keylogger (1 charge) - Grants you one charge of Retrieve Keylogger."],
				"Night": ["Retrieve Keylogger (1 charge) - Select a node, making it easier to hack. Grants you one charge of Plant Keylogger.",
					"Replace Server (N1 -> N3 cooldown, 2 charges) - Replace a selected server with a laptop by connecting a company laptop to future nodes and disconnecting the server."],
				"Passives": ["Target Knowledge - You can see which node is the final target. This target will not win the game outright, but will allow you to gain significant global intel if hacked."]
			},
			{
				"Name":"Graph Theorist",
				"Color": "lime",
				"Summary":"Predict the next nodes and intel",
				"Image": "graphtheorist.png",
				"Description": "“You have studied for many years to prove yourself as one of the greatest academic minds in graph models, Graph Theorist.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Hack Target (Very High) - Select a white node and attempt to hack it. Leaves a log.",
					"Node prediction (2 charges) - Select a white node. You always predict correctly, so you get information about whether the next node is a laptop or a server.",
					"Random Graph Models (D1 -> D4 cooldown) - Reveal the next layer in the topology to yourself.",
					"Predict Target - Get the target node. Only usable upon the final layer."],
				"Night": ["Advisor (N1 -> N3 cooldown) - Select a target operative, their hacking chance temporarily increases by one stage. Visit them."],
				"Passives": ["None."]
			},
			{
				"Name":"Reverse Cryptographer",
				"Color": "lime",
				"Summary":"Download intel without connecting to the node, and decrease difficulty on all nodes",
				"Image": "reversecryptographer.png",
				"Description": "“You know the ins and outs of cryptography and cryptocurrency, Reverse Cryptographer.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Hack Target (Moderate) - Select a white node and attempt to hack it. Leaves a log.",
					"Exploit Vulnerability (2 charges) - Select a white node and attempt to hack it with a low hack chance and increasing hacking chances of getting this node.",
					"Chinese Remainder Theorem Teaching (1 charge) - You know how this company would encrypt their nodes, increasing the chances of hacking into all nodes this phase.",
					"Cryptocurrency Trading - Trade currency for some intel. Instead of downloading, you can try to get intel through buying and selling crypto on the market. Do not go through frames or cover. (Download Intel without leaving a connection log.)"],
				"Night": ["Cover Your Tracks (2 charges) - Move your hideout, protecting yourself unless you are occupied. Arrest attempts will show a result similar to a target that is immune to arrest, like No Dirt On Me.",
					"Pair Programming (1 charge) - Select a target operative, their hacking chance permanently increases by one stage. Visit them."],
				"Passives": ["None."]
			}
		]
	},
	{
		"Netsec Utility": 
		[
			{
				"Name":"Inside Man (Assistant)",
				"Color": "lime",
				"Summary":"The OG Inside Man",
				"Image": "insidemanassistant.png",
				"Description": "“You don’t have high clearance at the target company, but any little bit helps. Cash out and get out, Inside Man (Assistant).”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Insider Knowledge (D1 -> D3 cooldown, 2 charges) - Tells you the IP of a node with downloadable intel on it.",
					"Plant Keylogger (1 charge) - Grants you one charge of Retrieve Keylogger.",
					"Desperate Measures (1 charge) - Turn into an Improvised Hacker."],
				"Night": ["Follow (2 charges) - Select a target operative and follow them, visiting them and checking if they left their hideout and met anyone. If they were occupied, you’d only know that they could not leave their hideout.",
					"Retrieve Keylogger (1 charge) - Select a node, making it easier to hack. Grants you one charge of Plant Keylogger.",
					"Dumpster Dive - Increases hacking chances on a random node."],
				"Passives": ["Target Knowledge - You can see which node is the final target. This target will not win the game outright, but will allow you to gain significant global intel if hacked."]
			},
			{
				"Name":"Hacking Instructor",
				"Color": "lime",
				"Summary":"Buff hackers and check for moles",
				"Image": "hackinginstructor.png",
				"Description": "“It’s time to see how your students have grown, Hacking Instructor.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log. (You know how to hack, but you don’t want to do it unless absolutely necessary.)",
					"Desperate 0-day (1 charge) -  Select a white node and instantly hack it. Leaves a log.",
					"Desperate Measures (1 charge) - Turn into an Improvised Hacker. Automatically start with Very High hacking chances."],
				"Night": ["For the Cause (N1 -> N4 cooldown, 2 charges) - Find out if the target operative is a mole. Do not go through frames or cover. Visit them.",
					"Pair Programming (1 charge) - Select a target operative, their hacking chance permanently increases by one stage. Visit them.",
					"Advisor (N1 -> N3 cooldown) - Select a target operative, their hacking chance temporarily increases by one stage. Visit them."],
				"Passives": ["Old Guard - If asked the right question, they will receive a Very High hacking chance result."]
			},
			{
				"Name":"Spearphisher",
				"Color": "lime",
				"Summary":"Can see if next node has intel",
				"Image": "spearphisher.png",
				"Description": "“Your ability to crack passwords and convince people to give you information has gotten you a position in Netsec, Spearphisher.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Hack Target (Very Low) - Select a white node and attempt to hack it. Leaves a log.",
					"Spearphisher Execution (0 charges) - Select a white node, increasing hacking chances of getting this node. Also finds out if there is intel on this node. Leaves a log.",
					"Download Intel - Select a green node and attempt to download from it. If there is intel, and you download and remove it first, you will get class intel, target node, or faction intel. Leaves a log.",
					"Impersonate (1 charge) - Permanently rename your operative to whatever name you want. If you name it the same as another operative, targeting that operative will randomly target either operative of the same name."],
				"Night": ["Spearphisher Preparation (1 charge) - Grants one charge of Spearphisher Execution.",
					"Move Hideout (1 charge) - Move your hideout, protecting yourself unless you are occupied.",
					"Misdirection (1 charge) - Occupy anyone that visits you directly, blocking any attempts to visit, occupy, and kill directly. Does not save you from Raids, Stings, and other indirect methods of killing this operative."],
				"Passives": ["None."]
			},
			{
				"Name":"Loan Shark",
				"Color": "lime",
				"Summary":"Jack of all trades buying different abilities role",
				"Image": "loanshark.png",
				"Description": "“You are pretty crafty at getting money out of people, Loan Shark.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Buy Field Operations (0 charges) - Buy one night ability with one charge between Misdirection, Emergency Extraction, and Follow.",
					"(Only after Hacking Tools are bought, only one is picked per bought tool, only one charge).<br>=======================================================================<br>Hack Target (Moderate, 1 charge) - Select a white node and attempt to hack it. Leaves a log.",
					"Download Intel (1 charge) - Select a green node and attempt to download from it. If there is intel, and you download and remove it first, you will get class intel, target node, or faction intel. Do not go through frames or cover. Leaves a log.",
					"Probe Node (1 charge) - Select a white node, increasing hacking chances of getting this node. Strongest hacking chance buff. Leaves a log."],
				"Night": ["Sell Loan (N1 -> N3 cooldown) - Select a target operative. Visit and occupy them, gaining a charge of Buy Hacking Tools or Buy Field Operations. (Same as Midnight Meet).",
					"Buy Hacking Tools (0 charges) - Buy one day ability with one charge between Hack Target (Moderate), Download Intel, and Probe Node.",
					"(Only after Field Operations are bought, only one is picked per bought tool, only one charge).<br>=======================================================================<br>Misdirection (1 charge) - Occupy anyone that visits you directly, blocking any attempts to visit, occupy, and kill directly. Does not save you from Raids, Stings, and other indirect methods of killing this operative.",
					"Emergency Extraction (N1 -> N3 cooldown, 1 charge) - Select an operative to escort, does not occupy them and makes them immune to everything unless otherwise stated.",
					"Follow (1 charge) - Select a target operative and follow them, visiting them and checking if they left their hideout and met anyone. If they were occupied, you’d only know that they could not leave their hideout."],
				"Passives": ["None."]
			},
			{
				"Name":"Propagandist",
				"Color": "lime",
				"Summary":"Find/shoot mole without becoming the mole",
				"Image": "propagandist.png",
				"Description": "“You will make sure the cause is heard far and wide, Propagandist.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Download Intel - Select a green node and attempt to download from it. If there is intel, and you download and remove it first, you will get class intel, target node, or faction intel. Do not go through frames or cover. Leaves a log."],
				"Night": ["For the Cause (N1 -> N4 cooldown, 2 charges) - Find out if the target operative is a mole. Do not go through frames or cover. Visit them.",
					"Preach Netsec Superiority (N1 -> N3 cooldown) - Select a target operative, tonight they are immune to occupation. Visit them.",
					"Disorganized Murder - Select an operative and attempt to murder them. Visit the target."],
				"Passives": ["None."]
			},
			{
				"Name":"Maintenance Man",
				"Color": "lime",
				"Summary":"Janitor but for Netsec, also can clean and modify topology",
				"Image": "maintenanceman.png",
				"Description": "“Your employer hasn’t paid you enough. But Netsec? They’re offering plenty, Maintenance Man.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Log Analysis - Select a green node and clear any fake logs from Alter Logs or Rollback. Leaves a log.",
					"Server Maintenance - Select a white node. Prevent this node from being hardened in any way using the Harden Node or similar difficulty increasing skills. Leaves a log.",
					"Emergency Repairs (1 charge) - Select a green or white node and block all connections to the node this day. Lets you know if a rollback was used on the node. Do not leave a log."],
				"Night": ["Clean Up Crew (N1 -> N4 cooldown) - Remove the operative’s role and logs on their death or arrest. Visit them.",
					"Check Maintenance Logs - Select a green or white node. Check if there were any difficulty decreasing or increasing actions done on this node, telling you separately if the node security had been increased or decreased.",
					"Backup Access Logs (2 charges) - Select a white node. Prevent this node from being wiped using the Wipe skill."],
				"Passives": ["None."]
			},
			{
				"Name":"Malware Programmer",
				"Color": "lime",
				"Summary":"Jam network and reducing node strength",
				"Image": "malwareprogrammer.png",
				"Description": "“You’ve programmed trojans, viruses, malware, ransomware, everything really, now it’s time to put your skills to good use, Malware Programmer.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Hack Target (Very Low) - Select a white node and attempt to hack it. Leaves a log.",
					"Harden Node (D1 -> D3 cooldown, 2 charges) - Select a white node. Decreasing hacking chances of getting this node. Strongest hacking chance nerf. Leaves a log.",
					"Jam Network (2 charges) - Select a target operative and disable all day actions related to the topology done by them.",
					"Trojan Attack (1 charge) - Make all white nodes easier to hack today. Weak hacking buff."],
				"Night": ["Move Hideout (1 charge) - Move your hideout, protecting yourself unless you are occupied.",
					"Worm Attack (2 charges) - All hacks tomorrow will have an increased hack chance by one stage.",
					"Virus Attack (2 charges) - Select a target operative and lower their hack chance by one stage. Visit them."],
				"Passives": ["None."]
			},
			{
				"Name":"Sympathetic Reporter",
				"Color": "lime",
				"Summary":"Utility role around Global Intel",
				"Image": "sympatheticreporter.png",
				"Description": "“Netsec needs a loud voice to help give advice and lead the hack, Sympathetic Reporter.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Reporter’s Voice - Globally announce a particular operative as a high priority target to all operatives.",
					"Desperate Measures (1 charge) - Turn into an Improvised Hacker."],
				"Night": ["Get Scoop (N1 -> N3 cooldown) - Select a target operative. Visit and occupy them, talking about the hack. Do not reveal yourself to them. Find if the target is not neutral.",
					"Preach Netsec Superiority (N1 -> N3 cooldown) - Select a target operative, tonight they are immune to occupation. Visit them."],
				"Passives": ["Not Netsec - Any doxx attempts on you doxx you as Neutral."]
			},
			{
				"Name":"Drug Dealer",
				"Color": "lime",
				"Summary":"Utility role that can buff other operatives",
				"Image": "drugdealer.png",
				"Description": "“Desperate times call for desperate adderall abuse, Drug Dealer.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Prepare Drugs - Gives a charge of a drug of choice to use at night.",
					"Desperate Measures (1 charge) - Turn into an Improvised Hacker."],
				"Night": ["Sell Meth (1 charge) - Select a target operative. Sell them Methamphetamine and make them immune to occupation for this turn. Visit them.",
					"Sell Adderall (1 charge) - Select a target operative. Sell them Adderall, and give them one extra action in the day. Visit them.",
					"Sell Cocaine (1 charge) - Select a target operative. Sell them Cocaine, and make them dodge arrests or murder attempts for this turn (that are not guaranteed murders). Visit them."],
				"Passives": ["Overdose - If you give someone drugs three times in a row, they overdose and immediately die."]
			}
		]
	},
	{
		"Netsec Social": 
		[
			{
				"Name":"Disgraced Loyalist",
				"Color": "lime",
				"Summary":"Can sacrifice himself to save another, doxxed as neutral",
				"Image": "disgracedloyalist.png",
				"Description": "“A long time ago, Netsec kicked you off the crew, but you want to rejoin them, time to prove your worth, Disgraced Loyalist.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Hack Target (Low) - Select a white node and attempt to hack it. Leaves a log.",
					"Download Intel - Select a green node and attempt to download from it. If there is intel, and you download and remove it first, you will get class intel, target node, or faction intel. Do not go through frames or cover. Leaves a log."],
				"Night": ["For the Cause (N1 -> N4 cooldown, 2 charges) - Find out if the target operative is a mole. Do not go through frames or cover. Visit them.",
					"Ultimate Sacrifice - Tonight, you can sacrifice yourself for anyone who gets arrested or murdered tonight of your choice.",
					"Disorganized Murder - Select an operative and attempt to murder them. Visit the target."],
				"Passives": ["Not Netsec - Any doxx attempts on you doxx you as Neutral."]
			},
			{
				"Name":"Double Agent",
				"Color": "lime",
				"Summary":"Doxxed as agent, has frame and arrest too",
				"Image": "doubleagent.png",
				"Description": "“You are still working for agents, but your true alignment has always been Netsec, Double Agent.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Desperate Measures (1 charge) - Turn into an Improvised Hacker."],
				"Night": ["Citizen’s Arrest (N1 -> N3 cooldown, 3 charges) - Select a target operative and arrest them. Visit them.",
					"Frame (N1 -> N3 cooldown, 2 charges) - Select a target operative. Change their role to be anything you want, which they will then have all intel abilities follow that frame. Removes No Dirt On Me and can be used on Agents, making them arrestable. Visit them."],
				"Passives": ["Agent Scum - Any doxx attempts on you doxx you as Agent."]
			},
			{
				"Name":"Hacking Advocate",
				"Color": "lime",
				"Summary":"Can increase or decrease votes on operatives",
				"Image": "hackingadvocate.png",
				"Description": "“Netsec is paying you fat stacks for your assistance in political issues, Hacking Advocate.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Act as Prosecution - Select a target operative. The operative will have an extra vote (+1) against them in the next phase, not shown to the Opsec.",
					"Act as Defense - Select a target operative. The operative will have an extra vote (-1) with them next phase, not shown to the Opsec."],
				"Night": ["Throw Under the Bus (2 charges) - Select a target operative. All skills used on you will be used on the target operative.",
					"Act as Prosecution - Select a target operative. The operative will have an extra vote (+1) against them in the next phase, not shown to the Opsec.",
					"Act as Defense - Select a target operative. The operative will have an extra vote (-1) with them next phase, not shown to the Opsec."],
				"Passives": ["None."]
			},
			{
				"Name":"Technical Recruiter",
				"Color": "lime",
				"Summary":"Similar to Noble from ToL, force vote",
				"Image": "technicalrecruiter.png",
				"Description": "“You were hired to hire people into Netsec, but now we need every last man, Technical Recruiter.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Hiring Check (D1 -> D3 cooldown) - Check how an operative was hired. You’ll be given a (non-unique) random skill that they have, either day or night. Do not go through frames or cover.",
					"Onboarding Process - Force someone to vote for someone of your choice."],
				"Night": ["Wiretap (N1 -> N4 cooldown) - Select a target operative. Check the operative’s outgoing and ingoing communications to check for operatives that potentially are of the same owner. Gives three potential operatives that could be linked to the target operative. Visit them.",
					"Onboarding Process - Force someone to vote for someone of your choice."],
				"Passives": ["People Person - You know how to navigate the sausage fest known as Netsec. You can force one person to vote for who you are voting every round without anyone knowing."]
			},
			{
				"Name":"Silenced Investigator",
				"Color": "lime",
				"Summary":"Egg’s role, Canadian, wants to get arrested",
				"Image": "silencedinvestigator.png",
				"Description": "“You’ve had some inside intel into the company Netsec is to hack, but agents are blackmailing you, Silenced Investigator.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Insider Knowledge (D1 -> D3 cooldown, 2 charges) - Tells you the IP of a node with downloadable intel on it.",
					"Desperate Measures (1 charge) - Turn into an Improvised Hacker."],
				"Night": ["Follow (2 charges) - Select a target operative and follow them, visiting them and checking if they left their hideout and met anyone. If they were occupied, you’d only know that they could not leave their hideout.",
					"Signal Flare (3 charges) - If you are arrested tonight, 3 random operatives will be globally announced, with one as the arrester.",
					"Loitering (1 charge) - Select a target operative and follow them, visiting them. If they get arrested, so do you, and you shoot a signal flare on the way out."],
				"Passives": ["Agent Blackmailed - You cannot vote."]
			},
			{
				"Name":"NFT Scammer",
				"Color": "lime",
				"Summary":"Alter Logs, Frame, Impersonate on a Netsec role",
				"Image": "nftscammer.png",
				"Description": "“Time to scam some people out of their money and pull some rugs, NFT Scammer.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Hack Target (Low) - Select a white node and attempt to hack it. Leaves a log.",
					"Generative Adversarial Network (D1 -> D3 cooldown, 3 charges) - Select a white or green node and either leave a singular fake connection log of one operative, or leave a few random connection logs.",
					"Impersonate (1 charge) - Permanently rename your operative to whatever name you want. If you name it the same as another operative, targeting that operative will randomly target either operative of the same name.",
					"Generate Avatar (2 charges) - Permanently rename another operative to whatever name you want. If you name it the same as another operative, targeting that operative will randomly target either operative of the same name."],
				"Night": ["NFT Scam (N1 -> N3 cooldown) - Select a target operative. Visit and occupy them, talking about an NFT. If you want to, you can use a charge of frame here. (Same as Midnight Meet).",
					"Frame (N1 -> N3 cooldown, 2 charges) - Select a target operative. Change their role to be anything you want, which they will then have all intel abilities follow that frame. Removes No Dirt On Me and can be used on Agents, making them arrestable. Visit them.",
					"Pull the Rug (1 charge) - Pull the rug, scamming everyone in the game and making everyone’s hack chance less by 1 stage for 1 round."],
				"Passives": ["Metaverse Enjoyer - You can choose to frame yourself as any role in the game."]
			},
			{
				"Name":"Rookie Assassin",
				"Color": "lime",
				"Summary":"Nice Guesser, can shoot people based on roles",
				"Image": "rookieassassin.png",
				"Description": "“You are supposed to be on the Operation Leader’s payroll, but you needed to train up as one of the operatives first, Rookie Assassin.”",
				"Win Condition": "Eliminate ALL hostile units (Agents, W3C, and Neutral Killing).",
				"Day": ["Hack Target (Low) - Select a white node and attempt to hack it. Leaves a log.",
					"Proving Shot - Select a target operative and guess their role. If you guess right, attempt to shoot the target operative tonight. If you guess wrong, take your own life instead. Removes all frames and covers. You will know if you guessed right or wrong."],
				"Night": ["Proving Shot - Select a target operative and guess their role. If you guess right, attempt to shoot the target operative. If you guess wrong, take your own life instead. Removes all frames and covers.",
					"Follow (2 charges) - Select a target operative and follow them, visiting them and checking if they left their hideout and met anyone. If they were occupied, you’d only know that they could not leave their hideout.",
					"Misdirection (1 charge) - Occupy anyone that visits you directly, blocking any attempts to visit, occupy, and kill directly. Does not save you from Raids, Stings, and other indirect methods of killing this operative."],
				"Passives": ["Assassin’s Creed - If you are voted, the veteran assassin will kill you and feel guilty the next phase, making there be no voting on the next phase."]
			}
		]
	},
	{
		"The Decent Guys": 
		[
			{
				"Name":"Neutral",
				"Color": "white",
				"Summary":"Interlopers on their own agenda, do your own win condition specified",
				"Image": "neutral.png",
				"Description": "“I’m here for a specific purpose on my own agenda.”",
				"Win Condition": "Do your particular objective.",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"Neutral Special": 
		[
			{
				"Name":"Neutral Leader",
				"Color": "white",
				"Summary":"OL but neutral",
				"Image": "operationleader.png",
				"Description": "This role is unique (one Operation Leader should spawn).<br>“Time to get home in one piece, Neutral Leader.”",
				"Win Condition": "Survive.",
				"Day": ["Hack Target (High) - Select a white node and attempt to hack it. Leaves a log.",
					"0-Day Exploit (1 charge) - Select a white node and instantly hack it. Leaves a log.",
					"Give Root Access (1 charge) - Select an operative to give root to. They become any of Operation Leader, Blackmailed Leader, Sociopath Leader, W3C Operation Leader, Paragon Operation Leader, or are simply an agent, neutral, Paragon Leader, or W3C Leader with access to the special channel. A Neutral Leader can only spawn in."],
				"Night": ["Experienced Hiding (3 charges) - Move your hideout, protecting yourself unless you are occupied.",
					"Emergency Extraction (N1 -> N3 cooldown, 3 charges) - Select an operative to escort, does not occupy them and makes them immune to everything unless otherwise stated."],
				"Passives": ["Covert Broadcast - You should be given access to talk to all players in a specialized channel (global Opsec info).",
					"Operation Leader - You are one of the leading roles and should spawn every operation."]
			},
			{
				"Name":"Gambling Leader",
				"Color": "white",
				"Summary":"OL that can gamble his win condition",
				"Image": "gamblingleader.png",
				"Description": "This role is unique (one Operation Leader should spawn).<br>“Lady luck has never failed you, Gambling Leader.”",
				"Win Condition": "Survive. Changes upon using Feeling Lucky to win with Netsec, Agent, Paragon, or W3C.",
				"Day": ["Feeling Lucky (2 charges) - Randomize your win condition to a faction to win with.",
					"Hack Target (Random) - Select a white node and attempt to hack it. Randomly rolls a hacking chance every time the ability is used. If you are asked the right question, the operative who did that will get the hack chance you had today. Leaves a log.",
					"Roll the Dice - Select a white node and randomly instantly hack it or use a denial of service on it, stopping all connections to the node.  Do not leave a log.",
					"Give Root Access (1 charge) - Select an operative to give root to. They become any of Operation Leader, Blackmailed Leader, Sociopath Leader, W3C Operation Leader, Paragon Operation Leader, or are simply an agent, neutral, Paragon Leader, or W3C Leader with access to the special channel. A Neutral Leader can only spawn in.",
					"Give Assassin Access (1 charge) - Select an operative to give assassin access to. They can choose a target operative to kill the next night temporarily."],
				"Night": ["Feeling Lucky (2 charges) - Randomize your win condition to a faction to win with.",
					"Experienced Hiding (3 charges) - Move your hideout, protecting yourself unless you are occupied.",
					"Up the Ante - (2 charges) - Select four operatives. Bring them all to a casino, protecting them from all murder and arrest attempts. Does not visit or occupy."],
				"Passives": ["Covert Broadcast - You should be given access to talk to all players in a specialized channel (global Opsec info).",
					"Operation Leader - You are one of the leading roles and should spawn every operation.",
					"Lady Luck - The two charges of Feeling Lucky persist between both day and night (max 2 total in the game)."]
			},
			{
				"Name":"Cheeseburger Technician",
				"Color": "white",
				"Summary":"Alex’s role, journalist OL",
				"Image": "cheeseburgertechnician.png",
				"Description": "This role is unique (one Operation Leader should spawn).<br>“It’s time to go ham-burger, Cheeseburger Technician.”",
				"Win Condition": "Give 3 burgers to operatives of your choice.",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Smoke Break (1 charge) - Select four operatives. Make them all smoke with you, occupying them this day.",
					"Prep Time - Choose two core ingredients between chicken, beef patty, steak, veggie patty, and pork chop. Grants 2 charges of Cook Burger.",
					"Cook Burger (0 charges) - Cook a burger using a chosen ingredient that has been done in Prep Time. Gives a charge of Serve Burger."],
				"Night": ["Serve Burger (0 charges) - Select a target operative. Feed them a burger. Chicken Patty grants immunity to occupation this turn. Beef Patty occupies them. Steak gives them an extra action in the day. Veggie Patty gives them stomach issues, occupying them in the day. Pork Chop makes them dodge arrests or murder attempts for this turn (that are not guaranteed murders). Visit them.",
					"Food Channel (1 charge) - Select four operatives. Make them all hungry, occupying them tonight."],
				"Passives": ["Covert Broadcast - You should be given access to talk to all players in a specialized channel (global Opsec info).",
					"Operation Leader - You are one of the leading roles and should spawn every operation.",
					"No Dirt On Me - You are unarrestable unless framed."]
			},
			{
				"Name":"Sociopath",
				"Color": "white",
				"Summary":"Kills OL to become Neut leader with same win condition, or sociopath leader to kill everyone",
				"Image": "sociopath.png",
				"Description": "This role is supposed to be unique, depending on the ruleset.<br>“You will become the most famous hacker to ever live, Sociopath.”",
				"Win Condition": "Shoot the Operation Leader and become the Neutral Leader or Sociopath Leader, your choice. If you become the Neutral Leader, get arrested, if you become the Sociopath Leader, eliminate all W3C, Netsec, Paragon, and agents.",
				"Day": ["Hack Target (Low) - Select a white node and attempt to hack it. Leaves a log.",
					"Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Hack ROOT Access - Select a white node. If there is no rooted operative or OL, you can hack into root access by trying to hack a node with the OL’s connection and become the OL. Leaves a log."],
				"Night": ["Follow (2 charges) - Select a target operative and follow them, visiting them and checking if they left their hideout and met anyone. If they were occupied, you’d only know that they could not leave their hideout.",
					"Frame (N1 -> N3 cooldown, 2 charges) - Select a target operative. Change their role to be anything you want, which they will then have all intel abilities follow that frame. Removes No Dirt On Me and can be used on Agents, making them arrestable. Visit them.",
					"Murder (1 charge) - Select an operative and murder them. Cannot be dodged in any way. Occupies and visits the target. Become the Neutral Leader or Sociopath Leader if the target murdered is the Operation Leader. Only can become the Sociopath Leader if all your other operatives are neutral."],
				"Passives": ["Unstable Mind - Whoever arrests you gets an extra STING charge. Doesn’t have to be an agent.",
					"Rent Free - Avoid the first arrest attempt and murder attempt on you."]
			},
			{
				"Name":"Resentful Criminal",
				"Color": "white",
				"Summary":"Has a double kill to kill AL and OL",
				"Image": "resentfulcriminal.png",
				"Description": "This role is supposed to be unique, depending on the ruleset.<br>“You remember their faces very well, or well enough, Resentful Criminal.”",
				"Win Condition": "Kill the original Operation Leader and a core agent role. (Core agent can be any non-mole agent role).",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Impersonate (1 charge) - Permanently rename your operative to whatever name you want. If you name it the same as another operative, targeting that operative will randomly target either operative of the same name."],
				"Night": ["Looking for an Old Friend (N1 -> N3 cooldown) - Select a target operative, if they are a target, you will know. Goes through cover or frames. Visit them.",
					"Interrogate (3 charges) - Select a target operative and occupy them. The host will ask them for their logs, giving you what they send.",
					"Disorganized Murder - Select an operative and attempt to murder them. Visit the target.",
					"Resentful Reunion (2 charges) - Select two operatives, if they are both a target of yours, kill them. If one is not your target, do nothing. Cannot be dodged in any way."],
				"Passives": ["Paragon Spy - You have done business for Paragon in the past. If Paragon spawns in this Opsec, you will know about it.",
					"W3C Scumbags - You're watching for those snakes at W3C. If W3C spawns in this Opsec, you will know about it.",
					"Rent Free - Avoid the first arrest attempt and murder attempt on you."]
			},
			{
				"Name":"The Employer",
				"Color": "white",
				"Summary":"Baguette’s special role, serious firepower with murder",
				"Image": "theemployer.png",
				"Description": "This role is supposed to be unique, depending on the ruleset.<br>“This Opsec is too important to be left in the hands of an incompetent leader, Employer.”",
				"Win Condition": "Hack the target node, or ransom the OL’s computer and give it to someone who isn't an agent.",
				"Day": ["Hack Target (High) - Select a white node and attempt to hack it. Leaves a log.",
					"Ransom Computer - Select a target operative. If the target operative has the ability to root, steal the ability to root, remove the current root, and grant 1 charge of Give Root Access.",
					"Jam Network (2 charges) - Select a target operative and disable all day actions related to the topology done by them.",
					"Give Root Access (0 charge) - Select an operative to give root to. They become any of Operation Leader, Blackmailed Leader, Sociopath Leader, W3C Operation Leader, Paragon Operation Leader, or are simply an agent, neutral, Paragon Leader, or W3C Leader with access to the special channel. A Neutral Leader can only spawn in."],
				"Night": ["Midnight Meet (N1 -> N3 cooldown) - Select a target operative. Visit and occupy them, talking about the hack. Do not reveal yourself to them.",
					"Emergency Extraction (N1 -> N3 cooldown, 3 charges) - Select an operative to escort, does not occupy them and makes them immune to everything unless otherwise stated.",
					"Special Orders (1 charge) - Select an operative and murder them. Cannot be dodged in any way. Occupies but does NOT visit the target."],
				"Passives": ["Authority - You have two votes. Only the starting Operation Leader role has this passive.",
					"Lack of Leadership -  If you are rooted and the original Operation Leader dies, instead of becoming the Operation Leader, gain a charge of Give Root Access.",
					"No Dirt On Me - You are unarrestable unless framed.",
					"The Big Fish - Whoever arrests you gets two STING charges. Doesn’t have to be an agent.",
					"Employer’s Camouflage - Pick your class that you are entirely framed as, which you will then have all intel abilities follow that frame. This does not remove No Dirt On Me."]
			}
		]
	},
	{
		"Neutral Field Operations": 
		[
			{
				"Name":"Loose Cannon",
				"Color": "white",
				"Summary":"Get randomed 3 win conditions",
				"Image": "loosecannon.png",
				"Description": "“You’ve got an agenda to carry out, Loose Cannon.”",
				"Win Condition": "Win on the three of your objectives.",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log."],
				"Night": ["Fake Escort - Escort a target operative, but leave as soon as trouble comes, letting the original target die or get arrested. Visit and occupy them.",
					"Follow (2 charges) - Select a target operative and follow them, visiting them and checking if they left their hideout and met anyone. If they were occupied, you’d only know that they could not leave their hideout.",
					"Assault and Battery - Select an operative and attempt to murder them. Visit the target.",
					"Citizen’s Arrest (N1 -> N3 cooldown, 3 charges) - Select a target operative and arrest them. Visit them."],
				"Passives": ["Agent Scum - Any doxx attempts on you doxx you as Agent.",
					"Loose Cannon - You gain 1 Netsec, 1 Neutral, and 1 against Netsec objectives, listed below.",
					"Rent Free - Avoid the first arrest attempt and murder attempt on you.",
					"Netsec Objectives<br>=======================================================================<br>Eliminate the Field Agent role.<br>Fake Escort 2 non-Netsec targets.<br>Kill a non-Netsec.<br>Eliminate a core agent role.<br>Eliminate the W3C Leader.<br>Follow a non-Netsec visiting another player.<br>Help Netsec vote out an agent.<br>Eliminate an agent mole.<br>Eliminate a W3C operative.<br>Eliminate a Neutral Killing role.<br>Make W3C lose.<br>Make agents lose.<br>Win with Netsec.",
					"Neutral Objectives<br>=======================================================================<br>Eliminate a neutral operative.<br>Eliminate a Paragon operative.<br>Kill any operative.<br>Kill two operatives.<br>Eliminate the Operation Leader and the Field Agent role.<br>Fake Escort 2 players.<br>Arrest 1 operative with Citizen's Arrest.<br>Fake Escort someone who dies or gets arrested while you escort them.<br>Follow someone visiting another player.<br>Follow someone and find that the operative could not leave their hideout.<br>Follow someone and find that the operative did not leave their hideout.<br>Make Paragon lose.<br>Make a Neutral Killing role lose.<br>Win with Paragon.",
					"Against Netsec Objectives<br>=======================================================================<br>Kill a Netsec.<br>Eliminate the Operation Leader.<br>Eliminate a Netsec field ops role.<br>Kill a Netsec hacking class.<br>Fake Escort a Netsec who was attempting to visit someone.<br>Arrest 1 Netsec operative with Citizen's Arrest.<br>Fake Escort an operative for 2 nights in a row. The chain is not broken if you are occupied.<br>Help the agents vote out a non-agent.<br>Help W3C vote out a non-W3C.<br>Help a Neutral Killing vote out someone else.<br>Make Netsec lose.<br>Win with agents.<br>Win with W3C.<br>Win with a Neutral Killing."]
			},
			{
				"Name":"Bounty Hunter",
				"Color": "white",
				"Summary":"Can spill beans both day and night",
				"Image": "bountyhunter.png",
				"Description": "“It’s about time you earn your paycheck, Bounty Hunter.”",
				"Win Condition": "Get 3 bounties. Arresting or spilling the beans on a Netsec or framed target grants 1 bounty. High Priority Targets give 2 bounties.",
				"Day": ["Spill the Beans - Select a target operative, inform agents that the target is one working for Netsec. If the target is arrested, gain a bounty.",
					"Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Plant Fake Info - Decreases hacking chances on a random node.",
					"Review TCP Packets (N1 -> N4 cooldown, 2 charges) - Select a target operative and check if they used a hack today."],
				"Night": ["Spill the Beans - Select a target operative, inform agents that the target is one working for Netsec. If the target is arrested, gain a bounty.",
					"Citizen’s Arrest (N1 -> N3 cooldown, 3 charges) - Select a target operative and arrest them. Visit them.",
					"Frame (N1 -> N3 cooldown, 2 charges) - Select a target operative. Change their role to be anything you want, which they will then have all intel abilities follow that frame. Removes No Dirt On Me and can be used on Agents, making them arrestable. Visit them.",
					"In the Force (Pick 1)<br>=======================================================================<br>Fake Escort - Escort a target operative, but leave as soon as trouble comes, letting the original target die or get arrested. Visit and occupy them.",
					"Follow (2 charges) - Select a target operative and follow them, visiting them and checking if they left their hideout and met anyone. If they were occupied, you’d only know that they could not leave their hideout.",
					"Interrogate (3 charges) - Select a target operative and occupy them. The host will ask them for their logs, giving you what they send."],
				"Passives": ["No Dirt On Me - You are unarrestable unless framed.",
					"In the Force - Pick an ability between Fake Escort, Follow, and Interrogate.",
					"High Priority Targets - All special roles of any faction, Neutral Killings, and core agent roles are worth 2 bounties instead of 1."]
			},
			{
				"Name":"Criminal Freelancer",
				"Color": "white",
				"Summary":"Can give lots of utility with sell arms and blackmail, needs to get stacks of money",
				"Image": "criminalfreelancer.png",
				"Description": "“It’s time to make bank, Criminal Freelancer.”",
				"Win Condition": "Receive 5 payments.",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Overload Node (1 charge) - Select a white node. All connections and DDOS to this node will fail. If successful, gain one payment. Leaves a log.",
					"Blackmail (3 charges) - Select a target operative. They cannot vote for two phases. If successful, gain one payment, or if the target operative is an agent, gain 2 payments and become “Criminal”."],
				"Night": ["Sell Illicit Arms (N1 -> N3 cooldown) - Select a target operative. If they do not have access to the skill Disorganized Murder, give them 1 charge of Disorganized Murder the following night. This charge of Disorganized Murder is removed if it is not used the night it is given. Gain 1 payment if successful, or if the target operative is Netsec, gain 2 payments and become “Criminal”. Visit them.",
					"Getaway Driver (N1 -> N3 cooldown) - Escort a target operative, protecting the operative from arrests and murders. Both targets are immune to arrests and murders this round. Gain 1 payment, or if someone attempts to arrest the target operative, gain 2 payments and become “Criminal”. Visit and occupy them.",
					"Wiretap (N1 -> N4 cooldown) - Select a target operative. Check the operative’s outgoing and ingoing communications to check for operatives that potentially are of the same owner. Gives three potential operatives that could be linked to the target operative. Visit them.",
					"Disorganized Murder - Select an operative and attempt to murder them. Visit the target. Gain 1 payment, or if the target operative is an agent, gain 2 payments and become “Criminal”."],
				"Passives": ["No Dirt On Me - You are unarrestable unless framed. If you become “Criminal”, you will lose this passive.",
					"Unknown Criminal - Become a “Criminal” upon doing certain actions, like selling arms to a Netsec operative, escorting someone who is targeted by an arrest, killing an agent, or blackmailing an agent."]
			},
			{
				"Name":"Insane Officer",
				"Color": "white",
				"Summary":"Role that needs to kill a mole and become mole",
				"Image": "insaneofficer.png",
				"Description": "This role is supposed to be unique, depending on the ruleset.<br>“You have to rejoin the force no matter what, Insane Officer.”",
				"Win Condition": "Become a mole for the agents, and win with agents.",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Wireshark (D1 -> D4 cooldown) - Tells you the name of any operative that did a Denial of Service.",
					"Steal Secured Channel Connection - Select a white node. If there is a dead mole, you can hack into ASC by trying to hack a node with a dead mole’s connection and become the mole. Leaves a log."],
				"Night": ["Murder (1 charge) - Select an operative and murder them. Cannot be dodged in any way. Occupies and visits the target. If the target operative is a mole, kill them and become the mole.",
					"For the Cause (N1 -> N4 cooldown, 2 charges) - Find out if the target operative is a mole. Do not go through frames or cover. Visit them.",
					"Doxx and Stalk (N1 -> N4 cooldown, 2 charges) - Select a target operative. Do not go through frames or cover. Learn this operative’s faction alignment and visit them."],
				"Passives": ["Agent Scum - Any doxx attempts on you doxx you as Agent."]
			},
			{
				"Name":"Political Campaigner",
				"Color": "white",
				"Summary":"Alex Jones, can frame people and give intel to agents, needs to get stacks of money",
				"Image": "politicalcampaigner.png",
				"Description": "“You’ve been paid to shape the political agenda in some form, even if it isn’t helping Netsec, Political Campaigner.”",
				"Win Condition": "Survive and ensure Netsec wins, or have 10 funds.",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Receive Bribe - Add one fund to your total funds. This skill will provide class intel to agents.",
					"Jam Network (2 charges) - Select a target operative and disable all day actions related to the topology done by them.",
					"The Vault<br>=======================================================================<br>Hack Target (Low, 1 charge) - Select a white node and attempt to hack it. Leaves a log.",
					"Upload Intel (1 charge) - Select a green node and upload intel that is downloadable by others. Whoever downloading will get class intel, target node, or faction intel. Leaves a log."],
				"Night": ["Move Hideout (1 charge) - Move your hideout, protecting yourself unless you are occupied.",
					"Smear Campaign (N1 -> N4 cooldown) - Select a target operative. Change their role to be anything you want, which they will then have all intel abilities follow that frame. Removes No Dirt On Me and can be used on Agents, making them arrestable. Grants one fund, has no charges. Visit them.",
					"The Vault<br>=======================================================================<br>Follow (1 charge) - Select a target operative and follow them, visiting them and checking if they left their hideout and met anyone. If they were occupied, you’d only know that they could not leave their hideout.",
					"Misdirection (1 charge) - Occupy anyone that visits you directly, blocking any attempts to visit, occupy, and kill directly. Does not save you from Raids, Stings, and other indirect methods of killing this operative.",
					"Interrogate (1 charge) - Select a target operative and occupy them. The host will ask them for their logs, giving you what they send."],
				"Passives": ["The Vault - Purchase one of these skills per round (and use them in the same round if you would like to) for one fund: Follow, Misdirection, Interrogate, Hack Target (Low), Upload Intel.",
					"Greedy - You passively gain one fund every phase."]
			}
		]
	},
	{
		"Neutral Investigative": 
		[
			{
				"Name":"Journalist",
				"Color": "white",
				"Summary":"Shorter objective (2 articles) and Background Check",
				"Image": "journalist.png",
				"Description": "“It’s time to write the next big story, Journalist.”",
				"Win Condition": "Write 2 articles.",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Impartial Sabotage (1 charge) - Select a green node, return the node to a white node, un-hacking the node. Connections to nodes ahead fail. This gives a scoop.",
					"Background Search (D1 -> D3 cooldown) - Check a target operative’s background. You’ll be given a (non-unique) random skill that they have, either day or night. Do not go through frames or cover. This gives a scoop."],
				"Night": ["Get Scoop (N1 -> N3 cooldown) - Select a target operative. Visit and occupy them, talking about the hack. Do not reveal yourself to them. If the target is not a neutral, gain 1 scoop.",
					"Write Article (0 charges) - Write an article. Needs 1 scoop at least.",
					"Expose Operation Leader (1 charge) - Select a target operative. If they are the Operation Leader, gain 1 article immediately and reveal the Operation Leader globally. Visit and occupy them."],
				"Passives": ["Adaptable Journalism - Gain 1 scoop if someone occupies you that is not neutral.",
					"No Dirt On Me - You are unarrestable unless framed."]
			},
			{
				"Name":"Double Crosser",
				"Color": "white",
				"Summary":"Suicide Guesser, find out someone’s role, guess, and arrest both of yourselves",
				"Image": "doublecrosser.png",
				"Description": "“You’ve worked with Netsec for a long time, but you question if the cause is worth it, maybe it is time to take the easy way out, Double Crosser.”",
				"Win Condition": "Guess a target operative’s role through Turn Yourself In and get both of you arrested.",
				"Day": ["Hack Target (Very Low) - Select a white node and attempt to hack it. Leaves a log.",
					"Download Intel - Select a green node and attempt to download from it. If there is intel, and you download and remove it first, you will get class intel, target node, or faction intel. Do not go through frames or cover. Leaves a log. If successful, gain a piece of information.",
					"Review TCP Packets (N1 -> N4 cooldown, 2 charges) - Select a target operative and check if they used a hack today."],
				"Night": ["Obtain Evidence (N1 -> N3 cooldown) - Select a target operative. Visit and occupy them, talking about the hack. Give some intel, similar to Download Intel, getting class intel, target node, or faction intel. Do not go through frames or cover. Do not reveal yourself to them.",
					"Wiretap (N1 -> N4 cooldown) - Select a target operative. Check the operative’s outgoing and ingoing communications to check for operatives that potentially are of the same owner. Gives three potential operatives that could be linked to the target operative. Visit them.",
					"Review Specialization (N1 -> N4 cooldown, 2 charges) - Select a target operative. Learn their subclass, or framed or cover subclass. Do not go through frames or cover. Visit them.",
					"Turn Yourself In - Select a target operative and guess their role. If you guess right, they get arrested no matter what, no matter the alignment. You are also arrested too. Removes all frames and covers."],
				"Passives": ["One of Us - Any doxx attempts on you doxx you as Netsec."]
			},
			{
				"Name":"Shamed Journalist",
				"Color": "white",
				"Summary":"Needs to do more to achieve 3 articles with murder journalist",
				"Image": "shamedjournalist.png",
				"Description": "This role is supposed to be unique, depending on the ruleset.<br>“Crime Journalism means to cause crime to write journalism, Shamed Journalist.”",
				"Win Condition": "Write 3 articles.",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Get Dirt - Select a target operative. You will get one of two class types that they can be and gain 1 scoop. Do not go through frames or cover.",
					"Stakeout for Scoops - Select a target operative. If they are arrested tonight, gain 2 scoops.",
					"Destroy Intel - Select a green node, if you find intel that is of class intel, target node, or faction intel, destroy it, give yourself the intel, and gain 1 scoop."],
				"Night": ["Murder Journalist (1 charge) - Select a target operative. If the target is a journalist, visit, occupy, and murder them, gain 1 scoop, and remove Unrespected, becoming unarrestable. Otherwise, do nothing.",
					"Follow (2 charges) - Select a target operative and follow them, visiting them and checking if they left their hideout and met anyone. If they were occupied, you’d only know that they could not leave their hideout. Gain 1 scoop if they visit someone.",
					"Midnight Meet (N1 -> N3 cooldown) - Select a target operative. Visit and occupy them, talking about the hack. Do not reveal yourself to them. Gain 1 scoop if they attempt to do an action.",
					"Disorganized Murder - Select an operative and attempt to murder them. Visit the target. Gain 1 scoop if successful.",
					"Move Hideout (1 charge) - Move your hideout, protecting yourself unless you are occupied."],
				"Passives": ["Working Overtime - Scoops will automatically convert to articles.",
					"Unrespected - You require two scoops to write an article. If the passive is removed through Murder Journalist, you are unarrestable."]
			},
			{
				"Name":"Amateur Investigator",
				"Color": "white",
				"Summary":"Shorter objective (5 pieces of intel without having to sell), can get lots of intel",
				"Image": "amateurinvestigator.png",
				"Description": "“Let’s see who these people are, Amateur Investigator.”",
				"Win Condition": "Gather 5 pieces of information.",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Download Intel - Select a green node and attempt to download from it. If there is intel, and you download and remove it first, you will get class intel, target node, or faction intel. Do not go through frames or cover. Leaves a log. If successful, gain a piece of information.",
					"Background Search (D1 -> D3 cooldown) - Check a target operative’s background. You’ll be given a (non-unique) random skill that they have, either day or night. Do not go through frames or cover. If successful, gain a piece of information.",
					"Deep Learn (2 charges) - The next night action will go through any kind of cover, frame, or passives."],
				"Night": ["Speech Analysis (N1 -> N3 cooldown) - Start with a random operative. Select a target operative and compare their speech, checking if they can win together. Do not go through frames or cover. Visit them. If successful, gain a piece of information.",
					"Review Specialization (N1 -> N4 cooldown, 2 charges) - Select a target operative. Learn their subclass, or framed or cover subclass. Do not go through frames or cover. Visit them. If successful, gain a piece of information.",
					"Doxx and Stalk (N1 -> N4 cooldown, 2 charges) - Select a target operative. Do not go through frames or cover. Learn this operative’s faction alignment and visit them. If successful, gain a piece of information."],
				"Passives": ["No Dirt On Me - You are unarrestable unless framed.",
					"Unsecured Investigation - After gathering 3 pieces of information, you lose No Dirt On Me."]
			},
			{
				"Name":"Repressed Refugee",
				"Color": "white",
				"Summary":"Make sure at least one other operative survives, can learn from dead players and push Global Intel.",
				"Image": "repressedrefugee.png",
				"Description": "“You and your family escaped persecution thanks to some less than legal methods. However, they are in danger, as they picked to work with Netsec, Repressed Refugee.”",
				"Win Condition": "Protect at least one of your other operatives at all costs.",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Hack Target (Low) - Select a white node and attempt to hack it. Leaves a log.",
					"Download Intel - Select a green node and attempt to download from it. If there is intel, and you download and remove it first, you will get class intel, target node, or faction intel. Do not go through frames or cover. Leaves a log.",
					"Cry for Help - Globally announce a particular operative as a high priority target to all operatives."],
				"Night": ["Midnight Meet (N1 -> N3 cooldown) - Select a target operative. Visit and occupy them, talking about the hack. Do not reveal yourself to them.",
					"Ultimate Sacrifice - Tonight, you can sacrifice yourself for anyone who gets arrested or murdered tonight of your choice.",
					"Scout Dead Operative (2 charges) - Select a murdered or arrested operative. Choose an ability from the operative to use from the operative’s role, and use it this phase. Do not visit them."],
				"Passives": ["None."]
			},
			{
				"Name":"Vengeful Assassin",
				"Color": "white",
				"Summary":"Evil Guesser + Inquisitor",
				"Image": "vengefulassassin.png",
				"Description": "“You were a mainstay assassin until certain Netsec members betrayed you, so it’s time for some vengeance, Vengeful Assassin.”",
				"Win Condition": "Guess, vote, or get the 2 target operatives killed or arrested. Can be any faction.",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Hack Target (Low) - Select a white node and attempt to hack it. Leaves a log.",
					"Rerouted Denial of Service (2 charges) - Select a green or white node and block all connections to the node this day. Select a target operative to make this show up as the operative who used the denial of service with Wireshark. Do not leave a log.",
					"Vengeance (3 charges) - Select a target operative and guess their role. If you guess right, attempt to shoot the target operative tonight. Removes all frames and covers. You will know if you guessed right or wrong."],
				"Night": ["Deductive Reasoning (N1 -> N3 cooldown, 2 charges) - Select a target operative. You will learn their faction, and their subclass. Do not go through frames or cover. Visit them.",
					"Plant Agent Documentation (3 charges) - Select a target operative. If the operative is doxxed this round, they will be seen as an agent. If the operative is specialization reviewed, they will be seen as special. If the operative is asked the right question, they will be seen as unable to hack. If the operative is speech analyzed, they will be seen as unable to win with anyone. Visit them.",
					"Misdirection (1 charge) - Occupy anyone that visits you directly, blocking any attempts to visit, occupy, and kill directly. Does not save you from Raids, Stings, and other indirect methods of killing this operative.",
					"Vengeance (3 charges) - Select a target operatives and guess their role. If you guess right, attempt to shoot the target operative. Removes all frames and covers."],
				"Passives": ["Hunter’s Mark - If you vote an operative that is your target, your vote counts as 2 votes."]
			}
		]
	},
	{
		"Neutral Offensive": 
		[
			{
				"Name":"Script Kiddie",
				"Color": "white",
				"Summary":"Can turn into PB night 1, needs to hack or survive",
				"Image": "scriptkiddie.png",
				"Description": "“Make sure to get out alive, Script Kiddie.”",
				"Win Condition": "Survive, or hack 2 nodes.",
				"Day": ["Create Hideout (D1 -> D4 cooldown, 2 charges) - Grants you one charge of Move Hideout.",
					"Script Kiddie Attack - Select a node, green or white. If the node is green, it has a very low chance to hack the node. Leaves a log.",
					"Denial of Service (2 charges) - Select a green or white node and block all connections to the node this day. Do not leave a log."],
				"Night": ["Move Hideout (1 charge) - Move your hideout, protecting yourself unless you are occupied.",
					"Wake Up Call (1 charge) - Become the Panicked Blabbermouth."],
				"Passives": ["Unsecured Device - If you are arrested, the agents get some intel, similar to Download Intel, getting class intel, target node, or faction intel. Do not go through frames or cover.",
					"Hidden Connections - If you are murdered, the player that killed you will be arrested. If you are voted out, one random operative that voted you will be arrested."]
			},
			{
				"Name":"Panicked Blabbermouth",
				"Color": "white",
				"Summary":"Easier to turn into, needs to kill and leave",
				"Image": "panickedblabbermouth.png",
				"Description": "This role is only supposed to be in the game if a Script Kiddie becomes this role.<br>“You realized your inevitable fate of staying here, Panicked Blabbermouth.”",
				"Win Condition": "Kill 2 Netsec operatives and extract, or make sure Netsec loses.",
				"Day": ["Create Hideout (D1 -> D4 cooldown, 2 charges) - Grants you one charge of Move Hideout.",
					"Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Denial of Service (2 charges) - Select a green or white node and block all connections to the node this day. Do not leave a log."],
				"Night": ["Move Hideout (1 charge) - Move your hideout, protecting yourself unless you are occupied.",
					"Assault and Battery - Select an operative and attempt to murder them. Visit the target.",
					"Evacuation (1 charge) - Leave the Opsec if 2 players are killed. Frame yourself as killed."],
				"Passives": ["Unsecured Device - If you are arrested, the agents get some intel, similar to Download Intel, getting class intel, target node, or faction intel. Do not go through frames or cover.",
					"Hidden Connections - If you are murdered, the player that killed you will be arrested. If you are voted out, one random operative that voted you will be arrested."]
			},
			{
				"Name":"Rival Hacker",
				"Color": "white",
				"Summary":"Gains wiretap again",
				"Image": "rivalhacker.png",
				"Description": "“It’s time to take out your rival crew, Rival Hacker.”",
				"Win Condition": "Ensure Netsec lose.",
				"Day": ["Hack Target (Moderate) - Select a white node and attempt to hack it. Leaves a log.",
					"Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Harden Node (D1 -> D3 cooldown, 2 charges) - Select a white node. Decreasing hacking chances of getting this node. Strongest hacking chance nerf. Leaves a log.",
					"Jam Network (2 charges) - Select a target operative and disable all day actions related to the topology done by them.",
					"Hit the Books (D1 -> D3 cooldown, 2 charges) - Increases your hacking stage by one, permanently."],
				"Night": ["Experienced Hiding (3 charges) - Move your hideout, protecting yourself unless you are occupied.",
					"Wiretap (N1 -> N4 cooldown) - Select a target operative. Check the operative’s outgoing and ingoing communications to check for operatives that potentially are of the same owner. Gives three potential operatives that could be linked to the target operative. Visit them.",
					"Wipe (1 charge) - Select a white node. Remove all connection logs and intel to the node."],
				"Passives": ["Blackmailed Informant - Any time Informant is used by an Agent Leader, or an operative uses Deductive Reasoning, you will get information that agents get. Do not go through frames or cover.",
					"W3C Origin - If W3C spawned, you’ll know about it."]
			},
			{
				"Name":"Hacknet Hacker",
				"Color": "white",
				"Summary":"Needs to hack nodes to win",
				"Image": "hacknethacker.png",
				"Description": "“You learned to hack from the game Hacknet, now it’s time to prove your worth outside of games, Hacknet Hacker.”",
				"Win Condition": "Hack 2 separate nodes without getting arrested or killed before then.",
				"Day": ["Hack Target (Moderate) - Select a white node and attempt to hack it. Leaves a log.",
					"Exploit Vulnerability (2 charges) - Select a white node and attempt to hack it with a low hack chance and increasing hacking chances of getting this node.",
					"Hit the Books (D1 -> D3 cooldown, 2 charges) - Increases your hacking stage by one, permanently."],
				"Night": ["Me First (N1 -> N3 cooldown) - Process your hack first before everyone else’s hack next day phase.",
					"Ask for Assistance (N1 -> N3 cooldown, 2 charges) - Select a target operative and disable all day actions related to the topology. Steal their hack chance if it is higher than yours. Works like Jam Network. Visit them.",
					"Move Hideout (1 charge) - Move your hideout, protecting yourself unless you are occupied."],
				"Passives": ["Unsecured Device - If you are arrested, the agents get some intel, similar to Download Intel, getting class intel, target node, or faction intel. Do not go through frames or cover.",
					"Finding Fame Elsewhere - If you fail to hack 3 consecutive nodes, turn into a Sociopath permanently, even if Sociopath has spawned."]
			},
			{
				"Name":"Connection Specialist",
				"Color": "white",
				"Summary":"Attempt to both hack some targets and slow the hack",
				"Image": "connectionspecialist.png",
				"Description": "“It’s time to cause some chaos, Connection Specialist.”",
				"Win Condition": "Assist or deny hacking 3 different nodes. Be the turning point of that node’s hack.",
				"Day": ["Hack Target (Moderate) - Select a white node and attempt to hack it. Leaves a log.",
					"Probe Node - Select a white node, increasing hacking chances of getting this node. Strongest hacking chance buff. Leaves a log.",
					"Harden Node (D1 -> D3 cooldown, 2 charges) - Select a white node. Decreasing hacking chances of getting this node. Strongest hacking chance nerf. Leaves a log.",
					"Jam Network (2 charges) - Select a target operative and disable all day actions related to the topology done by them.",
					"Wireshark (D1 -> D4 cooldown) - Tells you the name of any operative that did a Denial of Service."],
				"Night": ["Cover Your Tracks (2 charges) - Move your hideout, protecting yourself unless you are occupied. Arrest attempts will show a result similar to a target that is immune to arrest, like No Dirt On Me.",
					"Add Route (N1 -> N3 cooldown, 2 charges) - Select two nodes and add a route between them.",
					"Remove Route (N1 -> N3 cooldown, 2 charges) - Select an edge and remove the route, if it doesn’t isolate the node it connects to."],
				"Passives": ["None."]
			},
			{
				"Name":"Discord Manager",
				"Color": "white",
				"Summary":"SK but more memes",
				"Image": "discordmanager.png",
				"Description": "“Your anime dreams can finally be realized, Discord Manager.”",
				"Win Condition": "Create an anime Vtuber waifu, survive and don’t get arrested.",
				"Day": ["Create Waifu - Try to upload your dream waifu into a virtual AI Vtuber. Low success chance. If this succeeds, you just need to survive.",
					"Punjabi Scripts - Select a white node and attempt to hack it with low hack chance. Leaves a log. If successful, Create Waifu becomes more likely to succeed.",
					"Reroute Efforts (3 charges) - Reroute the target operative's connections to work on your waifu AI. Increases the success chance of Create Waifu. Cuts off the connection of the operative like Jam Network and prevents day actions on the topology. Cannot be used on the same target more than once."],
				"Night": ["Experienced Hiding (3 charges) - Move your hideout, protecting yourself unless you are occupied.",
					"Get Inspiration - Search the internet for \"Inspiration\" for your waifu AI. Increases the success chance of Create Waifu succeeding.",
					"Midnight Moderation (N1 -> N4 cooldown, 2 charges) - Prevent the target from voting the following day and night. Their secrets increase the success chance of Create Waifu.",
					"Purge Hard Drive - No Dirt On Me turns on, but Create Waifu will have a much lower chance to succeed."],
				"Passives": ["Man of Culture - Turned off by using the skill Purge Hard Drive. You have a stash of CP equal to a full terabyte. You are arrestable. agents gain class type intel on an operative of their choice upon your arrest.",
					"No Dirt On Me (Off) - You are unarrestable unless framed. Off until you use Purge Hard Drive."]
			}
		]
	},
	{
		"Neutral Utility": 
		[
			{
				"Name":"W.P.P. Member",
				"Color": "white",
				"Summary":"SK with more steps and arrest visitors",
				"Image": "wppmember.png",
				"Description": "“Plenty of people want you out of the picture, W.P.P. Member.”",
				"Win Condition": "Survive and don’t get arrested, or win with the chosen faction.",
				"Day": ["Hack Target (Low) - Select a white node and attempt to hack it. Leaves a log.",
					"Denial of Service (2 charges) - Select a green or white node and block all connections to the node this day. Do not leave a log.",
					"Desperate Measures (1 charge) - Turn into a Prodigy. If an agent is in the player’s lineup, this is disabled."],
				"Night": ["Contact Law Enforcement (N1 -> N3 cooldown, 3 charges) - Select a target operative. If they are an agent, learn their role, they will learn yours. Goes through cover or frames. Visit them.",
					"Contact W.P.P. (N1 -> N4 cooldown, 2 charges) - If any operative visits you tonight, they will be arrested. Dodge any attempts to arrest you.",
					"Old Friends (3 charges) - Select a target operative. If they are a Netsec member, you and agents will learn their role. Goes through cover or frames. Visit them.",
					"Runaway Operative (1 charge) - Turn into a mole of your choice. If Netsec is in the player’s lineup, this is disabled."],
				"Passives": ["On the Run - If you are murdered (not by vote), the Operation Leader will learn the identity of two Netsec members that are not owned by that player. Goes through cover or frames."]
			},
			{
				"Name":"Former Bodyguard",
				"Color": "white",
				"Summary":"Gains bait, angel",
				"Image": "formerbodyguard.png",
				"Description": "“You were once a bodyguard of a high-profile agency, but after an assassination on your target’s life succeeded, you went to Netsec, Former Bodyguard.”",
				"Win Condition": "Protect 3 Netsec targets, or protect a target from arrest or murder. (This can include blocking an arrest or murder attempt with Bouncer). Or win as an enforcer.",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Bait Law Enforcement (D1 -> D3 cooldown) - Select a target operative, inform agents that the target is one working for Netsec. (Leaves the same message as Bounty Hunter’s Spill the Beans).",
					"Join the Force (1 charge) - Become an enforcer, only usable at Day 4 or later."],
				"Night": ["Escort - Escort a target operative, protecting the operative from arrests and murders. Arrest attempts will arrest this operative instead, and anyone attempting to murder the protected operative will be killed. Visit and occupy them.",
					"Bouncer (N1 -> N3 cooldown, 2 charges) - Select a target operative. You will visit and occupy them like a Midnight Meet, and anyone who visits them will be occupied, like a Misdirection."],
				"Passives": ["Bulletproof Vest - Avoid the first arrest or murder attempt on you. After being arrested or murder attempted, become immune to occupation."]
			},
			{
				"Name":"Insane Drug Dealer",
				"Color": "white",
				"Summary":"Baguette’s Walter role, needs to do a few different tasks and overdose some people",
				"Image": "drugdealer.png",
				"Description": "This role is supposed to be unique, depending on the ruleset.<br>“Chemistry teacher by day, ruthless kingpin by night, this Opsec is the perfect chance for a huge score, Insane Drug Dealer.”",
				"Win Condition": "End the game with 2 shipments and overdose 2 operatives of your choice.",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Prepare Drugs - Gives two charges of drugs of choice to use at night, including Shipments.",
					"Enforce Alibi - Act like a chemistry teacher tonight, pretending to have done nothing to action checking investigative abilities."],
				"Night": ["Sell Meth (1 charge) - Select a target operative. Sell them Methamphetamine and make them immune to occupation for this turn. Visit them.",
					"Sell Adderall (1 charge) - Select a target operative. Sell them Adderall, and give them one extra action in the day. Visit them.",
					"Sell Cocaine (1 charge) - Select a target operative. Sell them Cocaine, and make them dodge arrests or murder attempts for this turn (that are not guaranteed murders). Visit them.",
					"Sell Shipment (0 charges) - Sell a shipment.",
					"Plant Drug (2 charges) - Select a target operative. Plant a drug on the operative and remove No Dirt on Me."],
				"Passives": ["Overdose - If you give someone drugs three times in a row, they overdose and immediately die.",
					"Bulk Selling - Do two actions per night.",
					"Rent Free - Avoid the first arrest attempt and murder attempt on you."]
			},
			{
				"Name":"Retired Hacker",
				"Color": "white",
				"Summary":"Help 5 operatives hack or not by adjusting their hack chances",
				"Image": "hackinginstructor.png",
				"Description": "“You used to be a major hacker for Netsec, but you have endured severe health problems that forces you to merely teach others the way of the hack, Retired Hacker.”",
				"Win Condition": "Increase or decrease 5 different operatives' hack chances.",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log. (You know how to hack, but you don’t want to do it unless absolutely necessary.)",
					"Weaken Connection (2 charges) - Select a target operative, lower their hack chance one stage down permanently.",
					"Sabotage Internet of Things - Select a target operative and lower their hack chance this phase."],
				"Night": ["Pair Programming (1 charge) - Select a target operative, their hacking chance permanently increases by one stage. Visit them.",
					"Advisor (N1 -> N3 cooldown) - Select a target operative, their hacking chance temporarily increases by one stage. Visit them.",
					"False Advice (N1 -> N3 cooldown) - Select a target operative and lower their hack chance by one stage. Visit them.",
					"Gift Broken Computer (2 charges) - Select a target operative. Permanently grants target operative Very Low hack chance, even if it lowers their hack chance. Visit them."],
				"Passives": ["Old Guard - If asked the right question, they will receive a Very High hacking chance result."]
			},
			{
				"Name":"Disconnected Paragon Operative",
				"Color": "white",
				"Summary":"Wins only if Paragon wins, doesn’t spawn with Paragon",
				"Image": "disconnectedparagonoperative.png",
				"Description": "Cannot be spawned with Paragon themselves.<br>“An enigma of mystery, you are here for unknown reasons, Disconnected Paragon Operative.”",
				"Win Condition": "Ensure Paragon wins.",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Hack Target (Low) - Select a white node and attempt to hack it. Leaves a log.",
					"Rerouted Denial of Service (2 charges) - Select a green or white node and block all connections to the node this day. Select a target operative to make this show up as the operative who used the denial of service with Wireshark. Do not leave a log."],
				"Night": ["Paragon Secret Codeword - Select a target operative, if a target is Paragon, let you know their role. Goes through cover or frames. Visit them.",
					"Experienced Hiding (3 charges) - Move your hideout, protecting yourself unless you are occupied.",
					"Plant Agent Documentation (3 charges) - Select a target operative. If the operative is doxxed this round, they will be seen as an agent. If the operative is specialization reviewed, they will be seen as special. If the operative is asked the right question, they will be seen as unable to hack. If the operative is speech analyzed, they will be seen as unable to win with anyone. Visit them."],
				"Passives": ["Paragon Special Squad - You are disconnected from the original Paragon operatives, as you are here to make sure to be an undercover operative.",
					"Paragon Ties - Any doxx attempts on you doxx you as Paragon."]
			},
			{
				"Name":"Abandoned Agent",
				"Color": "white",
				"Summary":"Wins only if Agent wins, doesn’t spawn with Agent (or W3C, or NK, or Netsec)",
				"Image": "abandonedagent.png",
				"Description": "“You are an agent recruit, but for some reason the agent recruiting process didn’t go as planned, connect back to agents again, Abandoned Agent.”",
				"Win Condition": "Ensure agents win.",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Wireshark (D1 -> D4 cooldown) - Tells you the name of any operative that did a Denial of Service.",
					"Emergency Repairs (1 charge) - Select a green or white node and block all connections to the node this day. Lets you know if a rollback was used on the node. Do not leave a log.",
					"Upload Fake Intel (1 charge) - Select a green node and upload intel that is downloadable by others. You can write what intel you want to leave. Leaves a log."],
				"Night": ["For the Cause (N1 -> N4 cooldown, 2 charges) - Find out if the target operative is a mole. Do not go through frames or cover. Visit them.",
					"Contact Law Enforcement (N1 -> N3 cooldown, 3 charges) - Select a target operative. If they are an agent, learn their role, they will learn yours. Goes through cover or frames. Visit them.",
					"Interrogate (3 charges) - Select a target operative and occupy them. The host will ask them for their logs, giving you what they send."],
				"Passives": ["Agent Scum - Any doxx attempts on you doxx you as Agent.",
					"Blackmailed Informant - Any time Informant is used by an Agent Leader, or an operative uses Deductive Reasoning, you will get information that agents get. Do not go through frames or cover.",
					"No Dirt On Me - You are unarrestable unless framed."]
			}
		]
	},
	{
		"Neutral Social": 
		[
			{
				"Name":"Corrupt Detective",
				"Color": "white",
				"Summary":"Executioner",
				"Image": "corruptdetective.png",
				"Description": "This role is supposed to be unique, depending on the ruleset.<br>“The Operation Leader wants you to solve this case, but he won’t know who is truly a traitor, Corrupt Detective.”",
				"Win Condition": "Frame two operatives that aren’t yours and get them both voted out.",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Upload Fake Intel (1 charge) - Select a green node and upload intel that is downloadable by others. You can write what intel you want to leave. Leaves a log.",
					"Jam Network (2 charges) - Select a target operative and disable all day actions related to the topology done by them."],
				"Night": ["Paid Frame (N1 -> N3 cooldown) - Select a target operative. Change their role to be anything you want, which they will then have all intel abilities follow that frame. Removes No Dirt On Me and can be used on Agents, making them arrestable. Visit them.",
					"Follow (2 charges) - Select a target operative and follow them, visiting them and checking if they left their hideout and met anyone. If they were occupied, you’d only know that they could not leave their hideout.",
					"Throw Under the Bus (2 charges) - Select a target operative. All skills used on you will be used on the target operative."],
				"Passives": ["Agent Scum - Any doxx attempts on you doxx you as Agent.",
					"Insurance - If you are voted out, the Operation Leader’s identity is revealed globally."]
			},
			{
				"Name":"Waxmart Manager",
				"Color": "white",
				"Summary":"wins based on X’s win condition",
				"Image": "waxmartmanager.png",
				"Description": "This role is supposed to be unique, depending on the ruleset.<br>“You were surprised when an old friend threatened you to help them or die, as they wanted your Waxmart connections to steal electronic equipment, help your friend, Waxmart Manager.”",
				"Win Condition": "You are assigned a Netsec or mole operative to win with, make sure they win.",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Denial of Service (2 charges) - Select a green or white node and block all connections to the node this day. Do not leave a log.",
					"Computer Hotwiring (2 charges) - Make all hack chances increased by one stage today.",
					"Rummage Customer Info - Instead of downloading, you can try rummaging customer info. Goes through cover or frames. (Download Intel without leaving a connection log.)"],
				"Night": ["DM Sliding (1 charge) - Check your “friend”, target operative’s exact role through social media. Do not visit them.",
					"Fake 911 Call (1 charge) - Select a target operative. They will be attempted to be arrested. Visit them.",
					"Move Hideout (1 charge) - Move your hideout, protecting yourself unless you are occupied.",
					"Wiretap (N1 -> N4 cooldown) - Select a target operative. Check the operative’s outgoing and ingoing communications to check for operatives that potentially are of the same owner. Gives three potential operatives that could be linked to the target operative. Visit them.",
					"Wipe (1 charge) - Select a white node. Remove all connection logs and intel to the node."],
				"Passives": ["Friend in Need - Know who your “friend”, target operative is and know their faction."]
			},
			{
				"Name":"Corrupt Lawyer",
				"Color": "white",
				"Summary":"Lawyer, make sure X wins",
				"Image": "corruptlawyer.png",
				"Description": "This role is supposed to be unique, depending on the ruleset.<br>“Cash in and protect the operative that hired you, Corrupt Lawyer.”",
				"Win Condition": "Make sure the target operative wins. (Random operative).",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Act as Prosecution - Select a target operative. The operative will have an extra vote (+1) against them in the next phase, not shown to the Opsec.",
					"Act as Defense - Select a target operative. The operative will have an extra vote (-1) with them next phase, not shown to the Opsec.",
					"Objection! - Force someone to vote for someone of your choice.",
					"Cryptocurrency Trading - Trade currency for some intel. Instead of downloading, you can try to get intel through buying and selling crypto on the market. Do not go through frames or cover. (Download Intel without leaving a connection log.)"],
				"Night": ["Act as Prosecution - Select a target operative. The operative will have an extra vote (+1) against them in the next phase, not shown to the Opsec.",
					"Act as Defense - Select a target operative. The operative will have an extra vote (-1) with them next phase, not shown to the Opsec.",
					"Objection! - Force someone to vote for someone of your choice.",
					"Paid Frame (N1 -> N3 cooldown) - Select a target operative. Change their role to be anything you want, which they will then have all intel abilities follow that frame. Removes No Dirt On Me and can be used on Agents, making them arrestable. Visit them."],
				"Passives": ["Loyal to the End - If your target is voted out, die. If your target is murdered or arrested, you will randomly get another target that the owner of the first operative has to win with.",
					"No Dirt On Me - You are unarrestable unless framed."]
			},
			{
				"Name":"Reminiscing Amnesiac",
				"Color": "white",
				"Summary":"Amnesiac",
				"Image": "scriptkiddie.png",
				"Description": "“You forgot who you were, but maybe grave digging and checking old operative hideouts will remind you, Reminiscing Amnesiac.”",
				"Win Condition": "Steal a dead or arrested operative’s identity and complete their win condition.",
				"Day": ["Create Hideout (D1 -> D4 cooldown, 2 charges) - Grants you one charge of Move Hideout.",
					"Unskilled Attack - Select a node, green or white. Leaves a log."],
				"Night": ["Grave Digger - Select a target dead or arrested operative and check their hideouts. You will know their true role. You can then select whether or not you want to become this role.",
					"Move Hideout (1 charge) - Move your hideout, protecting yourself unless you are occupied."],
				"Passives": ["Forgetful - You forgot how to vote. Make sure to find out who you are before attempting to do something in the Opsec."]
			},
			{
				"Name":"King of Trolls",
				"Color": "white",
				"Summary":"Jester",
				"Image": "kingoftrolls.png",
				"Description": "This role is supposed to be unique, depending on the ruleset.<br>“We do a little trolling, King of Trolls.”",
				"Win Condition": "Get yourself voted out.",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Hack Target (Moderate) - Select a white node and attempt to hack it. Leaves a log.",
					"Denial of Service (2 charges) - Select a green or white node and block all connections to the node this day. Do not leave a log.",
					"Alter Logs (D1 -> D3 cooldown) - Select a white or green node and either leave a singular fake connection log of one operative, or leave a few random connection logs.",
					"Impersonate (1 charge) - Permanently rename your operative to whatever name you want. If you name it the same as another operative, targeting that operative will randomly target either operative of the same name.",
					"Troll Operative (2 charges) - Permanently rename another operative to whatever name you want. If you name it the same as another operative, targeting that operative will randomly target either operative of the same name."],
				"Night": ["Experienced Hiding (3 charges) - Move your hideout, protecting yourself unless you are occupied.",
					"Spook - Select a target operative and visit them. Does not gain any intel.",
					"Midnight Meet (N1 -> N3 cooldown) - Select a target operative. Visit and occupy them, talking about the hack. Do not reveal yourself to them."],
				"Passives": ["Hidden Connections - If you are murdered, the player that killed you will be arrested. If you are voted out, one selected operative that voted you will be arrested."]
			},
			{
				"Name":"Wildcard",
				"Color": "white",
				"Summary":"Choose win condition from host (suggested by Egg)",
				"Image": "wildcard.png",
				"Description": "“You are a joker, you only play by your own rules, Wildcard.”",
				"Win Condition": "Set your win condition by asking if it is ok with the host. Complete this win condition.",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Hack Target (Moderate) - Select a white node and attempt to hack it. Leaves a log.",
					"Download Intel - Select a green node and attempt to download from it. If there is intel, and you download and remove it first, you will get class intel, target node, or faction intel. Do not go through frames or cover. Leaves a log.",
					"Impersonate (1 charge) - Permanently rename your operative to whatever name you want. If you name it the same as another operative, targeting that operative will randomly target either operative of the same name.",
					"Choose Your Own Adventure (Pick 1)<br>=======================================================================<br>Denial of Service (2 charges) - Select a green or white node and block all connections to the node this day. Do not leave a log.",
					"Background Search (D1 -> D3 cooldown) - Check a target operative’s background. You’ll be given a (non-unique) random skill that they have, either day or night. Do not go through frames or cover.",
					"Troll Operative (2 charges) - Permanently rename another operative to whatever name you want. If you name it the same as another operative, targeting that operative will randomly target either operative of the same name."],
				"Night": ["Midnight Meet (N1 -> N3 cooldown) - Select a target operative. Visit and occupy them, talking about the hack. Do not reveal yourself to them.",
					"Follow (2 charges) - Select a target operative and follow them, visiting them and checking if they left their hideout and met anyone. If they were occupied, you’d only know that they could not leave their hideout.",
					"Disorganized Murder - Select an operative and attempt to murder them. Visit the target.",
					"Citizen’s Arrest (N1 -> N3 cooldown, 3 charges) - Select a target operative and arrest them. Visit them.",
					"Choose Your Own Adventure (Pick 1)<br>=======================================================================<br>Interrogate (3 charges) - Select a target operative and occupy them. The host will ask them for their logs, giving you what they send.",
					"Frame (N1 -> N3 cooldown, 2 charges) - Select a target operative. Change their role to be anything you want, which they will then have all intel abilities follow that frame. Removes No Dirt On Me and can be used on Agents, making them arrestable. Visit them.",
					"Throw Under the Bus (2 charges) - Select a target operative. All skills used on you will be used on the target operative."],
				"Passives": ["Rent Free - Avoid the first arrest attempt and murder attempt on you.",
					"Choose Your Own Adventure - Pick an extra day ability and an extra night ability of your choice between the three options for both."]
			}
		]
	},
	{
		"The Really Bad Guys": 
		[
			{
				"Name":"Neutral Killing",
				"Color": "red",
				"Summary":"Powerful interlopers that have incredible power but are solo for the entire game",
				"Image": "neutralkilling.png",
				"Description": "“I’m here to kill everyone, you all wronged me and I will get my revenge.”",
				"Win Condition": "Eliminate ALL hostile units (Netsec, Agents, and W3C).<br><br>These roles have significant power, given that they are basically entirely alone. They are singly stronger than most roles in the game. All these roles are designed to be unique, depending on the ruleset.",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"Neutral Killing": 
		[
			{
				"Name":"Sociopath Leader",
				"Color": "red",
				"Summary":"killer OL",
				"Image": "sociopath.png",
				"Description": "This role is unique (one Operation Leader should spawn).<br>“It’s time to eliminate every last person involved in the Opsec, Sociopath Leader.”",
				"Win Condition": "Eliminate ALL hostile units (Netsec, Agents, and W3C).",
				"Day": ["Hack Target (High) - Select a white node and attempt to hack it. Leaves a log.",
					"Give Root Access (1 charge) - Select an operative to give root to. They become any of Operation Leader, Blackmailed Leader, Sociopath Leader, W3C Operation Leader, Paragon Operation Leader, or are simply an agent, neutral, Paragon Leader, or W3C Leader with access to the special channel. A Neutral Leader can only spawn in."],
				"Night": ["Murder with Goons - Select an operative and murder them. Cannot be dodged in any way, and cannot be occupied. Occupies the target.",
					"Fake Emergency Extraction (N1 -> N3 cooldown, 3 charges) - Select an operative to fake escort, does not occupy them and doesn’t actually do anything except leaving escort feedback."],
				"Passives": ["Authority - You have two votes. Only the starting Operation Leader role has this passive.",
					"Covert Broadcast - You should be given access to talk to all players in a specialized channel (global Opsec info).",
					"Raid Boss - Avoid the first two arrest or murder attempts on you.",
					"Operation Leader - You are one of the leading roles and should spawn every operation."]
			},
			{
				"Name":"Rogue Mastermind",
				"Color": "red",
				"Summary":"Killer around infected/hacker priority",
				"Image": "roguemastermind.png",
				"Description": "This role is supposed to be unique, depending on the ruleset.<br>“Project Havoc is waiting for your careful execution, Rogue Mastermind.”",
				"Win Condition": "Eliminate ALL hostile units (Netsec, Agents, and W3C).",
				"Day": ["Hack Target (Very High) - Select a white node and attempt to hack it. Leaves a log.",
					"Application Layer Attack (2 charges) - Select a green or white node and block all connections to the node this day. Up to 2 random operatives who targeted this node today will be infected.",
					"Worm Attack - Select a target operative that has been infected. You can see the operative’s action space and choose what that operative does today. Cannot repeatedly use this on the same operative.",
					"Activate Project Havoc (D1 -> D3 cooldown, 2 charges) - Kill all infected operatives."],
				"Night": ["Infect Operative (N1 -> N3 cooldown) - Select a target operative. Visit and occupy them, talking about the hack and infecting their hardware. Do not reveal yourself to them. (Works like Midnight Meet).",
					"Expunge Hacker - Select a green node and kill the operative that hacked the node.",
					"Activate Project Havoc (N1 -> N3 cooldown, 2 charges) - Kill all infected operatives."],
				"Passives": ["Mastermind’s Entourage - Rogue Mastermind is designed in which the other N operatives that you own are all automatically thrown under the bus as soon as any arrest or murder attempts happen. By default, Rogue Mastermind should have the other N operatives simply be holograms of himself, shielding all attacks for him with the Throw Under the Bus message and revealing a “Rogue Mastermind” hologram.",
					"Hardcoded Routing Procedures - You will gain access to the exact role of all infected operatives.",
					"Mastermind’s Cover - You can select any role to cover yourself, which lasts until Day 4.",
					"Raid Boss - Avoid the first two arrest or murder attempts on you. (Either use this passive or Psychopath’s Fake Operatives)."]
			},
			{
				"Name":"F/A-18 Super Hornet Pilot",
				"Color": "red",
				"Summary":"Loud killer that leaks lots of information",
				"Image": "fa18superhornetpilot.png",
				"Description": "This role is supposed to be unique, depending on the ruleset.<br>“Time to take the skies and light the fires, F/A-18 Super Hornet Pilot.”",
				"Win Condition": "Eliminate ALL hostile units (Netsec, Agents, and W3C).",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Rearm Missiles (2 charges) - Gain a charge of Double Strafe.",
					"Electronic Countermeasures (1 charge) - Next phase will not announce any movement globally except that you have used Electronic Countermeasures."],
				"Night": ["Strafe - Select a target operative and murder them and anyone who visits them. Visit them and go through all defensive abilities. It is globally announced that a Jet Fighter is seen going to the operative’s hideout.",
					"Double Strafe (0 charges) - Select two target operatives and murder them and anyone who visits them. Visit them and go through all defensive abilities. It is globally announced that a Jet Fighter is seen going to one of the operatives’ hideouts.",
					"Fake Flares (2 charges) - Select a target operative and shoot fake flares at them. It is globally announced that a Jet Fighter is seen going to the operative’s hideout.",
					"Fly Over - Select a target operative and fly over them, visiting them and checking if they left their hideout and met anyone. If they were occupied, you’d only know that they could not leave their hideout. It is globally announced that a Jet Fighter is seen going to the operative’s hideout.",
					"Misdirection (1 charge) - Occupy anyone that visits you directly, blocking any attempts to visit, occupy, and kill directly. Does not save you from Raids, Stings, and other indirect methods of killing this operative. (Will announce that the Jet Fighter is staying in his hideout)."],
				"Passives": ["To the Skies - You are immune to occupation at night.",
					"Rare Sighting - Every night movement you make will be globally announced.",
					"Raid Boss - Avoid the first two arrest or murder attempts on you."]
			},
			{
				"Name":"Psychopath",
				"Color": "red",
				"Summary":"Possessor",
				"Image": "psychopath.png",
				"Description": "This role is supposed to be unique, depending on the ruleset.<br>“Let’s kill some people for the sake of killing people, Psychopath.”",
				"Win Condition": "Eliminate ALL hostile units (Netsec, Agents, and W3C).",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Background Search (D1 -> D3 cooldown) - Check a target operative’s background. You’ll be given a (non-unique) random skill that they have, either day or night. Do not go through frames or cover.",
					"Impersonate (1 charge) - Permanently rename your operative to whatever name you want. If you name it the same as another operative, targeting that operative will randomly target either operative of the same name."],
				"Night": ["Hold Hostage - Select a target operative and hold their family hostage, visiting and occupying them. The operative will be forced to murder someone of your choice or die. The operative sent to murder the other operative cannot be occupied, and the selected operative will visit the target and murder them. Cannot repeatedly use this on the same operative.",
					"Psychopath’s Murder - Select an operative and murder them. Visit the target and remove their logs and role.",
					"Doxx and Stalk (N1 -> N4 cooldown, 2 charges) - Select a target operative. Do not go through frames or cover. Learn this operative’s faction alignment and visit them."],
				"Passives": ["Psychopath’s Fake Operatives - Psychopath is designed in which the other N operatives that you own are all automatically thrown under the bus as soon as any arrest or murder attempts happen. By default, Psychopath should have the other N operatives simply be test dummies of himself, shielding all attacks for him with the Throw Under the Bus message and revealing a Psychopath test dummy.",
					"Psychopath’s Cover - You can select any role to cover yourself, which lasts until Day 4.",
					"Raid Boss - Avoid the first two arrest or murder attempts on you. (Either use this passive or Psychopath’s Fake Operatives)."]
			},
			{
				"Name":"Bombardier",
				"Color": "red",
				"Summary":"Arsonist",
				"Image": "bombardier.png",
				"Description": "This role is supposed to be unique, depending on the ruleset.<br>“Light the fuse and drop the artillery, Bombardier.”",
				"Win Condition": "Eliminate ALL hostile units (Netsec, Agents, and W3C).",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Plant Fake Info - Decreases hacking chances on a random node."],
				"Night": ["Signal Flare (3 charges) - If you are attempted to be arrested tonight, whoever attempted to arrest you will be announced to you. Will avoid the arrest as an additional charge to Raid Boss.",
					"False Alarm (N1 -> N3 cooldown) - Select a target operative. Occupy the operative without visiting them, as they will be alarmed by the ordnance you launch at their hideout. Gives the same text as Midnight Meet.",
					"Mark Target - Select a target operative and mark their hideout. Visit the target.",
					"KABOOM! - Kill all operatives that have been marked, regardless of defensives."],
				"Passives": ["Raid Boss - Avoid the first two arrest or murder attempts on you.",
					"Ground Operative - Specialization is always shown as field ops or utility, you pick."]
			},
			{
				"Name":"Rogue Assassin",
				"Color": "red",
				"Summary":"Evil Guesser",
				"Image": "rogueassassin.png",
				"Description": "This role is supposed to be unique, depending on the ruleset.<br>“You were hired to take care of the problems in this Opsec, but you don’t believe in the cause anymore, Rogue Assassin.”",
				"Win Condition": "Eliminate ALL hostile units (Netsec, Agents, and W3C).",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Hack Target (Low) - Select a white node and attempt to hack it. Leaves a log.",
					"Day Off (D1 -> D3 cooldown) - If you think that the operative getting voted is not someone that should die, don’t kill them. Unfortunately, you gotta get paid, so you have to kill once in a while. If The Assassin has been triggered, this ability is disabled.",
					"Redirect Vote (2 charges) - If you would rather kill someone else, use a charge to kill that other operative instead of the operative getting voted. The other operative must have at least 1 vote.",
					"My Aim is True - Select any number of target operatives and guess all their roles. If you guess right, attempt to shoot the target operative tonight. Removes all frames and covers. Cannot guess more than two of the same role in a single phase. If you fail, remove a charge of your defensive passive. You will know if you guessed right or wrong."],
				"Night": ["Day Off (N1 -> N3 cooldown) - If you think that the operative getting voted is not someone that should die, don’t kill them. Unfortunately, you gotta get paid, so you have to kill once in a while. If The Assassin has been triggered, this ability is disabled.",
					"Redirect Vote (2 charges) - If you would rather kill someone else, use a charge to kill that other operative instead of the operative getting voted. The other operative must have at least 1 vote.",
					"My Aim is True - Select any number of target operatives and guess all their roles. If you guess right, attempt to shoot the target operative tonight. Removes all frames and covers. Cannot guess more than two of the same role in a single phase. If you fail, remove a charge of your defensive passive."],
				"Passives": ["The Assassin - You were hired to be the one to remove threats that are voted out, but you won’t kill yourself. The Operation Leader will hire a new assassin to kill you the next time you are voted out though.",
					"Raid Boss - Avoid the first two arrest or murder attempts on you.",
					"Ground Operative - Specialization is always shown as field ops or social, you pick."]
			},
			{
				"Name":"Underground Ring Fighter",
				"Color": "red",
				"Summary":"Forces people into an arena and fights them",
				"Image": "undergroundringfighter.png",
				"Description": "This role is supposed to be unique, depending on the ruleset.<br>“You were once in a fighting ring, but now that the ring has dissipated, you are here trying to start a new ring, Underground Ring Fighter.”",
				"Win Condition": "Eliminate ALL hostile units (Netsec, Agents, and W3C).",
				"Day": ["Unskilled Attack - Select a node, green or white. Leaves a log.",
					"Bait Law Enforcement (D1 -> D3 cooldown) - Select a target operative, inform agents that the target is one working for Netsec. (Leaves the same message as Bounty Hunter’s Spill the Beans)."],
				"Night": ["Follow (2 charges) - Select a target operative and follow them, visiting them and checking if they left their hideout and met anyone. If they were occupied, you’d only know that they could not leave their hideout.",
					"Smash Hardware (N1 -> N3 cooldown) - Select an operative and disable all day actions related to the topology. Occupies and visits them. (Same as Midnight Meet).",
					"Interrogate (3 charges) - Select a target operative and occupy them. The host will ask them for their logs, giving you what they send.",
					"To the Arena (N1 -> N4 cooldown) - Select up to four operatives. Each of these operatives will be occupied and put in a battle to the death, with only one operative that can make it out. The order of winning the battle is as follows: Neutrals > Agents > W3C > Paragon > Netsec, and Special > Field Ops > Social > Investigative > Utility > Offensive. A tie will result in both dying. Each operative will be occupied and death is not dodgeable. Do not visit them."],
				"Passives": ["Raid Boss - Avoid the first two arrest or murder attempts on you.",
					"Ground Operative - Specialization is always shown as field ops or utility, you pick."]
			},
			{
				"Name":"Italian Mafia",
				"Color": "red",
				"Summary":"Duplicated operatives that all kill",
				"Image": "italianmafia.png",
				"Description": "This role is supposed to be unique, depending on the ruleset.<br>“Astra playing Untrusted is beeg problem, Astra is beeg ritard and make beeg mistake, buy pistal, is beeg problem when beeg ritard get field agent and get beeg sting, Italian Mafia.”<br>(Love you Knu, all of this is satire).",
				"Win Condition": "Eliminate ALL hostile units (Netsec, Agents, and W3C).",
				"Day": ["Beeg Problem - Select a white node and attempt to hack it. However, it is a beeg problem and you can’t hack it. Does absolutely nothing but leaves a log.",
					"Plumb Node - Select a green node and attempt to plumb it. Does absolutely nothing but leaves a log.",
					"Uninstall Untrusted (D1 -> D3 cooldown) - Select a target operative and disable all day actions related to the topology done by them."],
				"Night": ["Italian Greeting - Select a target operative and visit them. Does not gain any intel.",
					"Mafia Meet (N1 -> N4 cooldown) - Select a target operative. Visit and occupy them, talking about the hack. Do not reveal yourself to them.",
					"They Eat Pineapple Pizza (N1 -> N4 cooldown) - Select a target operative. Attempt to kill the operative with local mafia. Visit them."],
				"Passives": ["Together Strong - All of your operatives are designed to be Italian Mafia clones."]
			}
		]
	},
	{
		"The Good Guys": 
		[
			{
				"Name":"Agent",
				"Color": "orange",
				"Summary":"The minority faction that has raw kill power, communication, and information",
				"Image": "agent.png",
				"Description": "“We need to shut this hacking operation down.”",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).<br><br>Agents have more ways to directly arrest and kill than other factions. Agents have access to the topology and a unique chat (ASC).<br><br>Note that Agents cannot win on a single root from Netsec, instead moles turn into a Blackmailed Leader, and other roles turn into an agent with broadcast access and authority.",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"Core Agent Special": 
		[
			{
				"Name":"Blackmailed Leader",
				"Color": "orange",
				"Summary":"Agent OL",
				"Image": "blackmailedleader.png",
				"Description": "This role is unique (one Operation Leader should spawn).<br><br>“Agents caught up to you before the Opsec even started, Blackmailed Leader.”",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": ["Hack Target (High) - Select a white node and attempt to hack it. Leaves a log.",
					"Harden Node (D1 -> D3 cooldown, 2 charges) - Select a white node. Decreasing hacking chances of getting this node. Strongest hacking chance nerf. Leaves a log.",
					"Give Root Access (1 charge) - Select an operative to give root to. They become any of Operation Leader, Blackmailed Leader, Sociopath Leader, W3C Operation Leader, Paragon Operation Leader, or are simply an agent, neutral, Paragon Leader, or W3C Leader with access to the special channel. A Neutral Leader can only spawn in."],
				"Night": ["Move Hideout (1 charge) - Move your hideout, protecting yourself unless you are occupied.",
					"Fake Emergency Extraction (N1 -> N3 cooldown, 3 charges) - Select an operative to fake escort, does not occupy them and doesn’t actually do anything except leaving escort text.",
					"Disorganized Murder - Select an operative and attempt to murder them. Visit the target."],
				"Passives": ["Authority - You have two votes. Only the starting Operation Leader role has this passive.",
					"Covert Broadcast - You should be given access to talk to all players in a specialized channel (global Opsec info).",
					"Operation Leader - You are one of the leading roles and should spawn every operation."]
			},
			{
				"Name":"Runaway Snitch",
				"Color": "orange",
				"Summary":"Way more utility including midnight meet and follow",
				"Image": "runawaysnitch.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"Core Agent Field Operations": 
		[
			{
				"Name":"Field Agent",
				"Color": "orange",
				"Summary":"Can pick extra ability instead of randomed",
				"Image": "fieldagent.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Determined Deputy",
				"Color": "orange",
				"Summary":"More focused on raw arrest power and day arrests",
				"Image": "determineddeputy.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Drone Operator",
				"Color": "orange",
				"Summary":"More focused on delayed watched -> arrest, along with sacrificial gameplay",
				"Image": "droneoperator.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"K-9 Unit",
				"Color": "orange",
				"Summary":"RS’ role, protects team with dog, buffs team",
				"Image": "k9unit.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"Core Agent Investigative": 
		[
			{
				"Name":"Forensic Specialist",
				"Color": "orange",
				"Summary":"More on cameras, framing other players",
				"Image": "forensicspecialist.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Jail Warden",
				"Color": "orange",
				"Summary":"Jailor, can choose arrest or not",
				"Image": "jailwarden.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Cybercrime Investigator",
				"Color": "orange",
				"Summary":"Shark’s role, more intel on FA role",
				"Image": "cybercrimeinvestigator.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Rookie Informant",
				"Color": "orange",
				"Summary":"Stronger combined investigative role",
				"Image": "rookieinformant.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"Core Agent Offensive": 
		[
			{
				"Name":"Agent Leader",
				"Color": "orange",
				"Summary":"replace mole with other abilities",
				"Image": "agentleader.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Cipher Lord",
				"Color": "orange",
				"Summary":"lots of topology and global intel related utility",
				"Image": "cipherlord.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Robocop",
				"Color": "orange",
				"Summary":"Multiple forms, can change between hacking, investigative, and arresting",
				"Image": "robocop.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Expert Whitehat",
				"Color": "orange",
				"Summary":"Stronger Blackhat",
				"Image": "blackhat.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"Core Agent Utility": 
		[
			{
				"Name":"Criminal Psychologist",
				"Color": "orange",
				"Summary":"Has special moles",
				"Image": "criminalpsychologist.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Commissary Officer",
				"Color": "orange",
				"Summary":"Mostly focused on DD’s original kit for utility",
				"Image": "commissaryofficer.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Master Manipulator",
				"Color": "orange",
				"Summary":"Lots of control/utility to control other operatives not owned by you",
				"Image": "mastermanipulator.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Police Chief",
				"Color": "orange",
				"Summary":"Multiple actions at night, more utility focused",
				"Image": "policechief.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Animal Tamer",
				"Color": "orange",
				"Summary":"Uses animals as utility, similar to K-9 Unit",
				"Image": "animaltamer.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"Core Agent Social": 
		[
			{
				"Name":"District Attorney",
				"Color": "orange",
				"Summary":"Hacking Advocate but for agent, controls vote",
				"Image": "districtattorney.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Vigilante Decipherer",
				"Color": "orange",
				"Summary":"Evil Guesser, guesses roles to arrest",
				"Image": "vigilantedecipherer.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Elusive Framer",
				"Color": "orange",
				"Summary":"Frames and uses lynch to kill people",
				"Image": "elusiveframer.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"Mole Agent Field Operations": 
		[
			{
				"Name":"Agent Enforcer",
				"Color": "orange",
				"Summary":"fake escort/kill pressure",
				"Image": "enforcer.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Agent CCTV Specialist",
				"Color": "orange",
				"Summary":"cameras",
				"Image": "cctvspecialist.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Agent Hardware Hacker",
				"Color": "orange",
				"Summary":"disable hardware/isp",
				"Image": "hardwarehacker.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Specialist",
				"Color": "orange",
				"Summary":"Crim Psych fops mole",
				"Image": "specialist.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"Mole Agent Investigative": 
		[
			{
				"Name":"Agent Data Scientist",
				"Color": "orange",
				"Summary":"can change intel to your liking",
				"Image": "analyst.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Agent Social Engineer",
				"Color": "orange",
				"Summary":"defensive mole with frame",
				"Image": "socialengineer.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Agent Ethical Hacker",
				"Color": "orange",
				"Summary":"Plant agent docs and investigative abilities",
				"Image": "hacknethacker.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Initiator",
				"Color": "orange",
				"Summary":"Crim Psych invest mole",
				"Image": "initiator.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"Mole Agent Offensive": 
		[
			{
				"Name":"Whitehat",
				"Color": "orange",
				"Summary":"high hack chance",
				"Image": "blackhat.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Agent Network Specialist",
				"Color": "orange",
				"Summary":"Block denial of service",
				"Image": "networkspecialist.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Agent Network Architect",
				"Color": "orange",
				"Summary":"Add and remove routes",
				"Image": "networkarchitect.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Operator",
				"Color": "orange",
				"Summary":"Crim Psych offensive mole",
				"Image": "operator.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"Mole Agent Utility": 
		[
			{
				"Name":"Agent Company Man",
				"Color": "orange",
				"Summary":"Wiretap is back on field ops mole, setup",
				"Image": "insidemanassistant.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Agent Graph Theorist",
				"Color": "orange",
				"Summary":"know where downloadable intel is overall",
				"Image": "graphtheorist.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Agent Database Manager",
				"Color": "orange",
				"Summary":"replace laptops and servers with each other",
				"Image": "agentdatabasemanager.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"Mole Agent Social": 
		[
			{
				"Name":"Agent Amateur Investigator",
				"Color": "orange",
				"Summary":"doxxed neutral, mostly intel",
				"Image": "amateurinvestigator.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Agent Technical Recruiter",
				"Color": "orange",
				"Summary":"Mostly new, but has Final Gambit, can also control votes",
				"Image": "technicalrecruiter.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"The Really Really Bad Guys": 
		[
			{
				"Name":"W3C",
				"Color": "magenta",
				"Summary":"The minority faction that has indirect kill power and scale to become stronger later",
				"Image": "w3c.png",
				"Description": "“We are here to get rid of NETSEC scum. Let’s get rid of these guys, and let’s get rid of agents or we’ll have problems later.”",
				"Win Condition": "Eliminate ALL hostile units (Netsec, Agent, and Neutral Killing).<br><br>Main difference from Agent is that Agent has more direct ways of killing (singular killer/FA usually), whereas W3C needs to kill sporadically using specific niche ways to kill. W3C also doesn’t have topology access, but still maintains a connected chat. W3C gains more power the less operatives they have, or gains power with more kills.",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"W3C Special": 
		[
			{
				"Name":"W3C Operation Leader",
				"Color": "magenta",
				"Summary":"W3C OL, power through sacrificing",
				"Image": "operationleader.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, Agent, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},			
			{
				"Name":"W3C Leader",
				"Color": "magenta",
				"Summary":"powerful role that gains power off of sacrificing",
				"Image": "w3cleader.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, Agent, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"W3C Field Operations": 
		[
			{
				"Name":"W3C Enforcer",
				"Color": "magenta",
				"Summary":"killing and defensive",
				"Image": "enforcer.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, Agent, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},		
			{
				"Name":"W3C Blackmailer",
				"Color": "magenta",
				"Summary":"blackmail focused, has kill",
				"Image": "w3cblackmailer.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, Agent, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"W3C Investigative": 
		[
			{
				"Name":"W3C Stalker",
				"Color": "magenta",
				"Summary":"typical investigative",
				"Image": "w3cstalker.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, Agent, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"W3C Forger",
				"Color": "magenta",
				"Summary":"frame heavy, kill later",
				"Image": "w3cforger.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, Agent, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"W3C Ambusher",
				"Color": "magenta",
				"Summary":"set up traps and sell illicit arms",
				"Image": "w3cambusher.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, Agent, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"W3C Offensive": 
		[
			{
				"Name":"W3C Blackhat",
				"Color": "magenta",
				"Summary":"hack heavy, firewall and other actions",
				"Image": "blackhat.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, Agent, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"W3C Disruptor",
				"Color": "magenta",
				"Summary":"pull people and hack, kill",
				"Image": "w3cdisruptor.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, Agent, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"W3C Graph Theorist",
				"Color": "magenta",
				"Summary":"predict next nodes and intel, mass occupation",
				"Image": "graphtheorist.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, Agent, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"W3C Utility": 
		[
			{
				"Name":"W3C Lab Technician",
				"Color": "magenta",
				"Summary":"drug dealer, buff others",
				"Image": "w3clabtechnician.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, Agent, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"W3C Insider",
				"Color": "magenta",
				"Summary":"server/laptop replacer, has possible kill power with using dead operative abilities and other operative abilities",
				"Image": "insidemanassistant.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, Agent, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"W3C Janitor",
				"Color": "magenta",
				"Summary":"clean up and killing",
				"Image": "maintenanceman.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, Agent, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"W3C Social": 
		[
			{
				"Name":"W3C Technical Recruiter",
				"Color": "magenta",
				"Summary":"vote control, paid assassin later",
				"Image": "technicalrecruiter.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, W3C, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"W3C Assassin",
				"Color": "magenta",
				"Summary":"evil guesser, murder later",
				"Image": "w3cassassin.png",
				"Description": "",
				"Win Condition": "Eliminate ALL hostile units (Netsec, Agent, and Neutral Killing).",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"The GREAT Guys": 
		[
			{
				"Name":"Paragon",
				"Color": "cyan",
				"Summary":"A group of interlopers that want to play with the minority faction to win",
				"Image": "paragon.png",
				"Description": "“We’re here to establish a presence and assert dominance on the dark web as the biggest hacking team.”",
				"Win Condition": "Make all factions have only 50% of their operatives, including Netsec, W3C, and agents.<br><br>Paragon is sorta a neutral faction that needs to kill off half of every faction. Can win with any faction and will lose if all other factions besides one lose before they win. This faction should spawn with SOME kill power, not necessarily a ton, but enough to be able to force a 50% on all other factions. Paragon will be notified if a faction reaches under 50% of their total operatives.",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"Paragon Special": 
		[
			{
				"Name":"Paragon Operation Leader",
				"Color": "cyan",
				"Summary":"Paragon OL",
				"Image": "operationleader.png",
				"Description": "",
				"Win Condition": "Make all factions have only 50% of their operatives, including Netsec, W3C, and agents.",
				"Day": [],
				"Night": [],
				"Passives": []
			},			
			{
				"Name":"Paragon Leader",
				"Color": "cyan",
				"Summary":"Paragon AL, kill power",
				"Image": "paragonleader.png",
				"Description": "",
				"Win Condition": "Make all factions have only 50% of their operatives, including Netsec, W3C, and agents.",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"Paragon Field Operations": 
		[
			{
				"Name":"Paragon Scout",
				"Color": "cyan",
				"Summary":"uses other operative abilities and uses abilities of arrested operative",
				"Image": "paragonscout.png",
				"Description": "",
				"Win Condition": "Make all factions have only 50% of their operatives, including Netsec, W3C, and agents.",
				"Day": [],
				"Night": [],
				"Passives": []
			},	
			{
				"Name":"Paragon Ex-Mercenary",
				"Color": "cyan",
				"Summary":"sell illicit arms",
				"Image": "paragonexmercenary.png",
				"Description": "",
				"Win Condition": "Make all factions have only 50% of their operatives, including Netsec, W3C, and agents.",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"Paragon Investigative": 
		[
			{
				"Name":"Paragon Journalist",
				"Color": "cyan",
				"Summary":"fake ddos and rollback",
				"Image": "paragonjournalist.png",
				"Description": "",
				"Win Condition": "Make all factions have only 50% of their operatives, including Netsec, W3C, and agents.",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Paragon Informant",
				"Color": "cyan",
				"Summary":"agent intel and snitch",
				"Image": "rookieinformant.png",
				"Description": "",
				"Win Condition": "Make all factions have only 50% of their operatives, including Netsec, W3C, and agents.",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"Paragon Offensive": 
		[
			{
				"Name":"Paragon Prodigy",
				"Color": "cyan",
				"Summary":"track hackers to arrest",
				"Image": "prodigy.png",
				"Description": "",
				"Win Condition": "Make all factions have only 50% of their operatives, including Netsec, W3C, and agents.",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Paragon Security Specialist",
				"Color": "cyan",
				"Summary":"defend the topology",
				"Image": "agentdatabasemanager.png",
				"Description": "",
				"Win Condition": "Make all factions have only 50% of their operatives, including Netsec, W3C, and agents.",
				"Day": [],
				"Night": [],
				"Passives": []
			},
			{
				"Name":"Paragon Search Engine Optimizer",
				"Color": "cyan",
				"Summary":"buff others by giving day charges of abilities",
				"Image": "searchengineoptimizer.png",
				"Description": "",
				"Win Condition": "Make all factions have only 50% of their operatives, including Netsec, W3C, and agents.",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"Paragon Utility": 
		[
			{
				"Name":"Paragon Head of Personnel",
				"Color": "cyan",
				"Summary":"buff others by giving night charges of abilities",
				"Image": "shamedjournalist.png",
				"Description": "",
				"Win Condition": "Make all factions have only 50% of their operatives, including Netsec, W3C, and agents.",
				"Day": [],
				"Night": [],
				"Passives": []
			},			
			{
				"Name":"Paragon Ex-Mole",
				"Color": "cyan",
				"Summary":"utility around agent doxx and mole fake claim",
				"Image": "specialist.png",
				"Description": "",
				"Win Condition": "Make all factions have only 50% of their operatives, including Netsec, W3C, and agents.",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
	{
		"Paragon Social": 
		[
			{
				"Name":"Paragon Assassin",
				"Color": "cyan",
				"Summary":"vote sacrifice and some kill power",
				"Image": "paragonassassin.png",
				"Description": "",
				"Win Condition": "Make all factions have only 50% of their operatives, including Netsec, W3C, and agents.",
				"Day": [],
				"Night": [],
				"Passives": []
			}
		]
	},
];