chars = 
[
	{
		"Arcana":
		{
			"Description": "Not done yet",
			"CharList":
			[
			]
		}
	},
	{
		"Assault Rifle (AR)":
		{
			"Description": "Late game carries that are usually focused on basic attacks or basic attack weaving, needing to survive till late game to do their job.",
			"CharList":
			[
				{
					"Name": "Aya",
					"Summary": "A police officer with serious firepower and a sense of justice in putting down criminals.",
					"Color": "white",
					"Main": false,
					"Image": "erwimages/chars/Aya.png",
					"Lore": "For my light, for my justice.<br><br>Aya was born with an innate longing for justice, and employed this longing to become a police officer. However, her world and confidence in her job was shaken after her family were victims of a murder case.<br><br>She became obsessed with her vision of justice, beginning to think that only she was able to bring justice to the world.<br><br>Aya grew repulsed at the sight of corpses. When her job requires the occasional inspection of an animal corpse, it takes a toll on her psyche.<br><br>She has a brother named Suzuki Hikaru, who lost both of his legs.",
					"Description": "Assault Rifle Aya wants to hold a zone down and constantly apply sustain damage on other players. Aya has some intel abilities to know who to avoid. This weapon is very susceptible to blinds.",
					"Role": "Ranger",
					"Difficulty": "Easy",
					"Power Spike": "Mid-Late Game",
					"HP": "100",
					"Basic Attack": "10 + (attack power) damage",
					"Basic Attack Cooldown": "1/2th day cooldown",
					"Level 1": ["Double Shot (1/2th day cooldown) - Shoot someone, dealing 5 damage twice to a target.",
						"Steady Shot (1 day cooldown) - Shoot someone multiple times, dealing 5 damage 3 times to a target in 1/10th day intervals.",
						"Moving Turn (1 day cooldown) - Dash to an adjacent zone.",
						"Investigation (1 day cooldown) - Give a random piece of information that is useful related to the overall game state."],
					"Level 4": ["Blank Cartridge (2 day cooldown) - Put an arrest warrant on enemies in the zone, silencing all enemies in the current zone for 1/5th of a day, deal 20 damage.",
						"Overheat (1 day cooldown) - Reload your gun, resetting your basic attack cooldown, allowing another basic attack."],
					"Level 7": ["Unlock Tireless.",
						"Unlock Aya’s Justice."],
					"Level 10": ["Duty Calls (3 day cooldown) - Fire an explosive round that deals heavy damage, which deals 25 damage to all enemies in the current zone. Heal for the damage done.",
						"Unlock Explosive Ammo."],
					"Passives": ["Bulletproof Vest (1 day cooldown) - Shield 10 HP.",
						"Tireless (Level 7) - Immune to Slows and Roots.",
						"Aya’s Justice (Level 7, 1 day cooldown) - The first ability used on a target will deal 5% max HP.",
						"Explosive Ammo (Level 10) - Future ammo will be explosive, doing area of effect damage on basic attacks."]
				},
				{
					"Name": "Isol",
					"Summary": "A terrorist with guerilla warfare knowledge, using cunning strategies like traps and radar manipulation.",
					"Color": "#e6d5b6",
					"Main": true,
					"Image": "erwimages/chars/Isol.png",
					"Lore": "I can't stop here.<br><br>Isol, known as Marcelo at the time, escaped his orphanage at the age of 12 at the suggestion of his trusted friend, Francisco.<br><br>Following his escape, he joined the terrorist group known as MOK. Isol is the sole survivor among the several child soldiers who joined the group around then.<br><br>He tended to devolve to unnecessarily cruel ways of murder.<br><br>Isol is overly disinterested in learning about others as he hates unnecessarily forming close relationships.",
					"Description": "Assault Rifle Isol wants to hold a zone down and constantly apply sustain damage on other players, even more so with the traps that he can provide. This weapon is very susceptible to evasion and disruption effects.",
					"Role": "Ranger",
					"Difficulty": "Medium",
					"Power Spike": "Mid-Late Game",
					"HP": "100",
					"Basic Attack": "10 + (attack power) damage",
					"Basic Attack Cooldown": "1/2th day cooldown",
					"Level 1": ["Semtex Bomb (1 day cooldown) - Attach a bomb to a target, dealing 5 damage and rooting them for 1/8th of the day after a delay of 1/8th of the day.",
						"Rebel Assault (1 day cooldown) - Spray suppressing fire down in the current or adjacent zone, dealing 5 damage 3 times to all enemies there with 1/10th of a day separations, slowing them and increasing their cooldowns by 10%.",
						"Camouflage (1 day cooldown) - Dash to an adjacent zone and turn invisible for next day or until an ability is used."],
					"Level 4": ["MOK Operational Mine (2 day cooldown) - Set a trap down, enemies stepping on it will trigger the trap over the entire zone, be slowed with an increase of 20% cooldown, and take 20 damage.",
						"Overheat (1 day cooldown) - Reload your gun, resetting your basic attack cooldown, allowing another basic attack."],
					"Level 7": ["Learn from the Dead (3 day cooldown) - Check a corpse’s character and learn a unique passive from the character or the character’s gear, even passives that are not unlocked by the player.",
						"Radar Tampering (3 day cooldown) - Mess with your location tracking, immediately becoming invisible, lasts for 1 day.",
						"Unlock Urban Assault."],
					"Level 10": ["Venus Fly Trap (2 day cooldown) - Set a trap down, enemies stepping on it will trigger the trap over the zone, be stunned for 1/4th of the day, and take 10 damage.",
						"Unlock Armor Piercing Traps."],
					"Passives": ["Guerilla Warfare - You can see other traps that aren’t yours in adjacent zones. You know who steps on your traps and which player and character did.",
						"Urban Assault (Level 7) - Basic attacks deal 10 extra damage to trapped targets.",
						"Armor Piercing Traps (Level 10) - Trap damage ignores damage reduction, including MOK Mines and Venus Fly Traps."]
				}
			]
		}
	},
	{
		"Axe":
		{
			"Description": "Tankier fighter characters that tend to be able to lifesteal or shield a lot of damage while dealing significant damage.",
			"CharList":
			[
				{
					"Name": "Estelle",
					"Summary": "A firefighter with a bold heart and a sturdy shield to rid the world of fire and pain.",
					"Color": "Orange",
					"Main": true,
					"Image": "erwimages/chars/Estelle.png",
					"Lore": "No playing with fire! Leave the rest to me.<br><br>Estelle grew up as the runt of her neighborhood, always being looked down on as a weak and small girl. Despite that, she never gave up her dream of becoming a firefighter.<br><br>With great dedication, she proved her detractors wrong after training through blood, sweat, and tears.<br><br>Estelle has an impartial heart and believes in the duty to protect everyone around her, whether they're good, evil, weak, or strong.",
					"Description": "Axe Estelle is a standard shieldmaiden style character that wants to hold her ground and utilize tons of utility and crowd control. Estelle can provide constant support with global mobility and two different forms, capable of protecting and attacking with her shield and axe.",
					"Role": "Tank or Fighter",
					"Difficulty": "Medium",
					"Power Spike": "Early-Mid Game",
					"HP": "140",
					"Basic Attack": "0 + (attack power) damage (minimum 5 damage)",
					"Basic Attack Cooldown": "1/2th day cooldown",
					"Level 1": ["Suppression (1 day cooldown) - Smash someone with your fire axe, dealing 5 + (attack power) damage to a target.",
						"First Response (1 day cooldown) - Slam the ground with your shield, dealing 10 damage to a target, slow them, reducing their cooldown by 10%, and gain 10 damage reduction to both types of attacks for the rest of the day.",
						"Hazard Shield (1/4th day cooldown) - Switch between standard mode or go into shield mode and lose the ability to use basic attack or any ability besides Helitack Stat!, Emergency Extinguish, and Forcible Entry, but gain 30 damage reduction to both types of attacks for the rest of the day.",
						"Shield Bash (Only usable after Suppression) - Smash your shield into someone, dealing 5 + (attack power) damage to a target and stunning them for 1/4th of a day."],
					"Level 4": ["Helicopter Bucket (2 day cooldown) - Fly a helicopter to yourself, shielding yourself for 30 HP, dealing 20 damage, and slowing all enemies in the current zone and increase their cooldowns by 30%.",
						"Helitack Stat! (3 day cooldown) - Fly to the zone in a helicopter to a target, slamming the zone with 20 damage, stunning all enemies for 1/5th of a day, shielding the target for 30 HP, and teleporting there in 1/10th of a day.",
						"Maleficent Helix (1/2th day cooldown) - Swing your axe, dealing 10 damage to a target and healing for 20 HP.",
						"Emergency Extinguish (1 day cooldown) - Shoot your water hose at a target, dealing 5 damage and applying blind 3 times to a target in the current zone, each occurring over 1/10th of a day. Only can be used when Hazard Shield is up.",
						"Forcible Entry (1 day cooldown) - Dash to an adjacent zone shieldfirst, or dash to a target in the current or adjacent, deal 5 damage to them, and stun them for 1/10th of a day. Only can be used when Hazard Shield is up."],
					"Level 7": ["Unlock First Aid Knowledge.",
						"Duty Calls! applies a heal for allies for 10 HP a day."],
					"Level 10": ["Rapid Response (3 day cooldown) - Use your knowledge of first aid to instantly revive a target to full HP."],
					"Passives": ["Duty Calls! - Have a warming aura, making all allies in your current zone heal for 5 HP a day.",
						"First Aid Knowledge (Level 7) - Attempting to revive an ally makes you immune to statuses during the duration of reviving."]
				},
				{
					"Name": "Jackie",
					"Summary": "A serial killer who wants to mass murder anyone she can to sate her hunger.",
					"Color": "#ff9f9f",
					"Main": true,
					"Image": "erwimages/chars/Jackie.png",
					"Lore": "More...more...more!!<br><br>Jackie first discovered the thrill of murder after killing the wife and daughter of a prominent political family, the Winslairs. She went on to become a serial killer with a bodycount of over 30 people.<br><br>Her name 'Quilt' comes from her modus operandi of slicing the victims' bodies into small indistinguishable pieces. The resulting pieces are too small to identify, unless stitched together like a quilt.<br><br>She gained infamy for her rather inhumane killing methods and meticulous clean-up.<br><br>The body of Jackie's first victim, Angela Winslair, was never found.",
					"Description": "Axe Jackie is more focused on life draining enemies with significant lifesteal effects and multiple attacks over time in multiple turns. Jackie can sustain and brute force more situations using an axe than other weapons.",
					"Role": "Tank or Fighter",
					"Difficulty": "Easy",
					"Power Spike": "Early-Mid Game",
					"HP": "140",
					"Basic Attack": "10 + (attack power) damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Hack and Slash (1 day cooldown) - Hack and slash someone, dealing 5 damage twice to a target and applying a DoT bleed dealing 0 + (attack power) damage in 1/8th of a day.",
						"Adrenaline Burst (1 day cooldown) - Fuel yourself for battle, reducing cooldowns by 5% and have the next basic attack heal for 10 HP.",
						"Leaping Strike (1 day cooldown) - Jump up, dashing to an adjacent zone, or dash to a target in the current or adjacent and deal 5 damage to them."],
					"Level 4": ["Chainsaw Massacre (1 day cooldown) - Take out a menacing chainsaw, having the next basic attack apply a DoT bleed dealing 0 + (attack power) damage in 1/8th of a day. Reactivate your chainsaw to deal 20 damage to a target.",
						"Maleficent Helix (1/2th day cooldown) - Swing your axe, dealing 10 damage to a target and healing for 20 HP.",
						"Here’s Jackie! (1 day cooldown) - Repeatedly slash someone, dealing 10 damage 3 times to a target and healing for 10 HP each time, each occurring in 1/8th day intervals.",
						"Unlock Thirst."],
					"Level 7": ["Blood Boil (1 day cooldown) - Make someone’s blood boil, making the next basic attack the target uses apply a DoT bleed dealing 0 + (attack power) damage for 1/8th of a day.",
						"Unlock Hungry for Murder.",
						"Unlock Blood Hunt."],
					"Level 10": ["Lifedrain (3 day cooldown) - Revel in blood, if you kill an enemy within this day, heal for 50% max HP."],
					"Passives": ["Bloodfest - Gain 10 attack power for 1 day upon killing a player.",
						"Thirst (Level 4) - Bleeding targets bleeding from you are seen globally.",
						"Hungry for Murder (Level 7) - Enemies that are under 30% HP are seen globally.",
						"Blood Hunt (Level 7) - Bleeding targets bleeding from you have their HP shown to you."]
				},
				{
					"Name": "Markus",
					"Summary": "A viking who values power and honor over all, showing prowess in combat in a fair way to defeat his enemies.",
					"Color": "#d3d3d3",
					"Main": true,
					"Image": "erwimages/chars/Markus.png",
					"Lore": "To fight with honor means to only take on opponents of your own size.<br><br>Markus' driving force is to achieve the strongest body known to man, powerful enough to lift cars.<br><br>Rumor says that if you look up \"strong\" in the dictionary, you'll see a picture of his face!<br><br>You might mistake him for a shallow musclehead, but he has a heart of gold and would never betray anyone who trusted him.<br><br>To Markus, betraying another's honor is the most cowardly thing one can do.",
					"Description": "Axe Markus is a tanky bruiser that can dish out significant damage through pushing and pulling enemies around zones in order to apply on-hit effects and status enemies into the ground. Markus can also execute enemies and needs to manage a secondary resource to keep track of what statuses different abilities will apply.",
					"Role": "Tank or Fighter",
					"Difficulty": "Medium",
					"Power Spike": "Early-Mid Game",
					"HP": "140",
					"Basic Attack": "10 + (attack power) damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Art of War (1 day cooldown) - Prepare your axe, the next basic attack you use will grant 5 Grit instead of 2 and deal an additional 10 damage.",
						"Violent Swing (1 day cooldown) - Swing your axe violently, dealing 5 damage to the target, and stunning them for 1/10th of a day. Spend 5 Grit to push the target into another zone instead, or pull the target to the current zone if they are in an adjacent zone.",
						"Fearless Assault (1 day cooldown) - Dash to an adjacent zone, or dash to a target in the current or adjacent, ramming them, dealing 5 damage to them, and stunning them for 1/10th of a day. Spend 5 Grit to push the target into another zone instead and deal 10 damage."],
					"Level 4": ["Smash to Smithereens (2 day cooldown) - Slam the current zone, dealing 10 + (attack power) damage, and apply Rattled to all targets in the zone. Immediately grant 10 Grit.",
						"Maleficent Helix (1/2th day cooldown) - Swing your axe, dealing 10 damage to a target and healing for 20 HP."],
					"Level 7": ["Tectonic Rift (2 day cooldown) - Creates a fissure wall between the current zone and an adjacent zone for the next day. Enemies cannot enter or exit the zone from this zone. If an enemy is pushed or pulled into the zone, they are stunned instead for 1/10th of a day and take 20 extra damage.",
						"Viking’s Call (1/4th day cooldown) - Switch between an aura that grants 2 attack power (Offensive) or 5 damage reduction of both types (Defensive) to all allies in the same zone.",
						"Fighting Spirit (2 day cooldown) - Reset the cooldown of one of Violent Swing or Fearless Assault."],
					"Level 10": ["Viking Beheading (Only usable when target is 20% HP or less) - Put someone’s head on the chopping block, executing any target that is 20% HP or less, instantly downing them into Death’s Door. All enemies in the zone will be pushed away to an adjacent zone.",
						"Gjallarhorn (2 day cooldown) - Pull out your warhorn, silencing all enemies on the entire map for 1/6th of a day."],
					"Passives": ["Warrior’s Grit - Basic Attacks grant 2 Grit, and some abilities grant a certain number of Grit. Grit can be used to empower an ability like Violent Swing and Fearless Assault.",
						"Rattled - Pulling and pushing enemies into other zones will slow them, increasing their cooldowns by 10% and allow you to use Fatal Blow.",
						"Fatal Blow - Upon pulling or pushing a target into another zone, allow yourself to dash to the target on the next basic attack to the target, also being immune to statuses during that basic attack and dealing an extra 10% of target’s max HP as damage."]
				}
			]
		}
	},
	{
		"Bat":
		{
			"Description": "Tanky defensive characters that can also hit hard, usually fit a control heavy playstyle that can flow in different directions.",
			"CharList":
			[
				{
					"Name": "Adela",
					"Summary": "A grandmaster chess player that has every single outcome in her mind who will not take defeat as an answer.",
					"Color": "#d3d3d3",
					"Main": false,
					"Image": "erwimages/chars/Adela.png",
					"Lore": "Why even try? My victory is assured.<br><br>A world chess grandmaster, what lies in front of Adela is only victory. \"Defeat\" simply doesn't exist in her vocabulary. She's always at least one step ahead of her enemies - more often two or three.<br><br>Outside of chess, she takes things frustratingly slow. When the game starts, however, she concentrates fully, maneuvering the chess board with grace.<br><br>She challenges herself to think and enjoys the thrill of winning with her precise and calculating strategy.",
					"Description": "Bat Adela is a control heavy mage that wants to dominate multiple zones with her usage of chess pieces and combos. The chess piece placement and Bat specific abilities create a sustained control heavy playstyle that pushes out enemies indirectly using area control.",
					"Role": "Mage",
					"Difficulty": "Hard",
					"Power Spike": "Mid-Late Game",
					"HP": "100",
					"Basic Attack": "5 damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Promotion (1 day cooldown, 3 uses a day) - Drop a Pawn, dealing 10 damage to a target.",
						"Knight Fork (1 day cooldown) - Drop a Knight into the current zone, you must knock any chess pieces into adjacent zones of choice, maximum 2 per zone, dealing 0 + (attack power) damage to a target. If at least 2 chess pieces are hit with the Knight, deal an additional 10 damage to the target, and stun them for 1/10th of a day.",
						"Castling (1 day cooldown) - Drop a Rook to an adjacent zone to dash sometime in the next 1/5th of a day, dealing 0 + (attack power) damage to an enemy in the adjacent zone and swapping places with the Rook. If any chess piece is hit with the Rook, deal an additional 10 damage. The reactivation can be used in Checkmate.",
						"Queened (Upon 3 uses of Promotion) - Drop a Queen, dealing 0 + (attack power) damage to a target and stunning them for 1/8th of a day. Leaves a Queen in the zone."],
					"Level 4": ["Checkmate (2 day cooldown) - Attempt to checkmate, becoming invulnerable and immune to all statuses for 1/8th of a day. After the duration, deal 10 damage and deal an extra 2% max HP damage per chess piece to all enemies in the zone.",
						"Full Swing (2 day cooldown) - Swing your bat, dealing 5 damage to all enemies in the zone, and knocking them back to a chosen adjacent zone.",
						"Development (1 day cooldown) - Drop a Bishop to a non adjacent or current zone, dealing 10 damage to all enemies in the area. If any chess piece is hit with the Bishop, deal an additional 10 damage to all enemies in the zone.",
						"Pawn to E4 (Once per chess piece per day) - Move a chess piece to an adjacent zone of the chess piece."],
					"Level 7": ["King Safety (2 day cooldown) - Drop a King to the current zone. Protect the King to gain 5 Attack Power. The King chess piece has 30 HP.",
						"Sacrifice (Only if chess pieces available) - Destroy a chess piece, healing for 10 HP.",
						"Decoy (1 day cooldown) - Drop a fake chess piece of choice in any zone."],
					"Level 10": ["En Passant (1 day cooldown) - Capture en passant, dealing 0 + (attack power) damage to all enemies in all zones that a chess piece is in."],
					"Passives": ["Control the Center - Any attempts to reset the basic attack cooldown do not work and instead doubles basic attack damage from the original value. All chess pieces last for 1/2 of a day.",
						"Time Control - Every 3rd Promotion, reduce cooldowns by 10%."]
				},
				{
					"Name": "Luke",
					"Summary": "A janitor who also learned the trade of assassination, capable of hiding well as a janitor to produce proper results as an assassin.",
					"Color": "#ead1dc",
					"Main": true,
					"Image": "erwimages/chars/Luke.png",
					"Lore": "Double L Cleaning is on the job!<br><br>Claiming to be a veteran janitor, Luke gained quite the reputation for his proficiency in cleaning and handling any request with a smile.<br><br>After clocking out of his day job, cleaning takes on another meaning for him. There's nothing the silent hitman won't turn down, and has yet to fail to come through on any requests.<br><br>Luke's childhood was tragic, his father died before he was born, and his mother died in prison when he was just 8 years old.<br><br>He spent some of his younger years in a facility before being adopted by his step-father, who then raised him to be an efficient assassin.",
					"Description": "Bat Luke is a fast rushing fighter who can get fast items early and start aggressively hunting others. Luke can also work on building slower items that work for a more burst heavy playstyle that allows him to cast multiple spells at once, making him a stronger threat for later. Luke has high mobility and needs good camera usage, while having good farming patterns.",
					"Role": "Fighter or Assassin",
					"Difficulty": "Medium",
					"Power Spike": "Early-Mid Game",
					"HP": "120",
					"Basic Attack": "10 + (attack power) damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Clean Sweep (1 day cooldown) - Toss a cleaning solution at a target and deal 5 damage to the target in the current or adjacent zone. Choose to dash to the target in the next 1/8th of a day, dealing 10 + (attack power) damage. Evolving this will make it so reactivating the dash heals for 20 HP.",
						"Elbow Grease (1 day cooldown) - Mop someone hard, dealing 20 damage to a target in the current zone and increase attack power by 5 for this day. Evolving this will reduce the cooldown to a 1/2th day cooldown. Counts as a basic attack.",
						"Dirty Work (1 day cooldown) - Backstab someone, dealing 10 damage to a target in the current or adjacent zone and dash to them. Can target cameras without damaging them, and also dashes to them. Evolving this will make the ability slow the target, increasing their cooldowns by 10%."],
					"Level 4": ["Pressure Washer (2 day cooldown) - Shoot a target with a pressure washer, deal 20 + (attack power) damage to the target in the current or adjacent zone, and choose to either push yourself back into a chosen zone or not, which must be opposite of where you had fired the shot. Evolving this ability allows so if you hit a target with Pressure Washer, Clean Sweep is immediately reset in cooldown.",
						"Full Swing (2 day cooldown) - Swing your bat, dealing 5 damage to all enemies in the zone, and knocking them back to a chosen adjacent zone.",
						"Thorough Cleaning (1 day cooldown) - Clean a corpse, learning the character and making sure no one can interact with this corpse. Find who or what killed the corpse, animal or player."],
					"Level 7": ["Need for Clean (1 day cooldown) - Clean someone deeply, dealing 20 damage and disrupting a target for 1/8th of a day, cleaning the player’s character entirely against intel abilities permanently. Evolving this ability allows it to remove damage reduction from the target permanently.",
						"Unlock Borrowed CCTVs.",
						"Unlock Nothing Personal Kid."],
					"Level 10": ["Finish the Job (2 day cooldown) - Mark a target with an assassination mark. If any damage is done to the target this day when the target reaches 10% HP, the target will take an additional 10% max HP as damage."],
					"Passives": ["Neat ‘n Tidy - Gain a stack of Neat ‘n Tidy upon killing an animal. Gain 5 stacks upon killing a player. Every 5 stacks of Neat ‘n Tidy will grant one evolution point, which can evolve Clean Sweep, Elbow Grease, Dirty Work, Pressure Washer, and Need for Clean.",
						"Agent 47 - Dress up as a chosen character, pretending to be them through intel abilities even in death.",
						"Borrowed CCTVs (Level 7) - Upon killing an enemy player, gain a free Surveillance Camera.",
						"Nothing Personal Kid (Level 7) - Upon killing an enemy player, teleport to any zone."]
				},
				{
					"Name": "Magnus",
					"Summary": "A biker that wants to assert his strength against others to prove his power of his biker gang.",
					"Color": "white",
					"Main": true,
					"Image": "erwimages/chars/Magnus.png",
					"Lore": "The Legendary Biker, Magnus!<br><br>Magnus is the leader of the prominent motorcycle gang found across the US, Reaper's Wheel. Even before he took the helm, the group was well-known. Other gangs and bikers tried to intimidate them wherever they went, resulting in gang fights and turf wars.<br><br>Magnus, however, would always emerge victorious, no matter how many he was up against. He became a living legend amongst the bikers across the country and the rest of Reaper's Wheel. Magnus is proud of his absolute power.<br><br>He has a knack for aggravating and taunting others.<br><br>His catchphrase words are \"Power!\" and \"Persistence!\"",
					"Description": "Bat Magnus is one of the safest and most versatile characters in the game, capable of running many strategies, whether it be constant sustain damage, huge bursts of damage through some spells, or simply being immune to most CCs. Magnus is incredibly good with zone control in that he has abilities to deny players from entering zones and good escape away from danger.",
					"Role": "Tank or Fighter",
					"Difficulty": "Easy",
					"Power Spike": "Mid Game",
					"HP": "140",
					"Basic Attack": "10 + (attack power) damage",
					"Basic Attack Cooldown": "1/2th day cooldown",
					"Level 1": ["Broken Bullet (1 day cooldown) - Deal 5 damage to a target in the current or adjacent zone, slow the target hit, increasing their cooldowns by 10%.",
						"17 vs 1 (1 day cooldown) - Deal 5 damage 3 times to all targets in the current zone, becoming status immune for each attack, each taking 1/10th of a day.",
						"Heavy Strike (1 day cooldown) - Deals 5 damage to the target, and knocks them back to an adjacent zone."],
					"Level 4": ["Bike From Hell (3 day cooldown) - Get on a bike and crash into a zone on the map to deal 10 + (attack power) damage to everyone in that zone, moving to that zone.",
						"Full Swing (2 day cooldown) - Swing your bat, dealing 5 damage to all enemies in the zone, and knocking them back to a chosen adjacent zone.",
						"Unlock Anti-Explosive Vest."],
					"Level 7": ["Mace is the Place (1 day cooldown) - Hit a target’s armor, dealing 5 damage to a target in the same zone and steal 5 damage reduction for today.",
						"Rev Up (1 day cooldown) - Give the target 50% tenacity against statuses today.",
						"Unlock Heavy Hitter."],
					"Level 10": ["Biker Gang (3 day cooldown) - Call a biker gang to the current or an adjacent zone, blocking the zone off for all non-allies and rooting all enemies inside for 1 day. Any non-ally attempting to enter will simply not be able to enter the zone for 1 day. Cannot be used in a red zone.",
						"Uber Biker (2 day cooldown) - Drive straight to an ally, selecting a friendly target and move them alongside you to any zone."],
					"Passives": ["Tough Body - Gain 1 damage reduction per 20 less HP you have.",
						"Anti-Explosive Vest (Level 4) - Block 50% damage from any area of effect abilities.",
						"Heavy Hitter (Level 7) - Each basic attack gives 2 damage reduction."]
				}
			]
		}
	},
	{
		"Bow":
		{
			"Description": "Range advantage characters that can deal significant damage from afar, with vision utility.",
			"CharList":
			[
				{
					"Name": "Hyejin",
					"Summary": "A shaman that can cast many spells and charms while searching for her destiny.",
					"Color": "#d2beff",
					"Main": true,
					"Image": "erwimages/chars/Hyejin.png",
					"Lore": "This must be another fated way.<br><br>Hyejin is the only child of a generational shaman family. Her destiny, if she had been born after dawn, would have been straightforward and undisturbed. Hyejin was not so lucky. Having been born before dawn, she was fated to go through a great ordeal at the age of 18.<br><br>She seems to accept her destiny as it is. Being raised from a shaman family, Hyejin believes her fate has already been determined.<br><br>She often plays the Bipa, a pear-shaped lute used to communicate with spirits. To be honest though, it kinda just looks like she's murmuring to herself.",
					"Description": "Bow Hyejin is very versatile with smaller chunks of damage through multiple spells, or even a more supportive strategy in fearing and rooting other players. Hyejin can play fast or normal and can compete pretty well at any point in the game.",
					"Role": "Ranger or Mage or Support",
					"Difficulty": "Medium",
					"Power Spike": "Early-Mid Game",
					"HP": "100",
					"Basic Attack": "20 damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Charm of Despair (1 day cooldown, 2 uses a day) - Use a slowing charm, dealing 5 + (attack power) damage to a target and slowing them, increasing their cooldowns by 10%.",
						"Charm of the Prophecy (1 day cooldown) - Use a rooting charm, dealing 10 damage to a target and rooting them for 1/10th of a day.",
						"Charm of the Nomad (1 day cooldown) - Use a mobility charm, leaving a mark to allow dashing there in the next 1/5th of a day, or dash to a target in the current or adjacent and deal 10 damage to them."],
					"Level 4": ["Five Omens (2 day cooldown) - Summon an omen in each adjacent zone, dealing 0 + (attack power) damage to any enemy that is visible in the zone. If there isn’t a visible enemy in that zone, hit the first enemy that enters or is revealed in the zone.",
						"Rain of Arrows (1 day cooldown) - Shoot a rain of arrows, dealing 20 damage to all enemies in the current or adjacent zone.",
						"Unlock Arrow of Calamity."],
					"Level 7": ["Charm of the Curse (1 day cooldown) - Curse a target, dealing 10 damage and disrupting the target for 1/6th of a day.",
						"Charm of the Fate (1 day cooldown) - Infuse your bow with a charm, capable of dealing both basic attack and a charm’s effect (any spell besides Five Omens and Rain of Arrows).",
						"Charm of Alacrity (2 day cooldown) -  Reset target’s basic attack cooldown."],
					"Level 10": ["Charm of Vengeance (1 day cooldown) - Summon some magic missiles, dealing 3 missiles of 10 damage per missile to a target. Each count as a separate spell."],
					"Passives": ["Three Calamities - Upon hitting a target with 3 separate spells, push them to any adjacent zone.",
						"Arrow of Calamity (Level 4) - Applies a single stack of Three Calamities with a basic attack."]
				},
				{
					"Name": "Nadine",
					"Summary": "A hunter who knows how to care for animals with a unique connection to them.",
					"Color": "#ffd966",
					"Main": true,
					"Image": "erwimages/chars/Nadine.png",
					"Lore": "With a bow in my hands, I won't miss.<br><br>A sudden landslide occurred when Nadine was only 4 years old, resulting in the loss of both of her parents. She was the sole survivor, ultimately being rescued and raised by wild animals. Authorities declared her dead, but she was found 8 years later by a hunter, giving her a chance at a new life as a human. To this day, she struggles to live in normalcy, hesitating on even the most trivial of tasks.<br><br>Nadine is claustrophobic due to her deep-seated memory of being buried.<br><br>She will overthink situations to the point of freezing, but has a facade of indifference to hide it.",
					"Description": "Bow Nadine is focused on stacking by killing wild animals and reaching the late game with a significant number of stacks, doing very significant burst damage. This character can also use traps a bit and has some range and utility.",
					"Role": "Ranger",
					"Difficulty": "Medium",
					"Power Spike": "Late Game",
					"HP": "100",
					"Basic Attack": "5 + (attack power) damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Bullseye (1 day cooldown) - Charge an arrow, shooting a target after 1/10th of a day, dealing 5 + (attack power) damage to a target in the current zone or adjacent zone.",
						"Squirrel Trap (1 day cooldown) - Set a trap down, the first enemy stepping into the current zone will be slowed, increasing their cooldowns by 5% and dealing 5 damage.",
						"Monkey Wire (1 day cooldown) - Charge a wire to an adjacent zone to allow dashing there in the next 1/5th of a day."],
					"Level 4": ["Wolf Assault (2 day cooldown) - Summon a wolf pet, making the next 3 basic attacks launch a wolf that deals 0 + (attack power) extra damage.",
						"Rain of Arrows (1 day cooldown) - Shoot a rain of arrows, dealing 20 damage to all enemies in the current or adjacent zone.",
						"Unlock Animal Whisperer."],
					"Level 7": ["Tracking Arrow (1 day cooldown) - Shoot a tracking arrow into a zone and check if there are enemies in the zone, giving vision there for 1/2th of a day.",
						"Animal Calmer (1 day cooldown) - Release a wild animal, gaining experience and inventory of the animal and not leaving a corpse."],
					"Level 10": ["Katyusha Arrow (3 day cooldown) - Shoot an arrow into the current or adjacent zone, which constantly barrages the zone with Rain of Arrows, dealing 20 damage to all enemies in the zone in 1/4th day intervals for 1/2th of a day.",
						"Animal Tamer (4 day cooldown) - Tame a wild animal, allowing them to fight with you for the rest of the game. The animal can attack and be attacked.",
						"Unlock Animal Lover."],
					"Passives": ["Wild And Clairvoyant - Gain a stack of Wild Hunt every animal that is a Wild Dog or bigger killed, giving 2 attack power permanently.",
						"Animal Whisperer (Level 4) - You can see the animals in adjacent zones.",
						"Animal Lover (Level 10) - You can see the animals in all zones and see who attacks them."]
				},
				{
					"Name": "Rio",
					"Summary": "An archer that can hit any target from any distance, inhumanely accurate in marksmanship.",
					"Color": "white",
					"Main": true,
					"Image": "erwimages/chars/Rio.png",
					"Lore": "Arrows will pierce the lies.<br><br>Rio is a high school student and an outstanding member of her school's Kyudo club.<br><br>She was a natural archer and always faced her target with incredible posture and poise.<br><br>Her peers have had trouble approaching and befriending her due to her cold looks, composed attitude, and straightforward, blunt way of speaking.<br><br>The truth is that she's just a normal awkward high school student who loves cute things and is excited to talk about things she loves. Before her final archery competition as a student, she suddenly vanished - and hasn't competed since.",
					"Description": "Bow Rio is focused on dealing sustained damage from range, constantly poking away at enemies. Rio becomes stronger towards later in the game as there’s more resources to transition to strong passives and abilities in her kit that enable her to use her basic attacks and varied abilities.",
					"Role": "Ranger",
					"Difficulty": "Easy",
					"Power Spike": "Mid-Late Game",
					"HP": "100",
					"Basic Attack": "10 + (attack power) damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Kyudo Instinct (1/4th day cooldown) - Switch between Hankyu and Daikyu stances.",
						"Hanare (1 day cooldown) - Shoot out a special arrow in either form. In Hankyu, deal 10 damage to a target in the current or adjacent zone and slow them, increasing their cooldowns by 5%. In Daikyu, deal 10 damage to all enemies in the current or adjacent zone.",
						"Soar (1 day cooldown) - Leap high, dashing to an adjacent zone and dealing 5 damage to a target in the current zone."],
					"Level 4": ["Fleeting Soul (2 day cooldown) - Can only be done in Hankyu, shoot out a short ranged arrow, dealing 5 damage to a target. In 1/8th of a day, deal 5 damage to the target again, and knock them back to an adjacent zone to them.",
						"Spirit Arrow (2 day cooldown) - Can only be done in Daikyu, shoot out a long range arrow, dealing 10 damage to a target in any zone.",
						"Rain of Arrows (1 day cooldown) - Shoot a rain of arrows, dealing 20 damage to all enemies in the current or adjacent zone."],
					"Level 7": ["Simple Geometry (1 day cooldown) - Use a special arrow technique, learned from a unique archery method using terrain. In Hankyu, deal 20 damage to all enemies in the current zone and an adjacent zone. In Daikyu, deal 20 damage to a target in the current zone, deal 20 damage to a target in another chosen zone on the map, and deal 20 damage to a target in yet another chosen zone on the map.",
						"Unlock Defensive Archery."],
					"Level 10": ["Armor Piercing Arrows (1 day cooldown) - Strengthen your arrows, ignoring all defense and shielding for 1/2th of a day with all basic attacks.",
						"Unlock My Aim is True."],
					"Passives": ["Hassetsu - Hankyu stance focuses on having a 1/2th day cooldown basic attack, and Daikyu stance focuses on having a 1 day cooldown basic attack that can reach any adjacent zone.",
						"Defensive Archery (Level 7, 2 day cooldown) - Upon reaching under 30% HP, gain evasion for 1/3rd of a day.",
						"My Aim is True (Level 10) - Immune to disrupt and ignore evasion with basic attacks."]
				}
			]
		}
	},
	{
		"Camera":
		{
			"Description": "Not done yet",
			"CharList":
			[
			]
		}
	},
	{
		"Crossbow":
		{
			"Description": "Not done yet",
			"CharList":
			[
			]
		}
	},
	{
		"Dagger":
		{
			"Description": "Fast attacking and utility focused melee option, usually fits a more stealthy or fast attacking role.",
			"CharList":
			[
				{
					"Name": "Cathy",
					"Summary": "A nurse with one too many malpractices and can malpractice on her enemies with ease.",
					"Color": "white",
					"Main": true,
					"Image": "erwimages/chars/Cathy.png",
					"Lore": "I've grown used to blood and corpses.<br><br>Cathy is often a kind and sentimental doctor - perhaps a little too much so. Time and again, she grew too attached to her patients, ultimately causing her to lose her job due to several malpractice cases - all stemming from her \"sympathy\".<br><br>She opened up her very own free medical clinic, supported by the locals just enough for her to get by. Those that do visit her clinic are all aware of her kindness, but are also aware of her peculiarity. If they come down with something more serious, they tend to skip Cathy's clinic and visit a bigger hospital.",
					"Description": "Dagger Cathy is a versatile character that can go either a more supportive direction, healing constantly, or go into sustain damaging opponents down with many basic attacks. Cathy can do many different builds and probably survive decently and give lots of utility.",
					"Role": "Assassin or Support",
					"Difficulty": "Medium",
					"Power Spike": "Mid Game",
					"HP": "120",
					"Basic Attack": "10 damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Double Bypass (1 day cooldown) - Strike at the heart, dashing to an adjacent zone, or dash to a target in the current or adjacent and deal 0 + (attack power) damage to them.",
						"Amputation (1 day cooldown) - Amputate someone, dealing 0 + (attack power) damage to a target and slowing them, increasing their cooldowns by 30%.",
						"Suture (2 day cooldown) - Suture two targets together, either dealing 10 damage to a target and rooting them for 1/10th of a day, or if two targets are in the zone, suturing both targets, dealing 10 + (attack power) damage, and stunning them both for 1/4th of a day."],
					"Level 4": ["Emergency Surgery (2 day cooldown) - Surgically cut through two zones, dashing between the current and adjacent zone, in which enemies in either zone take 10 + (attack power) damage and allies in either zone heal for 0 + (attack power) HP.",
						"Cloak and Dagger (1 day cooldown) - Become one with the shadow, turning invisible for 1 day, reactivate on a target to backstab and deal 10 damage to them.",
						"Unauthorized Healing (1/3rd day cooldown) - Use some underhanded healing tactics, dealing 5 damage to a target, and healing the target the next day for 40 HP."],
					"Level 7": ["Organ Stripping (1 day cooldown) - Cut open an enemy, dealing 10 damage and sleep (stun) the target for 1/2th of a day, if the target is attacked before they are unstunned, the target wakes up and is disrupted for the remaining duration.",
						"Unlock Cutting Edge."],
					"Level 10": ["Vaccinate (1 day cooldown) - Make a target immune to a status for this day.",
						"Unlock Health Inspector."],
					"Passives": ["Under the Knife - Every 5 hits of abilities or basic attacks inflicts a bleed that deals an additional 10 damage to the target in 1/2th of a day.",
						"Post Op (1 day cooldown) - Upon using an ability, create a 10 HP shield.",
						"Cutting Edge (Level 7) - Every third ability used this day resets the basic attack cooldown.",
						"Health Inspector (Level 10) - See all enemy HPs."]
				},
				{
					"Name": "Daniel",
					"Summary": "A hairstylist that can cut the best hairstyles and masterpieces out of anyone.",
					"Color": "#d2beff",
					"Main": true,
					"Image": "erwimages/chars/Daniel.png",
					"Lore": "Find inspiration in anything... or anyone.<br><br>The hairstylist with the beautiful mane, Daniel is able to completely bring his visions to life with his scissors in hand. He doesn’t even have to ask his clients what they want - he’s able to conceptualize a perfect look instantly. He prefers to work in silence and concentrate on his masterpiece, usually making his clients uncomfortable in the process, but the result is always flawless and they always end up coming back.<br><br>One afternoon, he received an urgent call from one of his clients, requesting he come and fix their hairstyle. Daniel gathered his equipment and left, never to return. His colleagues recalled seeing him leave in a huff and seemingly irate.",
					"Description": "Dagger Daniel is a burst assassin based on raising attack power and playing with vision, such as blinding enemies and making himself invisible. His goal is to constantly stack passives that increase his attack power and eliminate enemies in quick succession.",
					"Role": "Assassin",
					"Difficulty": "Medium",
					"Power Spike": "Early-Mid Game",
					"HP": "120",
					"Basic Attack": "10 + (attack power) damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Dusk Shears (1 day cooldown) - Summon a pair of scissors that cuts into a target, dealing 0 + (attack power) damage to them, both reducing cooldowns by 10% and reducing basic attack cooldown by 25%.",
						"Inspiration (1 day cooldown) - Mark a target with inspiration for your art, revealing and marking them for 1/5th of a day. If damage is done to the target 3 times, root the target and deal 25% of the damage done over the duration in a single burst.",
						"Shadow Glide (1 day cooldown) - Dash to an adjacent zone and deal 10 + (attack power) damage to a target in a zone that is adjacent to the zone that was just dashed to. Counts as a basic attack."],
					"Level 4": ["Masterpiece (2 day cooldown) - Create a masterpiece out of someone who is marked or blinded, shadowing them. Follow the target through any zone, become invulnerable, and deal 10 damage 3 times over 1/10th of a day intervals. At the end of these attacks, deal 20% max HP damage to the target.",
						"Cloak and Dagger (1 day cooldown) - Become one with the shadow, turning invisible for 1 day, reactivate on a target to backstab and deal 10 damage to them.",
						"Nightmare (2 day cooldown) - Darken the sky to prepare your art, both giving yourself Recluse and blinding all enemies in the same zone as you for 1/2th of a day.",
						"Now You Don’t (2 day cooldown) - Put on a dark cloak, turning invisible and invulnerable for 1/10th of a day."],
					"Level 7": ["Clean Shaving (1 day cooldown) - Shave a target’s head, silencing them for 1/8th of a day, dealing 5 damage to them, and granting the effects of Recluse for 1/5th of the day, stacking with the passive.",
						"Dark and Darker (1 day cooldown) - Poke someone’s eyes, blinding them for 1/8th of a day, dealing 5 damage to them, and granting the effects of Antipathy for 1/5th of the day, stacking with the passive.",
						"Unlock Master of the Dark Arts."],
					"Level 10": ["Recluse and Antipathy is on permanently."],
					"Passives": ["Recluse - Every second day grants you vision on invisible heroes and reduces your basic attack cooldown by 25%.",
						"Antipathy - If Daniel is below 50% HP, he gains 5 attack power.",
						"Master of the Dark Arts (Level 7) - Immune to blinds and disrupts."]
				},
				{
					"Name": "Jackie",
					"Summary": "A serial killer who wants to mass murder anyone she can to sate her hunger.",
					"Color": "#ff9f9f",
					"Main": false,
					"Image": "erwimages/chars/Jackie.png",
					"Lore": "More...more...more!!<br><br>Jackie first discovered the thrill of murder after killing the wife and daughter of a prominent political family, the Winslairs. She went on to become a serial killer with a bodycount of over 30 people.<br><br>Her name 'Quilt' comes from her modus operandi of slicing the victims' bodies into small indistinguishable pieces. The resulting pieces are too small to identify, unless stitched together like a quilt.<br><br>She gained infamy for her rather inhumane killing methods and meticulous clean-up.<br><br>The body of Jackie's first victim, Angela Winslair, was never found.",
					"Description": "Dagger Jackie is an early rush DPS that wants to murder as many people as fast as possible. Generally, rushing a fast attacking weapon will allow the character to attack multiple times and whittle people down while endlessly chasing them, allowing Jackie to kill many players.",
					"Role": "Assassin",
					"Difficulty": "Easy",
					"Power Spike": "Early-Mid Game",
					"HP": "120",
					"Basic Attack": "5 + (attack power) damage",
					"Basic Attack Cooldown": "1/2th day cooldown",
					"Level 1": ["Hack and Slash (1/2th day cooldown) - Hack and slash someone, dealing 5 damage twice to a target and applying a DoT bleed dealing 0 + (attack power) damage in 1/8th of a day.",
						"Adrenaline Burst (1 day cooldown) - Fuel yourself for battle, reducing cooldowns by 5% and have the next basic attack heal for 10 HP.",
						"Leaping Strike (1 day cooldown) - Jump up, dashing to an adjacent zone, or dash to a target in the current or adjacent and deal 5 damage to them.",
						"Bloody Trace (1 day cooldown) - Leave bloody traces on someone, inflicting a DoT bleed on a target that deals 0 damage, but counts as a bleed for the rest of the day."],
					"Level 4": ["Chainsaw Massacre (1 day cooldown) - Take out a menacing chainsaw, having the next basic attack apply a DoT bleed dealing 0 + (attack power) damage in 1/8th of a day. Reactivate your chainsaw to deal 20 damage to a target.",
						"Cloak and Dagger (1 day cooldown) - Become one with the shadow, turning invisible for 1 day, reactivate on a target to backstab and deal 10 damage to them.",
						"Sudden Backstab (1 day cooldown) - Backstab with murderous intent, dashing to an adjacent zone, or dash to all enemies in the current or adjacent and deal 10 damage to each of them. Become invisible after.",
						"Unlock Thirst."],
					"Level 7": ["Bloody Trace applies a DoT bleed dealing 0 + (attack power) damage for the day.",
						"Unlock Hungry for Murder.",
						"Unlock Blood Hunt."],
					"Level 10": ["Chainsaw Massacre’s bleed per basic attack is now on permanently with the reactivation being separate as the ability."],
					"Passives": ["Bloodfest - Gain 10 attack power for 1 day upon killing a player.",
						"Thirst (Level 4) - Bleeding targets bleeding from you are seen globally.",
						"Hungry for Murder (Level 7) - Enemies that are under 30% HP are seen globally.",
						"Blood Hunt (Level 7) - Bleeding targets bleeding from you have their HP shown to you."]
				},
				{
					"Name": "Shoichi",
					"Summary": "A ruthless businessman who will stop at nothing to make more money and protect his child.",
					"Color": "#e6d5b6",
					"Main": true,
					"Image": "erwimages/chars/Shoichi.png",
					"Lore": "So, how much is this job worth?<br><br>Shoichi was just your regular everyday salaryman in Japan, watching the days pass by from his office chair. However, his life took a turn after the unexpected death of his wife from a congenital heart disease.<br><br>Shoichi was unable to afford the expensive experimental treatment for her, and blames himself for her untimely death. Determined to protect his daughter, who inherited the disease from her mother, Shoichi decided that he would do absolutely anything to afford her preventive care.<br><br>He has a smooth tongue and can discuss high-class matters with ease. He prefers to drink tea rather than coffee, but believes that drinking tea is seen as... kinda lame.",
					"Description": "Dagger Shoichi is a burst assassin based on collecting daggers on the map, which allow you to constantly reapply the damage of some of your spammable skills. Shoichi is extremely mobile and can also increase his damage through credits and has many utilities around credit gain and increasing his basic attack damage.",
					"Role": "Assassin",
					"Difficulty": "Medium",
					"Power Spike": "Mid Game",
					"HP": "120",
					"Basic Attack": "10 damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Good Faith (1 day cooldown) - Lunge your blade at a target, dealing 10 damage.",
						"Bottom Line (1 day cooldown) - Dash to a target or a dagger in an adjacent or current zone and deal 10 + (attack power) damage to the target. Resets if you collect a dagger. Does not deal damage to allies.",
						"Risky Business (1 day cooldown) - Throw a dagger at someone, dealing 10 damage to the target in the current zone, and pushing yourself back into an adjacent zone.",
						"Bad Faith (Only usable after Good Faith) - Sweep your blade in an adjacent zone, dealing 10 damage to all enemies and dropping a dagger."],
					"Level 4": ["Ruthless (2 day cooldown) - Swing your deadly briefcase, dropping a dagger in every adjacent zone.",
						"Cloak and Dagger (1 day cooldown) - Become one with the shadow, turning invisible for 1 day, reactivate on a target to backstab and deal 10 damage to them.",
						"Unlock Phony Deal.",
						"Unlock Insider Trading."],
					"Level 7": ["Cutthroat (1 day cooldown) - Be cutthroat, dropping a dagger in a zone that isn’t an adjacent or current zone.",
						"Unlock Salaryman."],
					"Level 10": ["Underhanded Deal (2 day cooldown) - Receive a call from your boss, making an underhanded deal, marking a target for death. If the target dies, gain 25 credits."],
					"Passives": ["Corporate Backstab - Upon moving to a dagger, deal 5 damage to all enemies in the zone of the dagger.",
						"Phony Deal (Level 4) - Every ability cast increases his next basic attack damage by 5.",
						"Insider Trading (Level 4) - You can give credits to other players.",
						"Salaryman (Level 7) - Gain 1 attack power per 10 credits that you have."]
				},
				{
					"Name": "Xiukai",
					"Summary": "A chef of many dishes who will cook anything and anyone into a dish.",
					"Color": "#ff9f9f",
					"Main": false,
					"Image": "erwimages/chars/Xiukai.png",
					"Lore": "Stop gazing, or I will fill that dumpling with you.<br><br>Xiukai is a Chinese cook running his own small restaurant in Daegu, South Korea.<br><br>He used to be a cook for one of the closest associates of a high-ranking government official. His connections, and pockets, ran deep.<br><br>After his boss was disposed of overnight, he escaped to South Korea.<br><br>He claims that he was once skinny with an elegant posture...<br><br>He is good at controlling himself, taking from his experience serving his former boss.",
					"Description": "Dagger Xiukai is a strong late game scaler that relies on cooking infinitely in order to become a complete juggernaut in the late game. With Dagger, a bit more mobility is given compared to the traditional Xiukai playstyle.",
					"Role": "Fighter",
					"Difficulty": "Hard",
					"Power Spike": "Late Game",
					"HP": "140",
					"Basic Attack": "0 + (attack power) damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Lost in the Sauce (1 day cooldown) - Throw a can of sauce at someone, dealing 10 damage to a target and slowing them, increasing their cooldowns by 10%.",
						"Heavy Meal (1 day cooldown) - Slam the ground with your wok, dealing 10 damage to all enemies in the current zone and slowing them, increasing their cooldowns by 20%. If they have a status, deal an additional 0 + (attack power) damage.",
						"Wok it Off (1 day cooldown) - Spin with your wok, dashing to an adjacent zone, or dash to a target in the current or adjacent, deal 0 + (attack power) damage to them, and stun them for 1/10th of a day if they have a status."],
					"Level 4": ["Burnt to a Crisp (3 day cooldown) - Fire up your mobile kitchen, dealing 0 + (stacks) damage 3 times to all enemies in the current zone, becoming status immune for each attack, each taking 1/10th of a day. Deal an extra 10 damage each time to enemies with a status on them.",
						"Cloak and Dagger (1 day cooldown) - Become one with the shadow, turning invisible for 1 day, reactivate on a target to backstab and deal 10 damage to them."],
					"Level 7": ["Eat Good (Food/Drink required) - Throw a piece of food or drink at someone, dealing the amount of damage that would be usually healed to them.",
						"Fine Chopping (1 day cooldown) - Chop someone up finely, dealing 5 damage 3 times to a target in the current zone, each taking 1/10th of a day and slowing the target, increasing their cooldowns by 5% each strike. Slow the target with an additional 5% cooldown increase per attack with a status that isn't slow on them.",
						"Unlock Angry Chef."],
					"Level 10": ["Soup Dumpling (4 day cooldown) - Fly into the air and fall onto a zone, squishing any enemy in the zone into a dumpling, stunning them for 1/5th of a day and dealing 0 + (stacks) damage.",
						"Unlock Knife Sharpening.",
						"Wok it Off has a 1/2th day cooldown."],
					"Passives": ["Juggernaut Chef - Gain 3 stacks per Uncommon food or drink cooked, 5 stacks per Rare food or drink cooked, and 10 stacks per Epic/Legendary food or drink cooked. Each stack gives 1 HP.",
						"Angry Chef (Level 7) - Reset your basic attack cooldown if you cooked at least one food or drink this day.",
						"Knife Sharpening (Level 10) - Basic attacks deal extra damage based on stack count."]
				}
			]
		}
	},
	{
		"Dual Swords (DS)":
		{
			"Description": "An aggressive set of characters that want to get into the fray and eliminate enemies with a rapid amount of basic attacks.",
			"CharList":
			[
				{
					"Name": "Camilo",
					"Summary": "A dancer with immense beauty and some narcissism, which he uses to charm his enemies into death.",
					"Color": "#ff9f9f",
					"Main": true,
					"Image": "erwimages/chars/Camilo.png",
					"Lore": "The pure beauty of a flower is nothing compared to you.<br><br>An astounding flamenco dancer, Camilo always commands attention the moment he walks into the room. His captivating beauty is rivaled only by his dance talent. Camilo is well aware of this exceptional beauty and talent and relishes basking in the attention he gets.<br><br>A bit of a narcissist, Camilo is always brutally honest and doesn't particularly care to empathize with the pain or sorrow of those around him.<br><br>He is seemingly always carrying a rose, except nobody knows where he even got it from.<br><br>Though fluent in English, he likes to sprinkle his favorite Spanish words into conversation.",
					"Description": "Dual Sword Camilo is a mobile dancing fighter with insane movement on the map, capable of relentlessly chasing enemies and dashing away in order to constantly deal area of effect damage whenever he pleases. Camilo with Dual Swords focuses on applying many basic attacks through weaving abilities.",
					"Role": "Fighter",
					"Difficulty": "Medium",
					"Power Spike": "Early-Mid Game",
					"HP": "120",
					"Basic Attack": "0 + (attack power) damage (minimum 5 damage)",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Vuelta (1 day cooldown, 2 uses a day) - Spin elegantly, dealing 0 + (attack power) damage to a target in the current zone.",
						"Cierre (1 day cooldown) - Dance elegantly, dashing to an adjacent zone, or dash to a target in the current or adjacent and deal 20 damage to them.",
						"Al Compas - Dash to a target in the current zone and deal 5 damage to them. Can only be used once per target per day. Can use Vuelta or Gran Vuelta alongside of this ability.",
						"De Mi Caballo (Can only be used after Al Compas is used on the target) - Dash to a target that has been targeted by Al Compas in the current zone and deal 5 damage to them, and stun them for 1/10th of a day."],
					"Level 4": ["Duende (2 day cooldown) - Dance wildly and happily, dashing into an adjacent zone and returning to the current zone 3 times, dealing 5 damage to all targets in both zones, becoming status immune for each attack, and healing for 10 HP, each taking 1/8th of a day and can be used any time in the day this ability was used. The last attack stuns all enemies in that zone for 1/10th of a day.",
						"Dual Sword Rampage (2 day cooldown) - Rampage and thrash around, dealing 20 damage to a target. Reactivate to dash to an adjacent zone.",
						"Gran Vuelta (Can only be used if two Vueltas were used today) - Deal 10 + (attack power) damage to a target in the current zone and heal yourself for 20 HP."],
					"Level 7": ["Flamenco (2 day cooldown) - Spin to an adjacent zone, dealing 10 damage to all enemies in both zones, and spin again to another zone adjacent to that zone, dealing damage 10 damage to all zones in both zones.",
						"Unlock Paso.",
						"Ole is triggered on every basic attack regardless of cooldown."],
					"Level 10": ["Gran Entrada (2 day cooldown) - Spin in an extended circle, pulling everyone from all adjacent zones into your zone, dealing 20 damage."],
					"Passives": ["Ole! (1 day cooldown) - Dealing damage creates a 10 HP shield. Any healing done by food or drinks is negated with this damage.",
						"Dual Sword Attack - Basic attacks hit twice, but hit for half damage.",
						"Paso (Level 7) - Your basic attack cooldown is reset upon using 4 abilities."]
				},
				{
					"Name": "Cathy",
					"Summary": "A nurse with one too many malpractices and can malpractice on her enemies with ease.",
					"Color": "white",
					"Main": false,
					"Image": "erwimages/chars/Cathy.png",
					"Lore": "I've grown used to blood and corpses.<br><br>Cathy is often a kind and sentimental doctor - perhaps a little too much so. Time and again, she grew too attached to her patients, ultimately causing her to lose her job due to several malpractice cases - all stemming from her \"sympathy\".<br><br>She opened up her very own free medical clinic, supported by the locals just enough for her to get by. Those that do visit her clinic are all aware of her kindness, but are also aware of her peculiarity. If they come down with something more serious, they tend to skip Cathy's clinic and visit a bigger hospital.",
					"Description": "Dual Sword Cathy is more focused into assassination, going into sustaining damage on opponents down with many basic attacks, applying steady bleeds and resetting the basic attack cooldown over many ability uses. Cathy still maintains her versatile nature and can transition into a more defensive tank with healing, or a more offensive fighter with repeated damage.",
					"Role": "Assassin",
					"Difficulty": "Medium",
					"Power Spike": "Mid Game",
					"HP": "120",
					"Basic Attack": "10 damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Double Bypass (1 day cooldown) - Strike at the heart, dashing to an adjacent zone, or dash to a target in the current or adjacent and deal 0 + (attack power) damage to them.",
						"Amputation (1 day cooldown) - Amputate someone, dealing 0 + (attack power) damage to a target and slowing them, increasing their cooldowns by 30%.",
						"Suture (2 day cooldown) - Suture two targets together, either dealing 10 damage to a target and rooting them for 1/10th of a day, or if two targets are in the zone, suturing both targets, dealing 10 + (attack power) damage, and stunning them both for 1/4th of a day."],
					"Level 4": ["Emergency Surgery (2 day cooldown) - Surgically cut through two zones, dashing between the current and adjacent zone, in which enemies in either zone take 10 + (attack power) damage and allies in either zone heal for 0 + (attack power) HP.",
						"Dual Sword Rampage (2 day cooldown) - Rampage and thrash around, dealing 20 damage to a target. Reactivate to dash to an adjacent zone.",
						"Unauthorized Healing (1/3rd day cooldown) - Use some underhanded healing tactics, dealing 5 damage to a target, and healing the target the next day for 40 HP.",
						"Precise Incision (1/2th day cooldown) - Precisely cut someone twice, using basic attacks twice on a target and applying a DoT bleed that triggers in 1/5th of a day."],
					"Level 7": ["Organ Stripping (1 day cooldown) - Cut open an enemy, dealing 10 damage and sleep (stun) the target for 1/2th of a day, if the target is attacked before they are unstunned, the target wakes up and is disrupted for the remaining duration.",
						"Unlock Cutting Edge."],
					"Level 10": ["Wrong Operation (1/2th day cooldown) - Cut open a target twice, applying two statuses of your choice (not bleed or slow) to the target for 1/10th of a day."],
					"Passives": ["Under the Knife - Every 5 hits of abilities or basic attacks inflicts a bleed that deals an additional 10 damage to the target in 1/2th of a day.",
						"Post Op (1 day cooldown) - Upon using an ability, create a 10 HP shield.",
						"Dual Sword Attack - Basic attacks hit twice, but hit for half damage.",
						"Cutting Edge (Level 7) - Every third ability used this day resets the basic attack cooldown."]
				},
				{
					"Name": "Jackie",
					"Summary": "A serial killer who wants to mass murder anyone she can to sate her hunger.",
					"Color": "#ff9f9f",
					"Main": false,
					"Image": "erwimages/chars/Jackie.png",
					"Lore": "More...more...more!!<br><br>Jackie first discovered the thrill of murder after killing the wife and daughter of a prominent political family, the Winslairs. She went on to become a serial killer with a bodycount of over 30 people.<br><br>Her name 'Quilt' comes from her modus operandi of slicing the victims' bodies into small indistinguishable pieces. The resulting pieces are too small to identify, unless stitched together like a quilt.<br><br>She gained infamy for her rather inhumane killing methods and meticulous clean-up.<br><br>The body of Jackie's first victim, Angela Winslair, was never found.",
					"Description": "Dual Sword Jackie is just as fast as Dagger and Axe in terms of scaling up to become a threat. Jackie focuses on dealing repeated damage with bleeds applied and sustain damage. Jackie can chase endlessly and push into enemies well after combat due to the amount of bleed damage she can apply with this weapon.",
					"Role": "Fighter or Assassin",
					"Difficulty": "Easy",
					"Power Spike": "Early-Mid Game",
					"HP": "120",
					"Basic Attack": "0 + (attack power) damage (Minimum 5 damage)",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Hack and Slash (1/2th day cooldown) - Hack and slash someone, inflicting a basic attack on them twice and applying a DoT bleed dealing 5 damage in 1/8th of a day.",
						"Adrenaline Burst (1 day cooldown) - Fuel yourself for battle, reducing cooldowns by 5% and have the next basic attack heal for 10 HP.",
						"Leaping Strike (1 day cooldown) - Jump up, dashing to an adjacent zone, or dash to a target in the current or adjacent and deal 5 damage to them."],
					"Level 4": ["Chainsaw Massacre (1 day cooldown) - Take out a menacing chainsaw, having the next basic attacks apply a DoT bleed dealing 5 damage in 1/8th of a day. Reactivate your chainsaw to deal 20 damage to a target.",
						"Dual Sword Rampage (2 day cooldown) - Rampage and thrash around, dealing 20 damage to a target. Reactivate to dash to an adjacent zone.",
						"Hamstring Hit (1/2th day cooldown) - Use basic attacks twice on a target and root the target for 1/6th of a day.",
						"Rip and Tear (1/2th day cooldown) - Use basic attacks twice on a target and reduce enemy’s healing by 25%.",
						"Unlock Thirst."],
					"Level 7": ["Unlock Bleed Out.",
						"Unlock Hungry for Murder.",
						"Unlock Blood Hunt."],
					"Level 10": ["Chainsaw Massacre’s bleed per basic attack is now on permanently with the reactivation being separate as the ability."],
					"Passives": ["Bloodfest - Gain 10 attack power for 1 day upon killing a player.",
						"Dual Sword Attack - Basic attacks hit twice, but hit for half damage.",
						"Thirst (Level 4) - Bleeding targets bleeding from you are seen globally.",
						"Bleed Out (Level 7) - Basic attacks apply a DoT bleed dealing 5 damage next day.",
						"Hungry for Murder (Level 7) - Enemies that are under 30% HP are seen globally.",
						"Blood Hunt (Level 7) - Bleeding targets bleeding from you have their HP shown to you."]
				},
				{
					"Name": "Yuki",
					"Summary": "A swordsman with a perfect posture and clean composure, able to slice any target with precision.",
					"Color": "#d3d3d3",
					"Main": false,
					"Image": "erwimages/chars/Yuki.png",
					"Lore": "Is there anything I can do for you?<br><br>A sharp high school student, Yuki is a member of the kendo club with flawless demeanor and decorum.<br><br>He never loses his composure and takes on new challenges with the confidence of a seasoned vet.<br><br>His perfectionism is sturdy, yet fragile, like a fortress of ice and glass.",
					"Description": "Dual Sword Yuki is a more aggressive fighter with burst mechanics and area of effect abilities, along with some CC abilities. Yuki is less versatile with this weapon, but still maintains a theme of trying to reapply percent damage on repeat with multiple attacks.",
					"Role": "Fighter",
					"Difficulty": "Medium",
					"Power Spike": "Early-Mid Game",
					"HP": "120",
					"Basic Attack": "0 + (attack power) damage (minimum 5 damage)",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["From Head to Toe (1 day cooldown) - Strike someone, dealing 0 + (attack power) damage to a target twice and slowing them, increasing their cooldowns by 10%. If a cufflink was used, stun them for 1/8th of the day too.",
						"Button Up (2 day cooldown) - Prepare yourself and button your suit, gaining back max cufflinks.",
						"Dashing Gentleman (1 day cooldown) - Elegantly dash to an adjacent zone, or dash to a target in the current or adjacent, dealing 5 damage to them, and disarming them for 1/8th of a day.",
						"Pinpoint Hits (1 day cooldown) - Pinpoint someone, striking a target with two basic attacks, avoiding disarms and disrupts. If a cufflink was used, ignore blinds and evasion too."],
					"Level 4": ["Coup de Grace (3 day cooldown) - Strike hard and fast with a powerful swordsman technique, dealing 10 damage today to all enemies in the current zone, deal 25% max HP damage and slow everyone hit by the ability, increasing their cooldowns by 50%. Instantly kills wild animals.",
						"Dual Sword Rampage (2 day cooldown) - Rampage and thrash around, dealing 20 damage to a target. Reactivate to dash to an adjacent zone.",
						"Giant Killer (2 cufflinks) - Attempt to faze a stronger enemy, using both cufflinks on a target in the current zone."],
					"Level 7": ["Disarming Strike (1 day cooldown) - Attempt to prevent someone from using weapons, dealing 5 damage to a target and disarming them for 1/8th of a day. If a cufflink was used, deal an additional 5 + (attack power) damage.",
						"Not a Speckle (2 day cooldown) - Clean your suit, temporarily gaining 4 cufflinks for today.",
						"Perfect Fit has 6 Cufflinks now."],
					"Level 10": ["Flawless Victory (2 day cooldown) - Perfectly execute your plan, if you kill or help kill an enemy this day, gain 10 attack power, be invulnerable and immune to all statuses for the rest of the day, and instantly gain 4 cufflinks."],
					"Passives": ["Perfect Fit - Store 4 cufflinks, each cufflink will deal an extra 10% max HP damage on any damaging ability or basic attack use. Cufflinks regenerate upon staying out of combat after 1/4th of a day (not doing any damage for 1/4th of a day), or by using specific abilities.",
						"Dual Sword Attack - Basic attacks hit twice, but hit for half damage."]
				}
			]
		}
	},
	{
		"Glove":
		{
			"Description": "Versatile melee characters that can fit in either a more tanky supportive category or a more damage dealing and play making strategy.",
			"CharList":
			[
				{
					"Name": "Blackwell",
					"Summary": "A grizzled soldier who lost his ability to walk, yet will still walk over any opponent he faces.",
					"Color": "#d3d3d3",
					"Main": true,
					"Image": "erwimages/chars/Blackwell.png",
					"Lore": "No legs, no problem.<br><br>Lt. Blackwell is a stern soldier with many accolades and badges. Blackwell has experienced over 4 decades of war and knows the ins and outs of many military installations.<br><br>Blackwell lost his legs over being a prisoner of war, but that didn’t stop him, he was still capable of killing hundreds of people alone with no legs and only his fists. In order to escape prison in a hostile country, Blackwell took a plea deal to enter the experiment.<br><br>Never get on Blackwell’s bad side, or he will rip you in half, literally.",
					"Description": "Blackwell is a hardened soldier with a unique gimmick around being a very strong unit, but also hard to control. His abilities allow him to push and move to edges of the map, but not close by. He also deals high damage, but also is dependent on abilities and has limited controllable mobility.",
					"Role": "Tank or Fighter",
					"Difficulty": "Hard",
					"Power Spike": "Mid Game",
					"HP": "120",
					"Basic Attack": "10 damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Sidecast (1 day cooldown) - Smash your wheelchair’s side into someone, dealing 0 + (attack power) damage, disrupting them for 1/10th of a day,  and granting 10 damage reduction to abilities and basic attack.",
						"Wheel Sweep (1 day cooldown) - Spin your wheelchair, dealing 10 damage to all enemies in the current zone and healing yourself for 5 HP per enemy hit.",
						"Happy Wheels (1 day cooldown) - Launch yourself off a ramp and smash into a target in a non adjacent or current zone, dealing 10 + (attack power) damage, dealing 10 damage to yourself, and shielding yourself for 20 HP."],
					"Level 4": ["Military Hazing (3 day cooldown) - Torture someone with a military hazing ritual, leaving the target at 1 HP but making them invincible and immune to statuses today.",
						"Uppercut (1 day cooldown) - Punch someone, dealing 0 + (attack power) damage to a target. Counts as a basic attack.",
						"Ramming Speed (2 day cooldown) - Ram someone and drag them to the edge of the map, putting both of you in that zone and dealing 10 + (attack power) damage.",
						"Strongarm (1 day cooldown) - Toss someone to the edge of the map, pushing them a zone at the edge of the map and dealing 20 damage."],
					"Level 7": ["Rocket Boosters (2 day cooldown) - Your movement cooldown today is 1/10th of a day.",
						"Unlock V8 Engine.",
						"Unlock Armored Wheels."],
					"Level 10": ["Military Coup (3 day cooldown) - Set up a coup, pushing each person in your current zone to a selected edge of the map zone. You must push everyone including yourself to an edge of the map zone and can select who goes to which zone."],
					"Passives": ["Wheelchair Expert - Your movement cooldown is 1/3rd of a day, however, you can only move to non-adjacent zones.",
						"Legless Yet Strong - In Death’s Door, you are stunned, but can still move to non-adjacent zones.",
						"V8 Engine (Level 7) - You gain 5 Attack power for 1 day and your cooldowns reduce by 1/10th of a day every time you move or push someone to another zone.",
						"Armored Wheels (Level 7) - Immune to damage over time effects and roots."]
				},
				{
					"Name": "Hyunwoo",
					"Summary": "A brawler who takes on far too many fights for his own good, but has enough knack for survival and brawling to win them.",
					"Color": "#ff9f9f",
					"Main": true,
					"Image": "erwimages/chars/Hyunwoo.png",
					"Lore": "It couldn't get any worse.<br><br>Hyunwoo had no ambitions or dreams. All he felt was... emptiness. To fill the void within, he turned to the thrill of constantly picking fights and brawls.<br><br>Despite all his attempts, the emptiness and anxiety inside him only grew.<br><br>He has a compulsion for a lottery ticket to be the first thing he buys as an adult.<br><br>Hyunwoo has always been more attached to his friends than his family.",
					"Description": "Glove Hyunwoo is tanky and is immune to a lot of statuses, so Hyunwoo is a sturdy versatile character that can go different directions in build pathing. Hyunwoo can do some work all game, and is rather safe as a character.",
					"Role": "Tank or Fighter",
					"Difficulty": "Easy",
					"Power Spike": "Mid Game",
					"HP": "140",
					"Basic Attack": "0 + (attack power) damage (minimum 5 damage)",
					"Basic Attack Cooldown": "1/2th day cooldown",
					"Level 1": ["Stomping Foot (1 day cooldown) - Stomp your foot, dealing 5 damage to a target and slowing the target, increasing their cooldowns by 10%. Counts as a basic attack",
						"Bluff (1 day cooldown) - Bluff an attack, becoming immune to statuses for 1/8th of the day.",
						"First Attack (1 day cooldown) - Charge forward, dashing to an adjacent zone, or push both you and a target in the current zone to an adjacent zone, dealing 5 damage to them."],
					"Level 4": ["Haymaker (2 day cooldown) - Charge up a massive punch for 1/10th of a day, dealing 20 + (attack power) damage to a target in the next 1/10th of a day. Counts as a basic attack, cannot be blinded or disarmed.",
						"Uppercut (1 day cooldown) - Punch someone, dealing 0 + (attack power) damage to a target. Counts as a basic attack.",
						"Street Brawl (1 day cooldown cooldown) - Yell at all enemies in the current zone, reducing their attack power by 5 this day."],
					"Level 7": ["Sucker Punch (1 day cooldown) - Sucker punch someone, dealing 15 damage and stun the target for 1/10th of a day. Counts as a basic attack.",
						"Unlock Hoodlum."],
					"Level 10": ["Fight Me! (2 day cooldown) - Taunt a target, redirect all targeted abilities to be used only on you for 1/4th of a day, and return a basic attack to anyone who attacks you.",
						"Riot! (1 day cooldown) - Call for a fight, disrupting all enemies in the zone for 1/10th of a day."],
					"Passives": ["Dogfight - Every third basic attack heals for 10% HP.",
						"Hoodlum (Level 7) - Every basic attack grants 5 attack power for today."]
				},
				{
					"Name": "Jan",
					"Summary": "A muay thai fighter that specializes in kickboxing and fighting with an endless barrage of attacks.",
					"Color": "#b6d7a8",
					"Main": true,
					"Image": "erwimages/chars/Jan.png",
					"Lore": "Time for some action!<br><br>Jan is the eldest son of a famous Muay Thai athlete and a kickboxer who always puts on an entertaining show. Along with his showmanship, his public volunteer work helped him gain a number of fiercely loyal fans.<br><br>Jan and his younger brother started learning Muay Thai while studying abroad, but he was involved in a violent altercation one night, causing his father to send him back to the Netherlands and disrupting his life.<br><br>He entered a rebellious phase, often turning to violence and relying on substances, but was able to overcome it through sheer will and eventually debuted as a kickboxer.<br><br>Outside the fight, he is usually cheerful and light, the moment the first bell rings, it's like a switch is flipped inside his head. Jan's trademark is his agility and barrage of seemingly endless attacks.",
					"Description": "Glove Jan is a strong fighter that can fill a lot of different roles, but all generally revolve around being a heavy threat in the early game. Jan can do a more sustained fighting style around landing many basic attacks, or a more sustained fighting style with significant ability use. In addition, he has a multitude of strong CC tools to peel and initiate for his teams.",
					"Role": "Tank or Fighter",
					"Difficulty": "Hard",
					"Power Spike": "Early-Mid Game",
					"HP": "120",
					"Basic Attack": "0 + (attack power) damage (minimum 5 damage)",
					"Basic Attack Cooldown": "1/2th day cooldown",
					"Level 1": ["Knee Strike (1/2th day cooldown) - Kick someone with your knee, dealing 5 damage to a target and slowing the target, increasing their cooldowns by 5%. Spend 5 Unyielding to decrease the target’s attack power by 5 for today.",
						"Tomahawk Roundhouse (2 day cooldown) - Roundhouse Kick someone, dealing 5 damage and knocking back a target to an adjacent zone. Spend 5 Unyielding to knock back all enemies in the zone.",
						"Bob and Weave (1 day cooldown) - Dash to an adjacent zone of the map and reset your basic attack cooldown. Spend 5 Unyielding to reset the cooldown of both Knee Strike and Tomahawk Roundhouse.",
						"Leaping Knee (Only usable after Knee Strike) - Kick someone fiercely, dealing 10 damage and stunning the target 1/10th of a day. Spend 5 Unyielding to reset the cooldown of Bob and Weave."],
					"Level 4": ["The Tetragon (3 day cooldown) - Instantly gain 5 stacks of Unyielding. Summon ropes around the zone for 1 day, dealing 10 damage to all enemies who attempt to leave, and slowing them, increasing their cooldowns by 30%. In addition, hitting an enemy with a knockback will not knock them back, but stun them in the zone for 1/5th of a day.",
						"Uppercut (1 day cooldown) - Punch someone, dealing 0 + (attack power) damage to a target. Counts as a basic attack.",
						"Unlock Kickbox Legend."],
					"Level 7": ["Backward Kick (2 day cooldown) - Kick with both legs backward, dealing 10 damage and knocking a target back to an adjacent zone. Knock yourself into another adjacent zone. Spend 5 Unyielding to allow yourself or the target to stay in the same zone or move to the chosen adjacent zone.",
						"Evasive Movement (2 day cooldown) - Take evasive actions for 1/5th of a day. Spend 5 Unyielding to evade all basic attacks this day.",
						"Unlock Unrelenting Champion."],
					"Level 10": ["Unlock In the Groove."],
					"Passives": ["Unyielding - Gain a stack of Unyielding every basic attack or ability use. Some abilities allow you to spend stacks of Unyielding in order to enhance the ability.",
						"Kickbox Legend (Level 4) - Reset your basic attack after an Unyielding ability is used.",
						"Unrelenting Champion (Level 7) - Every Unyielding ability heals you for 10% HP.",
						"In the Groove (Level 10) - Passively gain 5 Unyielding per day."]
				},
				{
					"Name": "Leon",
					"Summary": "A surfer and soldier that likes cuteness despite his strength as a fighter.",
					"Color": "#c9daf8",
					"Main": true,
					"Image": "erwimages/chars/Leon.png",
					"Lore": "The weak always fall behind.<br><br>Leon was raised by a highly decorated soldier who always drilled the importance of \"manliness\" into him.<br><br>He was always under immense pressure to not show any weakness, both from himself and others. The suppression of his feelings caused them to manifest themselves as a desire for material possessions - particularly \"cute\" things.<br><br>Leon has tons of pictures of kittens on his phone and was caught in his room wearing rather... cute clothing once or twice.",
					"Description": "Glove Leon is tanky, with lots of shielding, mobility and potential burst windows. Leon is very safe and can potentially support others with CC and shields, or play to burst other players quickly with lots of late game items.",
					"Role": "Tank or Fighter",
					"Difficulty": "Easy",
					"Power Spike": "Mid-Late Game",
					"HP": "140",
					"Basic Attack": "0 + (attack power) damage (minimum 5 damage)",
					"Basic Attack Cooldown": "1/2th day cooldown",
					"Level 1": ["Waterway (1 day cooldown) - Create a waterway, dealing 10 damage to all enemies in an adjacent zone and another adjacent zone after that, and spawning a pool in both zones.",
						"Cannonball (1/2th day cooldown) - Create a water bubble on someone, shielding 30 HP on a target, the target deals 10 extra damage in the next three basic attacks and abilities they cast. Spawn a pool in the current zone.",
						"Duck Dive (1 day cooldown) - Dive to a zone that has a pool in it, dealing 10 damage and stunning any enemies in it for 1/8th of a day."],
					"Level 4": ["Surf’s Up (2 day cooldown) - Surf up a huge wave, dealing 20 damage to all enemies in the zone, and knocking them back to an adjacent zone. Spawns a pool in the current zone.",
						"Uppercut (1 day cooldown) - Punch someone, dealing 0 + (attack power) damage to a target. Counts as a basic attack.",
						"Unlock Geyser."],
					"Level 7": ["Swimming Goggles (1 day cooldown) - Put on your swimming goggles, checking all targets in a pooled zone, giving information of what characters are in that zone along with their equipped weapon.",
						"Unlock Pool Shark."],
					"Level 10": ["Shark Attack! (1/2th day cooldown) - Barrage a target with 5 punches in a row, dealing 5 damage each. Each attack counts as a basic attack.",
						"Pool Day! (2 day cooldown) - Creates pools in every zone."],
					"Passives": ["Human Torpedo - Gain vision in a zone with a pool. Pools last for 1 day.",
						"Geyser (Level 4) - Every third basic attack creates a pool in any adjacent zone that you select.",
						"Pool Shark (Level 7) - Deal 10 damage per basic attack while in a pool."]
				},
				{
					"Name": "Nicky",
					"Summary": "A stunt actor that gets angry easily and quickly, but can use that anger to combat enemies even more efficiently.",
					"Color": "orange",
					"Main": true,
					"Image": "erwimages/chars/Nicky.png",
					"Lore": "What?! Leave me alone! .... phew okay. What's up?<br><br>Nicky is a stunt actress who possesses immense strength despite her small stature and cute looks. Just don't call her cute, she hates that. She's always acting tough - even if she's embarrassed, but her facial expressions always give her away. (There's a reason she's a STUNT actress, after all)<br><br>Nicky seems a little rough around the edges, but she's always there to care for those in need of help.<br><br>She also never forgets a face, but isn't so good with names, often putting her in awkward situations or causing her to call a lot of people \"buddy\" or \"dude\".",
					"Description": "Glove Nicky casts lots of fighting spells in order to either CC down enemies into oblivion, constantly apply pressuring damage, or peel and escape. Nicky also has multiple defensive options, such as parrying, and can escape from problems easily.",
					"Role": "Tank or Fighter",
					"Difficulty": "Medium",
					"Power Spike": "Mid-Late Game",
					"HP": "120",
					"Basic Attack": "10 damage",
					"Basic Attack Cooldown": "1/2th day cooldown",
					"Level 1": ["Slugfest (1 day cooldown) - Punch forward, dashing to an adjacent zone, or dash to a target in the current or adjacent, deal 0 + (attack power) damage to them, and stun them for 1/10th of a day.",
						"Guard & Reverse (1 day cooldown) - Block the next attack, becoming invulnerable and immune to all statuses for 1/10th of a day. If an enemy attacks during this action, root them for 1/10th of a day, deal 5 damage, and gain 10 Rage.",
						"Knockout Punch (1 day cooldown) - Extend your fists, dealing 0 + (attack power) damage to a target and slow the target, increasing their cooldowns by 10%.",
						"Body Blow (Only usable after Slugfest) - Slam someone, dealing 0 + (attack power) damage to a target."],
					"Level 4": ["Pure Rage Uppercut!! (10 Rage) - Aggressively punch someone, selecting a target on this day, charge for 1/10th of a day to dash to the target through any zone and deal 5 + (attack power) damage, stunning the target for 1/5th of a day.",
						"Uppercut (1 day cooldown) - Punch someone, dealing 0 + (attack power) damage to a target. Counts as a basic attack.",
						"Stunt Actor (1/2th day cooldown) - Toss a target to an adjacent zone.",
						"Unlock Furious Punches."],
					"Level 7": ["Sundering Fist (10 Rage) - Smash the zone, causing an earthquake, dealing 10 damage and stunning any enemy in the zone multiple times over 1/10th of a day intervals for 1/4th of the day.",
						"Fury Jab!! (10 Rage) - Extend your fists in rage, dealing 0 + (attack power) damage to a target and stunning the target for 1/8th of a day."],
					"Level 10": ["Unlock Now I’m Angry!.",
						"Knockout Punch and Fury Jab!! abilities become an area of effect for the current zone, hitting all enemies."],
					"Passives": ["Short Tempered - Every time damage is taken or damage is done, gain 1 Rage.",
						"Furious Punches (Level 4) - Basic Attacks become an area of effect, dealing 5 damage to all other enemies in the current zone.",
						"Now I’m Angry (Level 10) - Passively gain 5 Rage per day."]
				}
			]
		}
	},
	{
		"Guitar":
		{
			"Description": "Not done yet",
			"CharList":
			[
			]
		}
	},
	{
		"Hammer":
		{
			"Description": "Tankier melee characters that can fill different roles, applying lots of crowd control and damage.",
			"CharList":
			[
				{
					"Name": "Eleven",
					"Summary": "A mukbang streamer with a wealthy background, using her fanbase and resources to gain the upper hand.",
					"Color": "#ead1dc",
					"Main": true,
					"Image": "erwimages/chars/Eleven.png",
					"Lore": "The world is full of wonderful things! And food!<br><br>Although young, Eleven is a seasoned streaming pro with her very own show!<br><br>On The Eleventh Table, she travels to different places and reviews street food, scenery, hidden attractions, and anything in-between! She's yet to really find something she greatly dislikes. The first time she tried Youtiao, a popular Chinese food, she decided to focus on making more street food content. Eleven harbored a fandom of passionate fans due to her bright, cute voice, sincere reactions, and overall optimism.<br><br>Her usual constant stream of enjoyable content came to an abrupt halt after it was leaked that she is the only daughter in an extremely wealthy family.",
					"Description": "Hammer Eleven is a unique food based tank that wants to constantly channel for some turns to enhance her abilities. Eleven can apply many statuses, mostly revolving around taunting enemies to attack her and applying stasis to enemies to set up other abilities and area of effect abilities. Eleven can cook a unique food item and generate additional credits quickly.",
					"Role": "Tank or Fighter",
					"Difficulty": "Medium",
					"Power Spike": "Mid-Late Game",
					"HP": "140",
					"Basic Attack": "10 + (attack power) damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Burger Queen (1 day cooldown) - Slam your burger, dealing 10 damage to a target and slow the target, increasing their cooldowns by 10%. Can be charged for 1/8th of a day to deal 10 + (attack power) damage and increase their cooldowns by 20%.",
						"Food For Thought (1 day cooldown) - Attract someone with food, taunting a target, redirecting all targeted abilities to be used only on you for 1/6th of a day. Can be charged for 1/8th of a day to taunt all enemies in the zone instead. Damage taken is reduced by 50% during the taunt.",
						"On Air (1 day cooldown) - Prepare your camera, dashing to a target in the current zone and dealing 0 + (attack power) damage to them. Can be charged for 1/8th of a day to dash to adjacent zones, either to a target or without a target."],
					"Level 4": ["Calorie Cyclone (2 day cooldown) - Summon a cyclone of burger sliders, dropping sliders in every adjacent zone. Basic attacks hit twice for 1/5th of a day. The next ability you cast is fully charged.",
						"Armor Piercing (1 day cooldown) - Smash someone with your hammer, dealing 10 damage to a target and removing any damage resistance they have.",
						"Unlock Going Hamburger."],
					"Level 7": ["Food Channel (2 day cooldown) - Put all targets in the zone in stasis for 1/6th of a day. The only action any target in the current zone can do is eat food.",
						"Food Pictures! (1 day cooldown) - Snap a photo of food and post it on social media, gaining 5 credits.",
						"Unlock Oil Prince Viewers."],
					"Level 10": ["Unlock Social Media Legend."],
					"Passives": ["#11 Combo Meal - Only Eleven can create the #11 Combo Meal food, a special Epic food that heals significantly more than most other foods. Food and drink healing is increased by 25%.",
						"Ground Beef - Basic attacks and abilities drop sliders in an adjacent zone. Collecting the sliders heal for 10 HP and fully charge your next ability.",
						"Going Hamburger (Level 4) - Basic attack cooldown reduction built is always doubled.",
						"Oil Prince Viewers (Level 7) - Gain double credits upon any active method of gaining credits, such as killing enemies.",
						"Social Media Legend (Level 10) - Channeling abilities grant evasion and stun immunity during the channel."]
				},
				{
					"Name": "Magnus",
					"Summary": "A biker that wants to assert his strength against others to prove his power of his biker gang.",
					"Color": "white",
					"Main": false,
					"Image": "erwimages/chars/Magnus.png",
					"Lore": "The Legendary Biker, Magnus!<br><br>Magnus is the leader of the prominent motorcycle gang found across the US, Reaper's Wheel. Even before he took the helm, the group was well-known. Other gangs and bikers tried to intimidate them wherever they went, resulting in gang fights and turf wars.<br><br>Magnus, however, would always emerge victorious, no matter how many he was up against. He became a living legend amongst the bikers across the country and the rest of Reaper's Wheel. Magnus is proud of his absolute power.<br><br>He has a knack for aggravating and taunting others.<br><br>His catchphrase words are \"Power!\" and \"Persistence!\"",
					"Description": "Hammer Magnus is a burst fighter focused on dealing significant damage quickly with the burst damage on his bike. Magnus also deals significant damage while being immune to statuses for a long duration of time. Magnus is a very tanky character with a multitude of lockdown capabilities and versatile build options.",
					"Role": "Tank or Fighter",
					"Difficulty": "Easy",
					"Power Spike": "Mid Game",
					"HP": "140",
					"Basic Attack": "5 damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Broken Bullet (1 day cooldown) - Deal 0 + (attack power) damage to a target in the current or adjacent zone, slow the target hit, increasing their cooldowns by 10%.",
						"17 vs 1 (1 day cooldown) - Deal 0 + (attack power) damage 3 times to all targets in the current zone, becoming status immune for each attack, each taking 1/10th of a day.",
						"Heavy Strike (1 day cooldown) - Deals 10 damage to the target, and knocks them back to an adjacent zone."],
					"Level 4": ["Bike From Hell (3 day cooldown) - Get on a bike and crash into a zone on the map to deal 10 + (attack power) damage to everyone in that zone, moving to that zone.",
						"Armor Piercing (1 day cooldown) - Smash someone with your hammer, dealing 10 damage to a target and removing any damage resistance they have.",
						"Unlock Anti-Explosive Vest."],
					"Level 7": ["Hammer Down (2 day cooldown) - Smash the ground, dealing 0 + (attack power) damage, and stunning all enemies in the zone for 1/5th of a day.",
						"Rev Up (1 day cooldown) - Give the target 50% tenacity against statuses today.",
						"Unlock Biker’s Grit."],
					"Level 10": ["Biker Gang (3 day cooldown) - Call a biker gang to the current or an adjacent zone, blocking the zone off for all non-allies and rooting all enemies inside for 1 day. Any non-ally attempting to enter will simply not be able to enter the zone for 1 day. Cannot be used in a red zone.",
						"Uber Biker (2 day cooldown) - Drive straight to an ally, selecting a friendly target and move them alongside you to any zone."],
					"Passives": ["Tough Body - Gain 1 damage reduction per 20 less HP you have.",
						"Anti-Explosive Vest (Level 4) - Block 50% damage from any area of effect abilities.",
						"Biker’s Grit (Level 7) - Basic attacks reduce your cooldowns by 20%."]
				},
				{
					"Name": "Sua",
					"Summary": "A librarian with a knack for books, able to convert her knowledge into power and stories into powerful spells.",
					"Color": "#b6d7a8",
					"Main": true,
					"Image": "erwimages/chars/Sua.png",
					"Lore": "I'll read you a fairy tale.<br><br>A librarian at a local library, Sua hardly ever took a day off. Where else would she rather be than surrounded by all the literary greats? She voluntarily covered her co-worker's shifts - well before they even had time to ask her.<br><br>Sua is an idealist, a gentle optimist, and is always seen with a smile. Although very modest, Sua is remarkably talented.<br><br>Her memory, especially when it comes to literature and narratives, is nearly perfect - even down to the word. Sua can almost always be found with a book in her hand, even when she's not at work!",
					"Description": "Hammer Sua is an experience and spell casting focused mage that can frontline. Sua can apply repeated statuses using her ability to repeat her last spell on repeat, dealing massive sustained damage with spell and basic attack weaving. Sua can also give levels and infinitely level.",
					"Role": "Tank or Mage",
					"Difficulty": "Medium",
					"Power Spike": "Mid-Late Game",
					"HP": "120",
					"Basic Attack": "10 damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Odyssey (1 day cooldown) - Summon a book collapsing, dealing 0 + (attack power) damage to a target and stun the target in the current or adjacent zone for 1/10th of a day. Reset basic attack cooldown.",
						"The Curious Case (1 day cooldown) - Summon a fairy tale pet, shielding a target for 5 HP and making them immune to statuses for 1/10th of a day.",
						"To Kill a Mockingbird (1 day cooldown) - Summon a mockingbird, dealing 5 damage to a target and blinding the target for 1/10th of a day.",
						"Don Quixote (1 day cooldown) - Summon a mythical lance, dashing to an adjacent zone, or dash to a target in the current or adjacent and deal 0 + (attack power) damage to them. If the target has a status, stun them for 1/10th of a day."],
					"Level 4": ["Memory (1 day cooldown) - Repeat your last spell used on any target.",
						"Armor Piercing (1 day cooldown) - Smash someone with your hammer, dealing 10 damage to a target and removing any damage resistance they have.",
						"Knowledge is Power (3 day cooldown) - Use your great knowledge to select a target and give them a full level."],
					"Level 7": ["Romeo and Juliet (2 day cooldown) - Use your knowledge of love, selecting two targets, summoning a love curse on both, dealing 10 damage and disrupting both for 1/5th of a day. The next basic attack on either target will apply to the other target. Reset basic attack cooldown.",
						"50 Shades of Gray (1 day cooldown) - Use your forbidden knowledge, selecting a target to inflict 1 status of choice for 1/10th of a day. Slows increase their cooldowns by 10%."],
					"Level 10": ["Unlock The Great Gatsby."],
					"Passives": ["Bookworm - After using an ability, your next basic attack will deal an extra 10 damage, heal for 10 HP, and count as a spell.",
						"The Great Gatsby (Level 10) - Have the ability to gain infinite XP and convert the XP directly into credits or transfer the XP to a target of choice."]
				}
			]
		}
	},
	{
		"Nunchaku":
		{
			"Description": "Not done yet",
			"CharList":
			[
			]
		}
	},
	{
		"Pistol":
		{
			"Description": "Mobile characters with some potential for range, decent damage, and generally are somewhat durable or survivable. Jack of all trades.",
			"CharList":
			[
				{
					"Name": "Aya",
					"Summary": "A police officer with serious firepower and a sense of justice in putting down criminals.",
					"Color": "white",
					"Main": true,
					"Image": "erwimages/chars/Aya.png",
					"Lore": "For my light, for my justice.<br><br>Aya was born with an innate longing for justice, and employed this longing to become a police officer. However, her world and confidence in her job was shaken after her family were victims of a murder case.<br><br>She became obsessed with her vision of justice, beginning to think that only she was able to bring justice to the world.<br><br>Aya grew repulsed at the sight of corpses. When her job requires the occasional inspection of an animal corpse, it takes a toll on her psyche.<br><br>She has a brother named Suzuki Hikaru, who lost both of his legs.",
					"Description": "Pistol Aya wants to play very quickly, build an early weapon and do significant damage with many abilities. Aya with a pistol is scary in the early game and should be avoided early. Aya also has some intel abilities to gain intel on who to pick off early first.",
					"Role": "Ranger",
					"Difficulty": "Easy",
					"Power Spike": "Early Game",
					"HP": "100",
					"Basic Attack": "10 damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Double Shot (1/4th day cooldown) - Shoot someone, dealing 10 damage twice to a target.",
						"Steady Shot (1/2th day cooldown) - Shoot someone multiple times, dealing 0 + (attack power) damage 3 times to a target in 1/10th day intervals.",
						"Moving Turn (1 day cooldown) - Dash to an adjacent zone.",
						"Investigation (1 day cooldown) - Give a random piece of information that is useful related to the overall game state."],
					"Level 4": ["Blank Cartridge (2 day cooldown) - Put an arrest warrant on enemies in the zone, silencing all enemies in the current zone for 1/5th of a day, deal 20 damage.",
						"Moving Reload (2 day cooldown) - Reload your gun, reducing cooldowns by 25%.",
						"Pinning Shot (1/2th day cooldown) - Shot someone in the leg, dealing 5 damage and slowing a target, increasing their cooldowns by 10%."],
					"Level 7": ["Retreating Fire (1 day cooldown) - Fire at a target for 5 damage, running to an adjacent zone. Must choose to run to some adjacent zone.",
						"Unlock Aya’s Justice.",
						"Steady Shot becomes an area of effect, dealing damage to all enemies in the zone. Steady Shot can target any adjacent zone too."],
					"Level 10": ["Duty Calls (2 day cooldown) - Fire an explosive round that deals heavy damage, which deals 25 damage to all enemies in the current zone. Heal for the damage done."],
					"Passives": ["Bulletproof Vest (1 day cooldown) - Shield 10 HP.",
						"Aya’s Justice (Level 7, 1 day cooldown) - The first ability used on a target will deal 5% max HP."]
				},
				{
					"Name": "Isol",
					"Summary": "A terrorist with guerilla warfare knowledge, using cunning strategies like traps and radar manipulation.",
					"Color": "#e6d5b6",
					"Main": false,
					"Image": "erwimages/chars/Isol.png",
					"Lore": "I can't stop here.<br><br>Isol, known as Marcelo at the time, escaped his orphanage at the age of 12 at the suggestion of his trusted friend, Francisco.<br><br>Following his escape, he joined the terrorist group known as MOK. Isol is the sole survivor among the several child soldiers who joined the group around then.<br><br>He tended to devolve to unnecessarily cruel ways of murder.<br><br>Isol is overly disinterested in learning about others as he hates unnecessarily forming close relationships.",
					"Description": "Pistol Isol has a lot of sustain damage early and can help crowd control, catch, peel, and grant significant vision with his abilities. Isol can either play around his abilities to support his team, sustain slow burn damage, or trap out areas and use traps to burst players down.",
					"Role": "Ranger or Support",
					"Difficulty": "Medium",
					"Power Spike": "Early Game",
					"HP": "100",
					"Basic Attack": "10 damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Semtex Bomb (1/2th day cooldown) - Attach a bomb to a target, dealing 5 damage and rooting them for 1/8th of the day after a delay of 1/8th of the day.",
						"Rebel Assault (1 day cooldown) - Spray suppressing fire down in the current or adjacent zone, dealing 0 + (attack power) damage 3 times to all enemies there with 1/10th of a day separations, slowing them and increasing their cooldowns by 10%.",
						"Camouflage (1 day cooldown) - Dash to an adjacent zone and turn invisible for next day or until an ability is used."],
					"Level 4": ["MOK Operational Mine (2 day cooldown) - Set a trap down, enemies stepping on it will trigger the trap over the entire zone, be slowed with an increase of 20% cooldown, and take 10 + (attack power) damage.",
						"Moving Reload (2 day cooldown) - Reload your gun, reducing cooldowns by 25%.",
						"Booby Trap Dead (1/2th day cooldown) - Place a bomb on a corpse, which activates upon any enemy checking the corpse, dealing 10 damage. You will be notified on who tried to tamper with the corpse."],
					"Level 7": ["Learn from the Dead (3 day cooldown) - Check a corpse’s character and learn a unique passive from the character or the character’s gear, even passives that are not unlocked by the player.",
						"Radar Tampering (3 day cooldown) - Mess with your location tracking, immediately becoming invisible, lasts for 1 day.",
						"Unlock Trap Engineering."],
					"Level 10": ["Venus Fly Trap (2 day cooldown) - Set a trap down, enemies stepping on it will trigger the trap over the zone, be stunned for 1/4th of the day, and take 10 + (attack power) damage."],
					"Passives": ["Guerilla Warfare - You can see other traps that aren’t yours in adjacent zones. You know who steps on your traps and which player and character did.",
						"Trap Engineering (Level 7) - If any trap on the entire map is triggered, you know who stepped on that trap and you know where all traps are on the map."]
				},
				{
					"Name": "Jenny",
					"Summary": "An actress with two personas that she can switch between to tackle different problems.",
					"Color": "#ff9f9f",
					"Main": true,
					"Image": "erwimages/chars/Jenny.png",
					"Lore": "Sorry, I have no time for autographs today.<br><br>Jenny had a regular childhood in a regular house in an average suburb. Not rich, but not poor. Not fortunate, not unfortunate. Textbook mediocrity.<br><br>She hated it.<br><br>Jenny was entirely convinced that she'd become a Superstar and would see her name in lights. Unfortunately for her, she never quite got her big break; she's a B-list actress at best. Though, she still tries to indulge in luxury.<br><br>Despite the fact that she easily falls in love, her big, yet frail, ego has prevented her from ever dating seriously.",
					"Description": "Pistol Jenny is a form changing damage dealer that can burst enemies down quickly or lay down significant damage with basic attacks. Jenny is quite survivable for a DPS character, who can actually get killed once and still come back and fight, along with multiple peels and crowd control.",
					"Role": "Ranger",
					"Difficulty": "Hard",
					"Power Spike": "Mid Game",
					"HP": "100",
					"Basic Attack": "5 + (attack power) damage",
					"Basic Attack Cooldown": "1/2th day cooldown",
					"Level 1": ["Spotlight (1/2th day cooldown) - Summon a spotlight, dealing 5 damage to a target and gain 3 Rehearsal, if in Black Tea form, slow the target, increasing their cooldowns by 5%, and if in Red Wine form, deal 5 extra damage.",
						"Red Carpet (1 day cooldown) - Summon a carpet, dealing 10 damage to a target and gain 3 Rehearsal, if in Black Tea form, knock them away to an adjacent zone, and if in Red Wine form, pull them to you from another adjacent zone.",
						"Persona (1/4th day cooldown) - Dash to an adjacent zone and choose between Black Tea or Red Wine form."],
					"Level 4": ["Acceptance Speech (2 day cooldown) - Prepare an acceptance speech, stunning all enemies for 1/5th of a day in the current zone, dealing 20 damage and gaining 6 Rehearsal.",
						"Moving Reload (2 day cooldown) - Reload your gun, reducing cooldowns by 25%.",
						"Charming Showcase (1 day cooldown 6 Rehearsal) - Charm someone, disrupting a target in the current zone for 1/5th of a day. Black Tea increases this to 1/4th of a day, and Red Wine deals 10 damage to the target too.",
						"Unlock Persona Shot."],
					"Level 7": ["Ricochet Shot (1 day cooldown) - Shoot a ricocheting bullet, dealing 5 + (attack power) damage to a target, which can ricochet and deal 5 + (attack power) damage to another target. Counts as a basic attack.",
						"Dramatic Reveal (2 day cooldown, 6 Rehearsal) - Select a target, for 1/2th a day, actions done to you will be done on that target instead for this day. Black Tea removes all damage reduction from the target, and Red Wine deals 2 damage per action used on you to the target."],
					"Level 10": ["Final Act (10 Rehearsal) - Deal 10 + (attack power) damage to all enemies in the current zone, blinding them for 1/3rd of a day.",
						"Boardwalk Preparation (1/2th day cooldown) - Prepare yourself against stage fright, gaining 5 Rehearsal. Black Tea gains 3 more Rehearsal and Red Wine gains 5 attack power alongside Rehearsal.",
						"Play Dead’s cooldown is reset, and has a 2 day cooldown instead."],
					"Passives": ["Rehearsal - Gain up to 10 Rehearsal, which can all be used on different abilities or are automatically used for Play Dead.",
						"Black Tea and Red Wine - You are always in two forms; Black Tea grants 10% shorter cooldowns and Red Wine grants 5 attack power.",
						"Play Dead (4 day cooldown) - Spend 6 Rehearsal to turn invisible upon reaching 0 HP and resurrect with 50% HP in the same or an adjacent zone the next day.",
						"Persona Shot (Level 4) - Every third basic attack gives 3 Rehearsal."]
				}
			]
		}
	},
	{
		"Rapier":
		{
			"Description": "Faster characters that can continue to chase and relentlessly attack opponents in a versatile way of play.",
			"CharList":
			[
				{
					"Name": "Adela",
					"Summary": "A grandmaster chess player that has every single outcome in her mind who will not take defeat as an answer.",
					"Color": "#d3d3d3",
					"Main": true,
					"Image": "erwimages/chars/Adela.png",
					"Lore": "Why even try? My victory is assured.<br><br>A world chess grandmaster, what lies in front of Adela is only victory. \"Defeat\" simply doesn't exist in her vocabulary. She's always at least one step ahead of her enemies - more often two or three.<br><br>Outside of chess, she takes things frustratingly slow. When the game starts, however, she concentrates fully, maneuvering the chess board with grace.<br><br>She challenges herself to think and enjoys the thrill of winning with her precise and calculating strategy.",
					"Description": "Rapier Adela is a control heavy mage that wants to dominate multiple zones with her usage of chess pieces and combos. The chess piece placement and max HP damaging abilities create a mix of burst and control that pushes out enemies indirectly using area control. Rapier Adela will constantly aim for big burst combos that finish enemies instantly through statuses.",
					"Role": "Mage",
					"Difficulty": "Hard",
					"Power Spike": "Mid-Late Game",
					"HP": "100",
					"Basic Attack": "5 damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Promotion (1 day cooldown, 3 uses a day) - Drop a Pawn, dealing 10 damage to a target.",
						"Knight Fork (1 day cooldown) - Drop a Knight into the current zone, you must knock any chess pieces into adjacent zones of choice, maximum 2 per zone, dealing 0 + (attack power) damage to a target. If at least 2 chess pieces are hit with the Knight, deal an additional 10 damage to the target, and stun them for 1/10th of a day.",
						"Castling (1 day cooldown) - Drop a Rook to an adjacent zone to dash sometime in the next 1/5th of a day, dealing 0 + (attack power) damage to an enemy in the adjacent zone and swapping places with the Rook. If any chess piece is hit with the Rook, deal an additional 10 damage. The reactivation can be used in Checkmate.",
						"Queened (Upon 3 uses of Promotion) - Drop a Queen, dealing 0 + (attack power) damage to a target and stunning them for 1/8th of a day. Leaves a Queen in the zone."],
					"Level 4": ["Checkmate (2 day cooldown) - Attempt to checkmate, becoming invulnerable and immune to all statuses for 1/8th of a day. After the duration, deal 10 damage and deal an extra 2% max HP damage per chess piece to all enemies in the zone.",
						"Quick Cut (1 day cooldown) - Quickly cut someone, dashing to a target in the current or adjacent zone, dealing 10 damage.",
						"Development (1 day cooldown) - Drop a Bishop to a non adjacent or current zone, dealing 10 damage to all enemies in the area. If any chess piece is hit with the Bishop, deal an additional 10 damage to all enemies in the zone."],
					"Level 7": ["King Safety (2 day cooldown) - Drop a King to the current zone. Protect the King to gain 5 Attack Power. The King chess piece has 30 HP.",
						"Pin and Skewer (2 day cooldown) - Pin and skewer your chess pieces, moving all chess pieces in all adjacent zones into the current zone, dealing 10 damage to all enemies in all adjacent zones (and not the current zone). If you move chess pieces from multiple zones into the current zone, pull all enemies in all adjacent zones to the current zone. Does not apply extra damage from additional chess pieces.",
						"Discovered Check (1 day cooldown) - Discover a possible check, checking the target’s HP and attack power."],
					"Level 10": ["Endgame (2 day cooldown) - Drop a Queen on every zone, essentially applying a Queened to every zone."],
					"Passives": ["Control the Center - Any attempts to reset the basic attack cooldown do not work and instead doubles basic attack damage from the original value. All chess pieces last for 1/2 of a day.",
						"Time Control - Every 3rd Promotion, reduce cooldowns by 10%."]
				},
				{
					"Name": "Camilo",
					"Summary": "A dancer with immense beauty and some narcissism, which he uses to charm his enemies into death.",
					"Color": "#ff9f9f",
					"Main": false,
					"Image": "erwimages/chars/Camilo.png",
					"Lore": "The pure beauty of a flower is nothing compared to you.<br><br>An astounding flamenco dancer, Camilo always commands attention the moment he walks into the room. His captivating beauty is rivaled only by his dance talent. Camilo is well aware of this exceptional beauty and talent and relishes basking in the attention he gets.<br><br>A bit of a narcissist, Camilo is always brutally honest and doesn't particularly care to empathize with the pain or sorrow of those around him.<br><br>He is seemingly always carrying a rose, except nobody knows where he even got it from.<br><br>Though fluent in English, he likes to sprinkle his favorite Spanish words into conversation.",
					"Description": "Rapier Camilo is a mobile dancing fighter with insane movement on the map, capable of relentlessly chasing enemies and dashing away in order to constantly deal area of effect damage whenever he pleases. Camilo with Rapier has even more direct mobility, having the ability to control his constant dancing around and amount of turns used to move back and forth through different zones.",
					"Role": "Fighter",
					"Difficulty": "Medium",
					"Power Spike": "Early-Mid Game",
					"HP": "120",
					"Basic Attack": "5 + (attack power) damage",
					"Basic Attack Cooldown": "1/2th day cooldown",
					"Level 1": ["Vuelta (1 day cooldown, 2 uses a day) - Spin elegantly, dealing 0 + (attack power) damage to a target in the current zone.",
						"Cierre (1 day cooldown) - Dance elegantly, dashing to an adjacent zone, or dash to a target in the current or adjacent and deal 0 + (attack power) damage to them.",
						"Al Compas - Dash to a target in the current zone and deal 5 damage to them. Can only be used once per target per day. Can use Vuelta or Gran Vuelta alongside of this ability.",
						"De Mi Caballo (Can only be used after Al Compas is used on the target) - Dash to a target that has been targeted by Al Compas in the current zone and deal 5 damage to them, and stun them for 1/10th of a day."],
					"Level 4": ["Duende (2 day cooldown) - Dance wildly and happily, dashing into an adjacent zone and returning to the current zone 3 times, dealing 5 damage to all targets in both zones, becoming status immune for each attack, and healing for 10 HP, each taking 1/8th of a day and can be used any time in the day this ability was used. The last attack stuns all enemies in that zone for 1/10th of a day.",
						"Quick Cut (1 day cooldown) - Quickly cut someone, dashing to a target in the current or adjacent zone, dealing 10 damage.",
						"Gran Vuelta (Can only be used if two Vueltas were used today) - Deal 10 + (attack power) damage to a target in the current zone and heal yourself for 20 HP.",
						"Baile (1 day cooldown) - Dance wildly, dashing into an adjacent zone and returning to the current zone once, dealing 5 damage to all enemies, becoming status immune, and healing for 10 HP."],
					"Level 7": ["Evadir (1 day cooldown) - Vault upwards and dodge any ability for 1/10th of a day."],
					"Level 10": ["El Brinco (1/4th day cooldown) - Move rapidly, dashing to an adjacent zone, and then another adjacent zone."],
					"Passives": ["Ole! (1 day cooldown) - Dealing damage creates a 10 HP shield. Any healing done by food or drinks is negated with this damage."]
				},
				{
					"Name": "Chiara",
					"Summary": "A nun who has been forsaken and abandoned by God, trying to find her path again without God.",
					"Color": "#ead1dc",
					"Main": true,
					"Image": "erwimages/chars/Chiara.png",
					"Lore": "I'm ruined...There will be no salvation for me...<br><br>Chiara was sent to a catholic church institution at birth. Every day, she was brainwashed with stories of the omnipotence of His Almighty.<br><br>When she was finally allowed to leave the compound, she ventured to seedy, sordid, and wretched places to preach, holding belief that God would protect her. She found herself in reprehensible situations, harshly realizing the cruel reality of life. A denial of God started growing in her mind, causing her disgust within.<br><br>She detests seeing beautiful and noble things because of her dissatisfaction with herself.",
					"Description": "Rapier Chiara is a tank that can hold her ground, deal massive area of effect damage, and constantly chain statuses onto other enemies, negating many statuses and having a unique niche of transferring damage and statuses onto other enemies.",
					"Role": "Tank or Fighter",
					"Difficulty": "Medium",
					"Power Spike": "Early-Mid Game",
					"HP": "140",
					"Basic Attack": "10 damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Hand of Corruption (1 day cooldown) - Corrupt someone, dealing 10 damage to a target and slowing them, increasing their cooldowns by 10%. Spend 1/10th of a day charging it instead to also be able to target adjacent zones and deal 10 + (attack power) damage instead of 10 damage.",
						"Depraved Prayer (1 day cooldown) - Pray and shield yourself for 30 HP for 1/5th of a day. If the shield breaks or expires, deal 10 + (attack power) damage to all enemies in the zone.",
						"Mania (1 day cooldown) - Shoot a corrupted mind flare at someone, dealing 5 damage to a target and rooting them for 1/5th of a day.",
						"Plague (1 day cooldown) - Inflict yourself with a deadly plague of corruption, dealing 10 + (attack power) damage to all enemies in the zone for the day, occurring every 1/5th of the day, healing for the damage done."],
					"Level 4": ["Last Judgement (4 Stigma) - Use god’s judgement on someone and judgement call them, dealing 20% max HP damage to a target in the current or adjacent zone.",
						"Quick Cut (1 day cooldown) - Quickly cut someone, dashing to a target in the current or adjacent zone, dealing 10 damage.",
						"Blackened Chains (1 day cooldown) - Chain yourself with blackened chains, saving the most recent status done to you. Select a target, reapply that status to the target with the same duration.",
						"Unlock Haloless."],
					"Level 7": ["Forsaken Angel (2 day cooldown) - Endure the hatred towards yourself, selecting a target to endure with you. For 1/5th of a day, anything that happens to you happens to that target.",
						"Unlock Spiteful."],
					"Level 10": ["Permanently have Plague active."],
					"Passives": ["Stigma - Every ability used grants 5% cooldown reduction for one day. Can be spent on Last Judgement to execute an enemy.",
						"Haloless (Level 4) - If statused, know who did it and reduce the status duration by 25%.",
						"Spiteful (Level 7) - Explode in spite, making every 33% of max HP lost deal 10 + (attack power) to all enemies in the current zone."]
				},
				{
					"Name": "Elena",
					"Summary": "A figure skater who is cold to the touch, fighting against those who have betrayed her.",
					"Color": "#c9daf8",
					"Main": true,
					"Image": "erwimages/chars/Elena.png",
					"Lore": "It's my turn? I see.<br><br>Elena was a promising figure skater who fascinated those around her with graceful movements on the cold ice.<br><br>Born in the winter, she was never bothered by the cold. The fire of her passionate heart kept her warm.<br><br>Her cold eyes, however, reflected the true nature of her icy heart.<br><br>What most people don't know is that Elena wasn't always like that.<br><br>She had been betrayed countless times by the people she loved and trusted.<br><br>Over time, she grew to become callous and fierce, unable to trust anyone.",
					"Description": "Rapier Elena is a tank that bursts enemies using a resource to freeze enemies and has high mobility to engage and disengage at will. Elena is primarily a burst character that is versatile and can fill many roles, even transitioning into a damage focused fighter if need be, or utilizing healing and damage shields to protect Elena and her allies.",
					"Role": "Tank or Fighter",
					"Difficulty": "Medium",
					"Power Spike": "Mid Game",
					"HP": "120",
					"Basic Attack": "10 damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Crystal Elegance (1 day cooldown) - Inflict some chilling ice on someone, dealing 0 + (attack power) damage to a target and applying 1 Chill. If the target deals damage back in the next 1/10th of a day, apply 1 more Chill.",
						"Double Axel (1 day cooldown, 2 uses a day) - Spin gracefully, dealing 10 damage to a target and applying 1 Chill. Can be used during Spiral.",
						"Spiral (1 day cooldown) - Skate elegantly, dashing to an adjacent zone, and a zone adjacent to the other adjacent zone, taking 1/10th of a day. Can use Double Axel in the middle of the dash during the 1/10th of a day, applying 1 Chill and damage to a target in the zone moved to."],
					"Level 4": ["Danse Macabre (3 day cooldown) - Encase the entire zone in ice, applying 3 Chill to all enemies in the zone and dealing 10 + (attack power) damage.",
						"Quick Cut (1 day cooldown) - Quickly cut someone, dashing to a target in the current or adjacent zone, dealing 10 damage.",
						"Ice Block (1 day cooldown) - Encase someone in ice positively, selecting a target, putting them in stasis for 1/8th of a day and healing them for 30 HP."],
					"Level 7": ["No Bending! (1 day cooldown) - Check someone’s posture, learning a target’s statuses and knowing if they have status immunities. If the target has a status and is an enemy, deal 10 damage to them, else, heal them for 20 HP.",
						"Let it Snow! (2 day cooldown) - Create a snowman in the current zone, which has 20 HP. Any damage done to you in the current zone is done to the snowman.",
						"Unlock Ice Princess."],
					"Level 10": ["Unlock Royal Maneuver."],
					"Passives": ["Winter Queen’s Domination - Basic attacks and abilities apply 1 Chill to targets and slow the targets, increasing their cooldowns by 10%. Applying 3 Chill to a target inflicts Frozen, which stuns the target for 1/8th of a day. If the target is attacked when Frozen, the target is unstunned and takes 0 + (attack power) damage.",
						"Ice Princess (Level 7) - Apply 1 Chill to enemies that attack you. Only applies every 2nd attack.",
						"Royal Maneuver (Level 10) - Increase all enemy cooldowns in the current zone by 20% at the start of every day."]
				}
			]
		}
	},
	{
		"Shuriken":
		{
			"Description": "Mages that force massive amounts of area of effect damage on their enemies.",
			"CharList":
			[
				{
					"Name": "Chloe",
					"Summary": "A marionettist with an innate connection to her doll, Nina, who is her sword and shield.",
					"Color": "white",
					"Main": true,
					"Image": "erwimages/chars/Chloe.png",
					"Lore": "You.. saw the puppet moving? Heh, very funny.<br><br>Chloe is a marionettist with a very calm disposition. She's always wearing a lovable bright smile.<br><br>She speaks to people in an incredibly soothing and reassuring manner, always making them lower their guards.<br><br>Those around her always look at her with admiration, always remaining composed and never showing any anger or frustration.<br><br>When she speaks through her trusty companion Nina, however, she has a tendency to show her true colors.",
					"Description": "Shuriken Chloe is focused on micromanaging her doll, Nina. Nina can control the game by constantly providing intel, annoying enemies across the map, and giving ways to sustain war against enemies. Chloe can deal significant sustain damage between herself and Nina, alongside having a plethora of spells to status enemies and having ways to constantly keep Chloe or Nina from dying.",
					"Role": "Ranger",
					"Difficulty": "Hard",
					"Power Spike": "Early-Mid Game",
					"HP": "120",
					"Basic Attack": "10 + (attack power) damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Nina on Command (1 day cooldown) - Nina deals 5 damage to all enemies in her current zone, slowing enemies, increasing their cooldowns by 5%.",
						"Puppet Theater (1 day cooldown) - Pull Nina to the current zone. Deal 0 + (attack power) damage to all enemies in the current zone, rooting all enemies for 1/8th of a day. In 1/8th of a day, push Nina to the current or an adjacent zone, dealing 0 + (attack power) damage to all enemies in the zone and stunning them for 1/10th of a day.",
						"Seam Ripper (1 day cooldown) - Rip a seam, dashing to an adjacent zone, or dash to a target in the current or adjacent zone, and deal 5 damage to them.",
						"Nina, Here! (1 day cooldown) - Nina can be sent to an adjacent zone and automatically attack all enemies in the zone for 5 damage.",
						"Nina, To Me! (1 day cooldown) - Nina returns back to your current zone."],
					"Level 4": ["Soul Link (1 day cooldown) - Link souls with Nina, dealing 0 + (attack power) damage to all enemies in both your current zone and Nina’s current zone for 1/5th of a day.",
						"Life Link (3 day cooldown) - Nina and you are unkillable for 1/6th of a day. This can be activated under any status. Both you and Nina take 50% of any damage done.",
						"Caltrops (2 day cooldown) - Drop a field of caltrops in the current zone, dealing 10 damage to any enemy who enters and slows them, increasing their cooldowns by 10%."],
					"Level 7": ["Soul Swap (1 day cooldown) - Swap health and statuses with Nina.",
						"Unlock Extended Legs."],
					"Level 10": ["Life Link can be used on all targets, making both of you unkillable but also making you both take 50% of any damage taken.",
						"Soul Swap can be used on all targets, swapping health and statuses with any target of choice."],
					"Passives": ["Living Marionette - Nina is your doll, which is a unit that can move and attack separately once per day from Chloe. Nina has 50% of Chloe’s HP, and 50% of Chloe’s attack power. Upon death, Nina will revive in 1/2th of a day, dealing 50% of Chloe’s max HP as damage to Chloe, which cannot kill Chloe.",
						"Extended Legs (Level 7) - Nina can attack targets in adjacent zones."]
				},
				{
					"Name": "Emma",
					"Summary": "A magician that knows every last magic trick, including a massive number of illusion, polymorphing, and teleportation tricks.",
					"Color": "#c9daf8",
					"Main": true,
					"Image": "erwimages/chars/Emma.png",
					"Lore": "I'll show you something completely new!<br><br>Emma is but a cheerful magician with her venue of choice being the sprawling city streets.<br><br>Whether it be with her hat, coins, or doves, she's well practiced in all forms of magic; but card tricks are her specialty.<br><br>She was granted the nickname 'Begi Emma' by her early fans, after being a seemingly perpetual beginner. Despite her intimidatingly loud voice (and laugh), she is still approachable and friendly.<br><br>To free herself from her parents' unyielding household, Emma began to seriously pursue her dream as soon as she became an adult. There are whispers amongst the magician community that she wants to become famous to reconnect with her long lost grandfather.",
					"Description": "Shuriken Emma is an interesting illusion focused mage that casts many spells on repeat. With good micromanaging, Emma can control the battlefield using the many illusions and magic tricks, capable of dealing significant damage with varied spells and controlling enemies using mind games and polymorph.",
					"Role": "Mage",
					"Difficulty": "Hard",
					"Power Spike": "Mid-Late Game",
					"HP": "100",
					"Basic Attack": "10 damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Dove Dealer (1 day cooldown) - Do a dove trick, dealing 0 + (attack power) damage to a target in the current zone, and to a target in the dove’s zone. If there is no dove placed, target someone in your current zone twice.",
						"Hat Trick (1 day cooldown) - Do a hat trick, dealing 10 + (attack power) damage to a target and leaving a Hat in the current zone.",
						"Bunnymorph (1 day cooldown) - Polymorph a target, turning them into a rabbit, silencing, disarming, and slowing them, increasing their cooldowns by 10% and lasting for 1/8th of a day.",
						"Dove Placement (1/4th day cooldown) - Place a dove in the current zone for Dove Dealer."],
					"Level 4": ["Change★ (1 day cooldown) - Teleport to the Dove, to the Hat, or to a polymorphed target. Teleporting to the Dove deals 5 damage to a target and roots the target for 1/8th of a day in the zone with the Dove. Teleporting to the Hat deals 20 damage to all enemies in the zone with the Hat. Teleporting to the polymorphed target polymorphs all enemies in that zone.",
						"Caltrops (2 day cooldown) - Drop a field of caltrops in the current zone, dealing 10 damage to any enemy who enters and slows them, increasing their cooldowns by 10%.",
						"Mirror Image (1 day cooldown) - Create an illusion of yourself in the current zone that has 20% of your max HP and deals 20% of the target’s attack power as damage that can only move and attack for 1 day.",
						"Unlock Inexhaustible Bottle."],
					"Level 7": ["Magical Duplication (2 day cooldown) - Create an illusion of a target, putting them in stasis for 1/10th of a day. Afterwards, control 1 illusion of the target that can only move and attack for 1 day. This illusion has 20% of the target’s max HP and deals 20% of the target’s attack power as damage."],
					"Level 10": ["Illusion of Death (2 day cooldown) - Select a target. The target will look like they are in Death’s Door for this day, but will be in the same condition they were in and regain all HP lost this day since this was used the following day."],
					"Passives": ["CheerUP♥ (1 day cooldown) - The next basic attack shields 10 HP.",
						"Inexhaustible Bottle (Level 4) - Drinks heal for double the amount."]
				},
				{
					"Name": "Hyejin",
					"Summary": "A shaman that can cast many spells and charms while searching for her destiny.",
					"Color": "#d2beff",
					"Main": false,
					"Image": "erwimages/chars/Hyejin.png",
					"Lore": "This must be another fated way.<br><br>Hyejin is the only child of a generational shaman family. Her destiny, if she had been born after dawn, would have been straightforward and undisturbed. Hyejin was not so lucky. Having been born before dawn, she was fated to go through a great ordeal at the age of 18.<br><br>She seems to accept her destiny as it is. Being raised from a shaman family, Hyejin believes her fate has already been determined.<br><br>She often plays the Bipa, a pear-shaped lute used to communicate with spirits. To be honest though, it kinda just looks like she's murmuring to herself.",
					"Description": "Shuriken Hyejin is a burst oriented spellcaster that wants to nuke enemies quickly through a variety of charms abusing damage increasing effects while the enemy cannot react through statuses. Hyejin is not as flexible with this weapon, but is more focused on a mage and burst damage role.",
					"Role": "Mage or Support",
					"Difficulty": "Medium",
					"Power Spike": "Early-Mid Game",
					"HP": "100",
					"Basic Attack": "5 damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Charm of Despair (1 day cooldown, 2 uses a day) - Use a slowing charm, dealing 5 + (attack power) damage to a target and slowing them, increasing their cooldowns by 10%.",
						"Charm of the Prophecy (1 day cooldown) - Use a rooting charm, dealing 10 damage to a target and rooting them for 1/10th of a day.",
						"Charm of the Nomad (1 day cooldown) - Use a mobility charm, leaving a mark to allow dashing there in the next 1/5th of a day, or dash to a target in the current or adjacent and deal 5 + (attack power) damage to them."],
					"Level 4": ["Five Omens (2 day cooldown) - Summon an omen in each adjacent zone, dealing 0 + (attack power) damage to any enemy that is visible in the zone. If there isn’t a visible enemy in that zone, hit the first enemy that enters or is revealed in the zone.",
						"Caltrops (2 day cooldown) - Drop a field of caltrops in the current zone, dealing 10 damage to any enemy who enters and slows them, increasing their cooldowns by 10%.",
						"Charm of Discovery (1 day cooldown) - Use a discovery charm on the zone, dealing 10 damage to all enemies in the zone and revealing all invisible enemies."],
					"Level 7": ["Charm of the Curse (1 day cooldown) - Curse a target, dealing 10 damage and disrupting the target for 1/6th of a day.",
						"Charm of Gifts (2 day cooldown) - Use a gifting charm, reset a cooldown of choice on a target.",
						"Charm of the Spell Weaver (1 day cooldown) - Use a spellcasting charm, making someone take 25% more damage from all spells for 1/8th of a day."],
					"Level 10": ["Charm of Vengeance (1 day cooldown) - Summon some magic missiles, dealing 3 missiles of 0 + (Attack power) damage per missile to a target. Each count as a separate spell."],
					"Passives": ["Three Calamities - Upon hitting a target with 3 separate spells, push them to any adjacent zone."]
				},
				{
					"Name": "Sissela",
					"Summary": "A diseased child with a unique sentient ball which can be used to control the battlefield to her advantage.",
					"Color": "white",
					"Main": false,
					"Image": "erwimages/chars/Sissela.png",
					"Lore": "Life is an agony. Only more agony awaits to greet me.<br><br>Suffering from an incurable disease affecting only a hundred in the world, Sissela has been hospitalized since her diagnosis at a very young age. Despite the uncountable attempts to free herself from her extreme and constant pain, she couldn’t easily end her life.<br><br>A rare specimen in medicine, she was supported with experimental treatments and fully paid medical bills. To her, it seems that she is being kept alive merely for the sake of continuing research.<br><br>She is often expressionless and does not talk much. Often isolated, she habitually draws faces on things and gives them names to talk to them. She feels pretty awkward talking to other people.",
					"Description": "Shuriken Sissela is a burst spellcaster that deals significant damage through mass area of effects and lowering HP to deal more damage from range. Sissela has less sustain than other weapons in this form, but has a higher potential for damage.",
					"Role": "Mage or Support",
					"Difficulty": "Medium",
					"Power Spike": "Mid-Late Game",
					"HP": "120",
					"Basic Attack": "5 damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Go Get Em’ Wilson! (5 HP, 1/2th day cooldown) - Send Wilson to attack, dealing 10 + (attack power) damage to a target in the current or adjacent zone. Can send Wilson to an adjacent zone without a target. Wilson will give vision there.",
						"Girl in a Bubble (1 day cooldown) - Enter a bubble with Wilson, becoming invulnerable and immune to all statuses for 1/6th of a day.",
						"Play With Us! (5 HP, 1 day cooldown) - Send Wilson to play, dealing 20 damage to the target in a zone adjacent to Wilson’s zone, and pulling them to Wilson. If you pull yourself or an ally, give a shield of 10 HP.",
						"Back To Me Wilson! (1/4th day cooldown) - Move Wilson back to the current zone you are in."],
					"Level 4": ["Free at Last (20 HP, 3 day cooldown) - Set yourself free, dealing 15 + (attack power) damage to all enemies on the map..",
						"Caltrops (2 day cooldown) - Drop a field of caltrops in the current zone, dealing 10 damage to any enemy who enters and slows them, increasing their cooldowns by 10%.",
						"Wilson, Slay! (5 HP, 1 day cooldown) - Send Wilson to slay, disrupting a target for 1/10th of a day and dealing 10 damage to them 3 times to all enemies there with 1/8th of a day separations."],
					"Level 7": ["Wilson, Smash! (5 HP, 1 day cooldown) - Wilson smashes the ground every other time Sissela casts an ability for 1/6th of a day, dealing 0 + (attack power) damage to all enemies in Wilson’s zone.",
						"Spook them Wilson (5 HP, 1 day cooldown) - Wilson spooks a target, pushing them into another zone and disrupting them for 1/8th of a day."],
					"Level 10": ["Chained Down (20 HP, 2 day cooldown) - Chain yourself down, preventing yourself from moving and dealing significant damage to yourself, but gaining 20 AP and becoming status immune."],
					"Passives": ["Agony - Gain 1 attack power every 10 less HP you have. You cannot kill yourself by draining all your HP. Every day she heals for 10 HP."]
				},
				{
					"Name": "Zahir",
					"Summary": "A ritualist of a temple that saved him as a kid who can cast many spells and curses on enemies.",
					"Color": "#e6d5b6",
					"Main": false,
					"Image": "erwimages/chars/Zahir.png",
					"Lore": "I behold the vision of the Almighty.<br><br>After escaping from an orphanage at a young age, Zahir found himself lost and starving. He arrived at a small Sikh temple and miraculously survived.<br><br>He became a devoted follower, believing that his God had mercifully saved him.<br><br>His morning ritual is to shower and brush his hair with a wooden comb. He sometimes speaks like an angsty teenager, but it's not easily noticed as he seldom speaks.",
					"Description": "Shuriken Zahir is a flexible spellcaster that can cast many spells in quick succession to deal sustain damage, or situational burst damage with status applying and removing. Zahir with a Shuriken deals more damage than Zahir’s other weapons and focuses on other inherent combos than chakram casting.",
					"Role": "Mage or Support",
					"Difficulty": "Medium",
					"Power Spike": "Early-Mid Game",
					"HP": "100",
					"Basic Attack": "5 damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Narayanastra (1 day cooldown) - Cast a spell of all-seeing, dealing 0 + (attack power) damage to the target. Give 1 charge of Gandiva.",
						"Gandiva (0 charges) - Throw a chakram out, dealing 0 + (attack power) damage to the target.",
						"Vayvayastra (1 day cooldown) - Shoot a tornado, dealing 10 damage and stunning a target for 1/6th of a day. Give 1 charge of Gandiva."],
					"Level 4": ["Bhargavastra (3 day cooldown) - Set an adjacent zone or current zone with a mass rain of chakrams and deal 10 + (attack power) damage to all enemies in the zone, and deal 10 + (attack power) damage to enemies in an adjacent zone of the previous zone next day.",
						"Caltrops (2 day cooldown) - Drop a field of caltrops in the current zone, dealing 10 damage to any enemy who enters and slows them, increasing their cooldowns by 10%.",
						"Prajnastra (1 day cooldown) - Put someone in a large wind funnel, putting them in stasis for 1/5th of a day. Grant 1 charge of Gandiva.",
						"Bhaumastra (3 day cooldown) - Check a corpse’s character and learn an active ability that the character had, with default cooldowns and charges."],
					"Level 7": ["Sailastra (1 day cooldown) - Clear the weather, removing all statuses on a target, dealing 0 + (attack power) damage per cleared status. Grant 1 charge of Gandiva.",
						"Visoshana (1 day cooldown) - Dry the ground immensely, causing an earth shattering on a target, dealing 10 + (attack power) damage to a target and disrupting them for 1/10th of a day. Grant 1 charge of Gandiva."],
					"Level 10": ["Parvatastra (4 day cooldown) - Mark any zone, in 1/5th of a day, drop a large mountain on the zone, dealing 10 + (attack power) damage and stunning all targets in the zone for 1/6th of a day."],
					"Passives": ["Eye of Azrael - Upon hitting a target, give vision of that target for 1 day."]
				}
			]
		}
	},
	{
		"Sniper Rifle":
		{
			"Description": "Characters that emphasize massive range advantages to create positioning and health advantages.",
			"CharList":
			[
				{
					"Name": "Aya",
					"Summary": "A police officer with serious firepower and a sense of justice in putting down criminals.",
					"Color": "white",
					"Main": false,
					"Image": "erwimages/chars/Aya.png",
					"Lore": "For my light, for my justice.<br><br>Aya was born with an innate longing for justice, and employed this longing to become a police officer. However, her world and confidence in her job was shaken after her family were victims of a murder case.<br><br>She became obsessed with her vision of justice, beginning to think that only she was able to bring justice to the world.<br><br>Aya grew repulsed at the sight of corpses. When her job requires the occasional inspection of an animal corpse, it takes a toll on her psyche.<br><br>She has a brother named Suzuki Hikaru, who lost both of his legs.",
					"Description": "Sniper Aya still prefers to play quickly on this weapon, but trades mobility and fast response with distance on damage and range of impact. Aya still is a burst focused character trying to quickly rush down enemies with a Sniper.",
					"Role": "Ranger",
					"Difficulty": "Easy",
					"Power Spike": "Early Game",
					"HP": "100",
					"Basic Attack": "20 damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Double Shot (1/2th day cooldown) - Shoot someone, dealing 10 damage twice to a target.",
						"Steady Shot (1 day cooldown) - Shoot someone multiple times, dealing 0 + (attack power) damage 3 times to a target in 1/10th day intervals.",
						"Moving Turn (1 day cooldown) - Dash to an adjacent zone.",
						"Investigation (1 day cooldown) - Give a random piece of information that is useful related to the overall game state."],
					"Level 4": ["Blank Cartridge (2 day cooldown) - Put an arrest warrant on enemies in the zone, silencing all enemies in the current zone for 1/5th of a day, deal 20 damage.",
						"Ballistic Advantage (2 day cooldown) - Snipe a target in an adjacent zone, dealing 10 damage twice in intervals of 1/10th of a day.",
						"Unlock Laser Sight.",
						"Unlock Sniper Scope."],
					"Level 7": ["Unlock Aya’s Justice.",
						"Steady Shot becomes an area of effect, dealing damage to all enemies in the zone. Steady Shot can target any adjacent zone too."],
					"Level 10": ["Duty Calls (1 day cooldown) - Fire an explosive round that deals heavy damage, which deals 25 damage to all enemies in the current zone. Heal for the damage done."],
					"Passives": ["Bulletproof Vest (1 day cooldown) - Shield 10 HP.",
						"Laser Sight (Level 4) - Ignore blinds and disruption.",
						"Sniper Scope (Level 4) - Basic attacks can reach any adjacent zone.",
						"Aya’s Justice (Level 7, 1 day cooldown) - The first ability used on a target will deal 5% max HP."]
				},
				{
					"Name": "Bernice",
					"Summary": "A hunter who owns a pet falcon to hunt any prey in his sights, with deadly gunnery to secure the hunted.",
					"Color": "#ffd966",
					"Main": true,
					"Image": "erwimages/chars/Bernice.png",
					"Lore": "I only hunt the true beasts.<br><br>Bernice lives well off the grid. He hunts and takes care of his livestock to make ends meet. Occasionally he deals with predators that might harm the intermittent traveler or expel illegal poachers.<br><br>In his younger days, he fell for a woman that was already engaged - but to avoid rumors and to protect her reputation, he left his humble village.<br><br>Bernice avoids the bottle as it causes him to lose focus, but he does enjoy smoking on occasion.<br><br>Although he denies it, he definitely hunted a human once.",
					"Description": "Sniper Bernice is a hunter that wants to use basic attacks, traps, and his pet bird to gather intel and deny areas from enemies. Bernice is a simple sustain focused character that has some range advantage, yet can fight enemies in the same zone just as well.",
					"Role": "Ranger",
					"Difficulty": "Easy",
					"Power Spike": "Early-Mid Game",
					"HP": "120",
					"Basic Attack": "10 + (attack power) damage",
					"Basic Attack Cooldown": "1/2th day cooldown",
					"Level 1": ["Leg Shot (1 day cooldown) - Shoot someone in the leg, dealing 0 + (attack power) damage to a target in the current or adjacent zone, and slow the target, increasing their cooldowns by 10%.",
						"Foothill Trap (1 day cooldown) - Set a trap down, enemies stepping on it will trigger the trap over the zone, be rooted for 1/10th of a day, and take 5 damage.",
						"Falconry (1 day cooldown) - Scan the area with your bird, granting vision of the current zone and reduce cooldowns by 10%. The closest enemy will be marked by Hunter’s Mark when that is unlocked.",
						"Bird’s Flight (1 day cooldown) - A Falcon scouts an adjacent zone, and moves you to the adjacent zone if you choose to do so."],
					"Level 4": ["Explosive Bola (2 day cooldown) - Deal 20 damage to a target and root the target for 1/10th of a day. The bola bounces to a target of choice in the zone, deals 20 damage, and roots them for 1/10th of a day, and repeats until there are no more targets in the zone.",
						"Ballistic Advantage (2 day cooldown) - Snipe a target in an adjacent zone, dealing 10 damage twice in intervals of 1/10th of a day.",
						"Birdwatch (2 day cooldown) - A Falcon attacks all enemies in the current or adjacent zone for 5 damage, blinding them all for 1/10th of a day.",
						"Unlock Hunter’s Mark."],
					"Level 7": ["Finding Tracks (1 day cooldown) - Use your tracking skills, telling you whether there were enemies in the zone in the previous day and what characters were in the zone.",
						"Tracking Shot (1 day cooldown) - Shoot a tracking bullet, selecting a target, if you guess the character correctly, deal 10 damage and mark them with Hunter’s Mark."],
					"Level 10": ["The basic attack cooldown is every 1/3rd of a day."],
					"Passives": ["Buckshot - Basic attacks damage all enemies in the zone for the same amount of damage. However, basic attacks cannot reach any adjacent zone.",
						"Shotgun - The first basic attack on any target ignores all damage resistance.",
						"Hunter’s Mark (Level 4) - Basic attacks mark enemies, increasing damage done by all damage sources by 25% for 1/5th of a day duration."]
				}
			]
		}
	},
	{
		"Spear":
		{
			"Description": "A versatile weapon that promotes pushing enemies back to create space for themselves to strike hard.",
			"CharList":
			[
				{
					"Name": "Xiukai",
					"Summary": "A chef of many dishes who will cook anything and anyone into a dish.",
					"Color": "#ff9f9f",
					"Main": true,
					"Image": "erwimages/chars/Xiukai.png",
					"Lore": "Stop gazing, or I will fill that dumpling with you.<br><br>Xiukai is a Chinese cook running his own small restaurant in Daegu, South Korea.<br><br>He used to be a cook for one of the closest associates of a high-ranking government official. His connections, and pockets, ran deep.<br><br>After his boss was disposed of overnight, he escaped to South Korea.<br><br>He claims that he was once skinny with an elegant posture...<br><br>He is good at controlling himself, taking from his experience serving his former boss.",
					"Description": "Spear Xiukai can be even tankier than with a Dagger, capable of adding even more HP in a shorter amount of time with extra resources and extra stack gaining. Xiukai snowballs very hard with more stacks and becomes not only a very difficult to kill character, but also a burst heavy damage dealer.",
					"Role": "Tank or Fighter",
					"Difficulty": "Hard",
					"Power Spike": "Late Game",
					"HP": "140",
					"Basic Attack": "10 damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Lost in the Sauce (1 day cooldown) - Throw a can of sauce at someone, dealing 10 damage to a target and slowing them, increasing their cooldowns by 10%.",
						"Heavy Meal (1 day cooldown) - Slam the ground with your wok, dealing 10 damage to all enemies in the current zone and slowing them, increasing their cooldowns by 20%. If they have a status, deal an additional 0 + (attack power) damage.",
						"Wok it Off (1 day cooldown) - Spin with your wok, dashing to an adjacent zone, or dash to a target in the current or adjacent, deal 0 + (attack power) damage to them, and stun them for 1/10th of a day if they have a status.",
						"Cooking Materials (1 day cooldown) - Search your spare cooking materials, choosing a cooking material to gain."],
					"Level 4": ["Burnt to a Crisp (3 day cooldown) - Fire up your mobile kitchen, dealing 0 + (stacks) damage 3 times to all enemies in the current zone, becoming status immune for each attack, each taking 1/10th of a day. Deal an extra 10 damage each time to enemies with a status on them.",
						"Shadow Stab (1 day cooldown) - Shove someone with your spear, pushing the target into another zone and deal 15 damage."],
					"Level 7": ["Eat Good (Food/Drink required) - Throw a piece of food or drink at someone, dealing the amount of damage that would be usually healed to them.",
						"Unlock Let Me Cook.",
						"Unlock Food Catering."],
					"Level 10": ["Armored Cook (4 day cooldown) - Prepare your kitchen, gaining a shield the size of your stack count as HP permanently."],
					"Passives": ["Juggernaut Chef - Gain 3 stacks per Uncommon food or drink cooked, 5 stacks per Rare food or drink cooked, and 10 stacks per Epic/Legendary food or drink cooked. Each stack gives 1 HP.",
						"Let Me Cook (Level 7) - Gain 1 chosen status immunity for 1/5th of a day per food cooked this day.",
						"Food Catering (Level 7) - Gain 5 stacks of Juggernaut Chef a day."]
				}
			]
		}
	},
	{
		"Special":
		{
			"Description": "A special category for characters that do not use a typical weapon type. Usually has a designated weapon skill or ability that is loosely tied to the category of weapon that is used.",
			"CharList":
			[
				{
					"Name": "Dmitri",
					"Summary": "A veteran hacker who broke into many systems with his ability to use his mind to communicate with hardware.",
					"Color": "#d3d3d3",
					"Main": true,
					"Image": "erwimages/chars/Dmitri.png",
					"Lore": "No one is safe from my reach.<br><br>Dmitri is an expert hacker who is known for breaking into systems without a trace, thanks to his experience and connection to hardware. Dmitri is capable of changing the flow of life by using both his computer, his smart monocle, and his mind.<br><br>Once Dmitri was designated by his hacking group to try to break into one of the greatest banks of all time. He was able to get in, drain every last penny out of this bank, and make them bankrupt instantly, vanishing with the money without a trace.<br><br>Dmitri was a wanted man in every single country in both the west and east, forcing him to go into hiding by entering some experiments.",
					"Description": "Dmitri is a character designed to be an artillery support, constantly using utility to break the game entirely from afar. Dmitri is extremely complex in that he accesses a different map and minigame that others do not have access to, allowing him to slowly make zones beneficial for his allies and himself.",
					"Role": "Support or Mage",
					"Difficulty": "Hard",
					"Power Spike": "Mid Game",
					"HP": "100",
					"Basic Attack": "None",
					"Basic Attack Cooldown": "N/A",
					"Level 1": ["Zone Hacking (1 day cooldown) - Hack a zone, increasing your Detection and decreasing their Security Meter in the zone. This enters the matrix, putting yourself in stasis for 1/5th of a day. The matrix is a unique map that has security measures and defenses. Your character must leave the matrix in 1/5th of a day, or else you will be out of stasis and vulnerable.",
						"Reward Hacking (1 day cooldown) - Hack a target, confusing them and making them forget who their allies are for 1/6th of a day.",
						"SQL Injection (1 day cooldown) - Hack a target by adding a row to the database, giving them an extra stat of choice for 1 day between 10 HP, 2 Attack Power, or 5 Credits.",
						"Matrix Only:",
						"Matrix Fist (1/10th day cooldown) - Deal 10 damage to a matrix defense system.",
						"Matrix Defense (1/5th day cooldown) - Reduce the next attack by 30 damage in the matrix.",
						"Matrix Heal (1/5th day cooldown) - Heal 20 HP in the matrix."],
					"Level 4": ["Matrix Multiplication (2 day cooldown) - The next time you enter the matrix, gain 40 HP.",
						"Denial of Service (1 day cooldown) - Spam a target with internet traffic to stun a target for 1/10th of a day.",
						"Embedded Systems (2 day cooldown) - Scan the area with your monocle, revealing any invisible enemies in your current or adjacent zones, also revealing any terrain changes or effects in any of these zones.",
						"Matrix Only:",
						"Matrix Run (1 day cooldown) - Move twice towards the exit.",
						"Matrix Drone (1 day cooldown) - Summon a supporting defense matrix drone which deals 10 damage to anyone who attempts to attack you in the matrix."],
					"Level 7": ["Capture the Flag (2 day cooldown) - A flag randomly spawns in a non-adjacent and current zone. If you collect this flag physically or hack this zone, decrease your Detection in this zone to 0 and reset your movement cooldown.",
						"Revert Changes (1 day cooldown) - Delete all logs and traces of your interaction with the hardware in a zone, rolling back your Detection in that zone.",
						"Unlock Parallel Processing.",
						"Increase SQL Injection’s power to 20 HP, 5 Attack Power, or 10 Credits."],
					"Level 10": ["Unlock High Performance Computing.",
						"Matrix Only:",
						"Matrix Bomb (2 day cooldown) - Destroy all matrix enemies in the matrix."],
					"Passives": ["Cloud Computing - Every ability can be used from any distance, however, abilities cannot be used on targets in the same zone unless otherwise specified.",
						"Old Timer - Start the game at Level 3.",
						"Security Meter - Every zone can be hacked up to 5 times, adding properties to each of these zones.<br>1 Security Meter: Increase all allies damage reduction by 5 to basic attacks and abilities.<br>2 Security Meter: Reduce enemy healing by 25% in the zone.<br>3 Security Meter: Gain permanent vision of the zone.<br>4 Security Meter: Heal all allies by 20 damage per 1/10th of a day they stay in the zone.<br>5 Security Meter: Deal 50 damage to any enemy in the zone for every 1/10th of a day they stay in the zone.",
						"Detection - Consecutive hacks to the same zone over the same day will result in increasing the Detection in the zone. The max Detection is 3, which will increase the threats in the matrix. Detection resets for all zones after 2 days.<br>Enemies in the matrix are the following:<br>Detection 1:<br>Matrix Secure Constraint - 10 HP, 5 AP, can only attack once every 1/5th day.<br>Detection 2:<br>Matrix Trigger - 10 HP, 5 AP, can only attack once every 1/5th day, but can attack from adjacent zones.<br>Matrix Encryption - 10 HP, can only heal other Matrix defenses for 5 HP every 1 day.<br>Matrix Secret Key - 20 HP, can root you for 1/10th of a day every 1/5th day.<br>Detection 3:<br>Matrix Database Control System - 30 HP, 10 AP, can only attack once every 1/10th day.<br>Matrix Access Denial System - 30 HP, can stun you for 1/10th of a day every 1/10th day.",
						"Matrix - The Matrix is a unique map and scenario where you must escape in 1/5th of a day. The stats of your character in the matrix are 1/2th of your current stats, unless otherwise stated. You can move with 1/20th day cooldown in the matrix. If you die or run out of time in the Matrix, you take 30 damage out of the matrix and increase the Detection by 1.",
						"Parallel Processing (Level 7) - Decrease movement cooldown to 1/2th day cooldown, along with having 1/2th day cooldown on Zone Hacking.",
						"High Performance Computing (Level 10) - Every hack decreases 3 Security Meter bars instead of 1."]
				},
				{
					"Name": "JP",
					"Summary": "A hacker with a variety of technological tricks that will break any program or project in a matter of seconds.",
					"Color": "#ffd966",
					"Main": true,
					"Image": "erwimages/chars/JP.png",
					"Lore": "This network will be the path to my salvation and your downfall.<br><br>He likes to go by his nickname because he thinks his name is rustic. JP tries to stay away from the right path because of his unyielding nature.<br><br>As he is a high school dropout, he makes a living by selling personal information from hacking all kinds of websites.<br><br>He sometimes tries an esoteric fashion and poses, developing his own taste of fashion.<br><br>His fragile bones are a byproduct of his love for cola.",
					"Description": "JP is a unique character designed by Deadphisher, reliant on building stacks of hacking in order to control the game through utilities like turning zones into red zones or using other seemingly broken abilities like mass stasis and powerful redirections and crowd control. JP does not have any direct combat damage.",
					"Role": "Unique",
					"Difficulty": "Very Hard",
					"Power Spike": "Late Game",
					"HP": "80",
					"Basic Attack": "None",
					"Basic Attack Cooldown": "N/A",
					"Level 1": ["Exploit (1 day cooldown) - Hack into nearby remote drones and order 1 uncommon material with a 5% chance of an epic material.",
						"Infrared Vision (2 day cooldown) - Hack into an area-wide CCTV security system, showing the location of all enemies for 1/10th of the day.",
						"Attempt Hack (1/2 day cooldown) - Use your Network PC and attempt to hijack the experiment in progress. For every use of this ability, JP gains a stack of \"GPS\" and gains a stack of \"On the Run\". Gains 3 XP.",
						"Network Connection (7 stacks of GPS) - Channel for 1/2 day to apply the finishing touches on the path to your success. Establish an uplink connection with all nearby electronics. JP can only maintain the connection while staying in a zone and loses the connection upon moving to a different zone.",
						"System Shutdown (Network Connection Established, 2 attempts per day until activation, 0% base chance, 1 use upon success and can choose when to activate.) - Select one zone, all other zones become red zones and all test subjects and players besides JP are stunned for 1/10th day. All enemies take 30% extra damage from all sources."],
					"Level 4": ["Smoke Bomb (3 day cooldown) - Blind all enemies in your current zone and grant invisible for 1 day.",
						"Denial of Service (1 day cooldown) - Spam a target with internet traffic to stun a target for 1/10th of a day.",
						"Upload Ransomware (Network Connection Established, 2 day cooldown) - Upload Ransomware into the network, applying a stasis to an ally and an enemy. This stasis cannot be broken by any means until the ransom of 5 credits is paid. The stasis automatically ends after 1 day.",
						"Upload Adware (Network Connection Established, 2 day cooldown) - Upload Adware into the network, causing 2 targets to have a 50% chance for their next action to fail. If the action does not fail, they will be silenced for 1/10th of a day. (This ability acts as if the target's ability went through, applying cooldowns, charge removal, etc.)",
						"Install Spyware (1 day cooldown) - Spy on a target with spyware, following them and finding all their actions today.",
						"Unlock Spoofing.",
						"Unlock Phishing."],
					"Level 7": ["Cola Run! (2 day cooldown) - Order cola from the island drones that are delivered to two random zones not adjacent to each other. If you have \"Network Connection\" and move to a zone with a cola, \"Network Connection\" isn't lost. Once you collect a cola, you gain a shield that blocks the next attack. This shield lasts for 1 day and automatically breaks at the end of the day or when attacked.",
						"Rollback (2 day cooldown) - Restore your system to a previous state, returning all health lost over 1/10 of a day.",
						"Upload Malware - (Network Connection Established, 1 day cooldown) - Upload Malware into the network, overriding a target’s next ability target and choosing your own target. You will learn the ability used beforehand.",
						"Unlock Encryption."],
					"Level 10": ["Zero Day (Network Connection Established, 1 use) - Increase the chances of finding the \"System Shutdown Code\" by an additional 2% for each GPS stack. The extra odds only apply to the next attempt of \"System Shutdown\"",
						"Breaking the Rules (3 day cooldown) - Channel for 1/2 of a day. Open all red zones the next day for 1 day. All red zones close back off at the end of the day."],
					"Passives": ["Backdoor - Before the experiment started, you were aware you were going to be dragged into this mess and made a backdoor out. Every day you gain an additional level and 10 extra credits. If you are the last left alive, you gain an escape cuff.",
						"Network PC - Your network pc is equipped with a GPS specifically designed to track a code to shut the experiment down for good. For every stack of \"GPS\", increase the chances of finding the \"System Shutdown Code\" by 5%. Lose 1 stack of GPS every time you move and lose 1 stack every other day.",
						"On the Run - You're a notorious hacker and being hunted. For every stack of \"On the Run\", after using \"Attempt Hack\" the chance of taunting enemies in the current and adjacent zones for 1/10th of a day increases by 10%.",
						"Remote Access (Network Connection Established) - While JP has a network connection established, he is immune to debuffs and can target any target on the map.",
						"Spoofing (Level 4) - After every use of \"Attempt Hack\", you have a 15% chance to gain evasion for 1/10th of a day.",
						"Phishing (Level 4) - Whenever you are attacked, you gain full knowledge of what attack hit you and from where.",
						"Encryption (Level 7) - Gain 1 extra move per day. When you move from an area, you no longer lose \"GPS\" stacks and lose 1 stack of \"On the Run\"."]
				}
			]
		}
	},
	{
		"Throw":
		{
			"Description": "Supportive or heavy damage dealing characters that can use vision blocking and spellcasting to their advantage.",
			"CharList":
			[
				{
					"Name": "Adriana",
					"Summary": "An arsonist who wants to set the world on fire through numerous methods of dousing and spreading the fire.",
					"Color": "#ff9f9f",
					"Main": true,
					"Image": "erwimages/chars/Adriana.png",
					"Lore": "It's kinda chilly... Where'd I put that match?<br><br>Where there's smoke, there's fire... and Adriana. She gained infamy after widespread arson cases popped up throughout Mexico, striking fear into the hearts of its citizens.<br><br>She'll engulf empty buildings in flames and turn abandoned factories to ash, all while keeping her pipe comfortably in her mouth.<br><br>She's often heard speaking to the empty sky above or calling someone's name. Who's she talking to?",
					"Description": "Throw Adriana is a spellcaster with significant CC and DoT effects, including area of effect abilities that can zone out enemies. Adriana is generally built around sustaining damage on enemies using DoT, to slowly burn away enemies, even at earlier stages of the game.",
					"Role": "Support or Mage",
					"Difficulty": "Medium",
					"Power Spike": "Early-Mid Game",
					"HP": "100",
					"Basic Attack": "5 damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Flamethrower (1 day cooldown) - Shoot a stream of fire, dealing 10 + (attack power) damage to a target and setting them on fire, or set an oil slick in the current or adjacent zone on fire and burn the zone.",
						"Oil Slick (1/2th day cooldown) - Place oil on the current or adjacent zones. This oil can be set on fire for the next day before disappearing. Oil slows all enemies in the zone, increasing their cooldowns by 10%, until they leave that zone. Douses enemies.",
						"Fire Escape (1 day cooldown) - Set a trail of fire, dashing to an adjacent zone of the map, setting any oil slick on fire in either zone.",
						"Douse (1/4th day cooldown) - Douse a target with oil. If the enemy is attacked with an ability that sets oil on fire, the enemy will be burned and undoused."],
					"Level 4": ["Cocktail Party (1/2th day cooldown) - Shoot a molotov cocktail, dealing 10 + (attack power) damage to a target in this zone or adjacent zones and setting them on fire, stunning them for 1/10th of a day.",
						"Smokescreen (2 day cooldown) - Smoke the zone, setting an adjacent zone or current zone to blind all enemies within this day.",
						"Ignite (1 day cooldown) - Burn all doused targets, removing douse and applying burn to all of them."],
					"Level 7": ["Wall of Fire (1 day cooldown) - Creates a flaming wall between the current zone and an adjacent zone for the next day. Enemies who enter or exit the zone become burned.",
						"Black Napalm Spray (1 day cooldown) - Spray a special napalm on someone, checking a doused or burning target, learn their character and HP and increase any burn on them by 1/8th of a day.",
						"Unlock Call of the Flame."],
					"Level 10": ["Inferno Blast (2 day cooldown) - Set a zone on fire permanently, inflicting burn on all enemies there.",
						"Unlock Napalm Fuel Tank."],
					"Passives": ["Pyromaniac - Burn DoT deals 10 damage and slows the target, increasing cooldowns by 10%. Zones set on fire are set on fire for 1 day. Damage is applied each time the target is burned.",
						"Call of the Flame (Level 7) - Burning and doused targets burning from you are seen globally.",
						"Napalm Fuel Tank (Level 10) - Burn DoT deals 10% max HP damage in 1/5th of a day."]
				},
				{
					"Name": "Sissela",
					"Summary": "A diseased child with a unique sentient ball which can be used to control the battlefield to her advantage.",
					"Color": "white",
					"Main": true,
					"Image": "erwimages/chars/Sissela.png",
					"Lore": "Life is an agony. Only more agony awaits to greet me.<br><br>Suffering from an incurable disease affecting only a hundred in the world, Sissela has been hospitalized since her diagnosis at a very young age. Despite the uncountable attempts to free herself from her extreme and constant pain, she couldn’t easily end her life.<br><br>A rare specimen in medicine, she was supported with experimental treatments and fully paid medical bills. To her, it seems that she is being kept alive merely for the sake of continuing research.<br><br>She is often expressionless and does not talk much. Often isolated, she habitually draws faces on things and gives them names to talk to them. She feels pretty awkward talking to other people.",
					"Description": "Throw Sissela is a pull and shielding based support, or a spellcaster that deals significant damage through mass area of effects and lowering HP to deal more damage from range. Sissela builds around stacking damage until she can burst enemies quickly.",
					"Role": "Support or Mage",
					"Difficulty": "Medium",
					"Power Spike": "Mid-Late Game",
					"HP": "120",
					"Basic Attack": "5 + (attack power) damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Go Get Em’ Wilson! (5 HP, 1/2th day cooldown) - Send Wilson to attack, dealing 5 + (attack power) damage to a target in the current or adjacent zone. Can send Wilson to an adjacent zone without a target. Wilson will give vision there.",
						"Girl in a Bubble (1 day cooldown) - Enter a bubble with Wilson, becoming invulnerable and immune to all statuses for 1/6th of a day.",
						"Play With Us! (5 HP, 1 day cooldown) - Send Wilson to play, dealing 15 damage to the target in a zone adjacent to Wilson’s zone, and pulling them to Wilson. If you pull yourself or an ally, give a shield of 10 HP.",
						"Back To Me Wilson! (1/4th day cooldown) - Move Wilson back to the current zone you are in."],
					"Level 4": ["Free at Last (20 HP, 3 day cooldown) - Set yourself free, dealing 15 + (attack power) damage to all enemies on the map.",
						"Smokescreen (2 day cooldown) - Smoke the zone, setting an adjacent zone or current zone to blind all enemies within this day.",
						"Unlock Return to Sender."],
					"Level 7": ["A Life For A Life (5 HP, 2 day cooldown) - Hurt yourself a bit, but make a target immune to a status for this day.",
						"Protect Em’ Wilson! (5 HP, 1 day cooldown) - Send Wilson to protect someone, giving a shield of 40 HP to a target in the current or adjacent zone. Wilson will give vision there.",
						"Reduce your basic attack cooldown to 1/2th day cooldown."],
					"Level 10": ["A Little Pinprick (10 HP, 1 day cooldown) - Hurt yourself a bit, but heal 50 HP in 1/5th of a day."],
					"Passives": ["Agony - Gain 1 attack power every 10 less HP you have. You cannot kill yourself by draining all your HP. Every day she heals for 10 HP.",
						"Return to Sender (Level 4) - After moving Wilson, the next basic attack deals 15 extra damage and heals for 10 HP."]
				},
				{
					"Name": "Zahir",
					"Summary": "A ritualist of a temple that saved him as a kid who can cast many spells and curses on enemies.",
					"Color": "#e6d5b6",
					"Main": true,
					"Image": "erwimages/chars/Zahir.png",
					"Lore": "I behold the vision of the Almighty.<br><br>After escaping from an orphanage at a young age, Zahir found himself lost and starving. He arrived at a small Sikh temple and miraculously survived.<br><br>He became a devoted follower, believing that his God had mercifully saved him.<br><br>His morning ritual is to shower and brush his hair with a wooden comb. He sometimes speaks like an angsty teenager, but it's not easily noticed as he seldom speaks.",
					"Description": "Throw Zahir is a sustain based spellcaster that can cast many spells in quick succession to deal sustain damage, or massive area denial through some big area of effect spells. Zahir can either be used for CC to control enemies, or hunt and burst each player down.",
					"Role": "Support or Mage",
					"Difficulty": "Medium",
					"Power Spike": "Early-Mid Game",
					"HP": "100",
					"Basic Attack": "5 damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Narayanastra (1 day cooldown) - Cast a spell of all-seeing, dealing 0 + (attack power) damage to the target. Give 1 charge of Gandiva.",
						"Gandiva (0 charges) - Throw a chakram out, dealing 0 + (attack power) damage to the target.",
						"Vayvayastra (1 day cooldown) - Shoot a tornado, dealing 10 damage and stunning a target for 1/6th of a day. Give 1 charge of Gandiva."],
					"Level 4": ["Bhargavastra (3 day cooldown) - Set an adjacent zone or current zone with a mass rain of chakrams and deal 10 + (attack power) damage to all enemies in the zone, and deal 10 + (attack power) damage to enemies in an adjacent zone of the previous zone next day.",
						"Smokescreen (2 day cooldown) - Smoke the zone, setting an adjacent zone or current zone to blind all enemies within this day.",
						"Prajnastra (1 day cooldown) - Immediately set Eye of Azrael on the closest enemy player without hitting them. If there are multiple people equally as close, choose one randomly.",
						"Bhaumastra (3 day cooldown) - Check a corpse’s character and learn an active ability that the character had, with default cooldowns and charges."],
					"Level 7": ["Prajnastra (1 day cooldown) - Put someone in a large wind funnel, putting them in stasis for 1/5th of a day. Grant 1 charge of Gandiva.",
						"Unlock Eye of Damnation."],
					"Level 10": ["Parvatastra (4 day cooldown) - Mark any zone, in 1/5th of a day, drop a large mountain on the zone, dealing 10 + (attack power) damage and stunning all targets in the zone for 1/6th of a day."],
					"Passives": ["Eye of Azrael - Upon hitting a target, give vision of that target for 1 day.",
						"Eye of Damnation (Level 7) - See all corpses on the map."]
				}
			]
		}
	},
	{
		"Tonfa":
		{
			"Description": "Defensive characters that can tank up and reflect damage, negating burst damage heavily.",
			"CharList":
			[
				{
					"Name": "Hyunwoo",
					"Summary": "A brawler who takes on far too many fights for his own good, but has enough knack for survival and brawling to win them.",
					"Color": "#ff9f9f",
					"Main": false,
					"Image": "erwimages/chars/Hyunwoo.png",
					"Lore": "It couldn't get any worse.<br><br>Hyunwoo had no ambitions or dreams. All he felt was... emptiness. To fill the void within, he turned to the thrill of constantly picking fights and brawls.<br><br>Despite all his attempts, the emptiness and anxiety inside him only grew.<br><br>He has a compulsion for a lottery ticket to be the first thing he buys as an adult.<br><br>Hyunwoo has always been more attached to his friends than his family.",
					"Description": "Tonfa Hyunwoo has even more tankiness, but also has a much more powerful single attack compared to Glove Hyunwoo. Tonfa Hyunwoo has more ability to stun enemies directly and has more burst defensive tools rather than sustain.",
					"Role": "Tank or Assassin",
					"Difficulty": "Easy",
					"Power Spike": "Mid Game",
					"HP": "140",
					"Basic Attack": "10 damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Stomping Foot (1 day cooldown) - Stomp your foot, dealing 5 damage to a target and slowing the target, increasing their cooldowns by 10%.",
						"Bluff (1 day cooldown) - Bluff an attack, becoming immune to statuses for 1/8th of the day.",
						"First Attack (1 day cooldown) - Charge forward, dashing to an adjacent zone, or push both you and a target in the current zone to an adjacent zone, dealing 5 damage to them."],
					"Level 4": ["Haymaker (2 day cooldown) - Charge up a massive punch for 1/10th of a day, dealing 20 + (attack power) damage to a target in the next 1/10th of a day. Can be charged for up to 1/5th of the day, adding an extra 10 damage per 1/10th of a day charged. Counts as both a basic attack and spell, cannot be blinded, disarmed, or blocked by spell shields.",
						"Quick Spin (1 day cooldown) - Spin your weapon, for 1/10th of a day, reflect 100% damage done.",
						"Scrap Wall (2 day cooldown) - Create a makeshift wall between the current zone and an adjacent zone. First Attack stuns anyone hit into the wall for 1/5th of a day and keeps them in the same zone.",
						"Street Brawl (1 day cooldown cooldown) - Yell at all enemies in the current zone, reducing their attack power by 5 this day."],
					"Level 7": ["Unlock Gambling Temptation.",
						"Unlock Endless Void."],
					"Level 10": ["Fight Me! (2 day cooldown) - Taunt a target, redirect all targeted abilities to be used only on you for 1/4th of a day, and return a basic attack to anyone who attacks you.",
						"Riot! (1 day cooldown) - Call for a fight, disrupting all enemies in the zone for 1/10th of a day."],
					"Passives": ["Dogfight - Every third basic attack heals for 10% HP.",
						"Gambling Temptation (Level 7) - Tempt your fate, gambling between gaining 10 initial damage to your first attack and 10 damage reduction in your first attack taken per day.",
						"Endless Void (Level 7, 1 day cooldown) - Upon dropping to 0 HP, gain a shield for 20 HP."]
				},
				{
					"Name": "Isaac",
					"Summary": "A corrupt police officer who knows every underhanded tactic and brute force method to catch any criminal or innocent being alike.",
					"Color": "white",
					"Main": true,
					"Image": "erwimages/chars/Isaac.png",
					"Lore": "I'll show you who's boss.<br><br>Isaac has always been a winner because he has the skills and abilities to keep his rightful place.<br><br>Reason, strength, charisma, eloquence, and cruelty. With his mix of kingly and devilish talents, no one can stop him.<br><br>Isaac rules the battlefield the same way he rules his kingdom: by overwhelming his opponents with strength and skill, and stepping on challengers with his resourcefulness and cynicism.",
					"Description": "Tonfa Isaac is a powerful fighter that wants to get into the fray and deal significant sustain damage while using different kinds of statuses and control to force the fight his way. He can use stasis and pulling and pushing to his advantage heavily.",
					"Role": "Tank or Fighter",
					"Difficulty": "Medium",
					"Power Spike": "Mid Game",
					"HP": "140",
					"Basic Attack": "0 + (attack power) damage (minimum 5 damage)",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Swoop (1 day cooldown) - Swoop in and detain someone, dashing to a target in the current or adjacent zone and dealing 0 + (attack power) damage to them.",
						"Reinforce (1 day cooldown) - Strike someone relentlessly, dealing 0 + (attack power) damage, destroying shields instantly. If you trigger Exploit with this attack, heal 20 HP. Counts as a basic attack.",
						"Hound (1 day cooldown) - Hound and stalk around, dashing to an adjacent zone and reset your basic attack cooldown.",
						"Arrest (Only usable after Hound) - Double down on the warrant, dealing 5 damage to the target in the current or adjacent zone, and pulling them to the current zone."],
					"Level 4": ["The Heavy Hand of the Law (2 day cooldown) - Strike someone hard, dealing 10 damage to a target in the current zone and pushing them to an adjacent zone. If you trigger Exploit with this ability, deal 25% max HP damage to the target and don’t push them.",
						"Quick Spin (1 day cooldown) - Spin your weapon, for 1/10th of a day, reflect 100% damage done.",
						"Plant Drugs (2 day cooldown) - Arrest a target, disrupting them for 1/5th of a day, dealing 5 damage, and putting drugs on the target. If the target is killed, reset the cooldown of this ability."],
					"Level 7": ["Unlock Corrupt Detective."],
					"Level 10": ["Group Therapy (2 day cooldown) - Talk to everyone in a psychological debate, dealing 10 damage and putting all enemies in the current zone in stasis for 1/10th of a day; disrupt and blind them for 1/10th of a day after.",
						"STING (2 day cooldown) - Arrest an enemy, putting them in stasis for 1/3rd of a day and move yourself and the enemy to another zone."],
					"Passives": ["Exploit - Hitting a target 4 consecutive times with damage will deal 10 extra damage, decrease your cooldowns by 10%, and heal for 10 HP.",
						"Corrupt Detective (Level 7) - Spend 5 credits to get some potent information and 5 attack power. Can stack."]
				},
				{
					"Name": "Jan",
					"Summary": "A muay thai fighter that specializes in kickboxing and fighting with an endless barrage of attacks.",
					"Color": "#b6d7a8",
					"Main": false,
					"Image": "erwimages/chars/Jan.png",
					"Lore": "Time for some action!<br><br>Jan is the eldest son of a famous Muay Thai athlete and a kickboxer who always puts on an entertaining show. Along with his showmanship, his public volunteer work helped him gain a number of fiercely loyal fans.<br><br>Jan and his younger brother started learning Muay Thai while studying abroad, but he was involved in a violent altercation one night, causing his father to send him back to the Netherlands and disrupting his life.<br><br>He entered a rebellious phase, often turning to violence and relying on substances, but was able to overcome it through sheer will and eventually debuted as a kickboxer.<br><br>Outside the fight, he is usually cheerful and light, the moment the first bell rings, it's like a switch is flipped inside his head. Jan's trademark is his agility and barrage of seemingly endless attacks.",
					"Description": "Tonfa Jan is a strong fighter that pushes for more spellcasting. Jan can do a more sustained fighting style around landing many abilities used, or a defensive playstyle with blocking damage and returning statuses against enemies. In addition, he has a multitude of strong CC tools to peel and initiate for his teams.",
					"Role": "Tank or Fighter",
					"Difficulty": "Hard",
					"Power Spike": "Early-Mid Game",
					"HP": "140",
					"Basic Attack": "10 damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Knee Strike (1/2th day cooldown) - Kick someone with your knee, dealing 10 damage to a target and slowing the target, increasing their cooldowns by 5%. Spend 5 Unyielding to decrease the target’s attack power by 5 for today.",
						"Tomahawk Roundhouse (2 day cooldown) - Roundhouse Kick someone, dealing 10 + (attack power) damage and knocking back a target to an adjacent zone. Spend 5 Unyielding to knock back all enemies in the zone.",
						"Bob and Weave (1 day cooldown) - Dash to an adjacent zone of the map and reset your basic attack cooldown. Spend 5 Unyielding to reset the cooldown of Knee Strike, Tomahawk Roundhouse, and Backward Kick.",
						"Leaping Knee (Only usable after Knee Strike) - Kick someone fiercely, dealing 0 + (attack power) damage and stunning the target 1/10th of a day. Spend 5 Unyielding to reset the cooldown of Bob and Weave, Elbow Strike, and Hook Kick."],
					"Level 4": ["The Tetragon (3 day cooldown) - Instantly gain 5 stacks of Unyielding. Summon ropes around the zone for 1 day, dealing 10 damage to all enemies who attempt to leave, and slowing them, increasing their cooldowns by 30%. In addition, hitting an enemy with a knockback will not knock them back, but stun them in the zone for 1/5th of a day.",
						"Quick Spin (1 day cooldown) - Spin your weapon, for 1/10th of a day, reflect 100% damage done.",
						"Unlock Unrelenting Champion."],
					"Level 7": ["Backward Kick (2 day cooldown) - Kick with both legs backward, dealing 10 damage and knocking a target back to an adjacent zone. Knock yourself into another adjacent zone. Spend 5 Unyielding to allow yourself or the target to stay in the same zone or move to the chosen adjacent zone.",
						"Elbow Strike (1 day cooldown) - Put up your elbows and strike a target, blocking damage in the next 1/10th of a day, stunning the target for 1/10th of a day, and dealing 10 damage to them. Spend 5 Unyielding to also disrupt and root them for 1/10th of a day.",
						"Hook Kick (2 day cooldown) - Kick a target from an adjacent zone with a hook at your feet, pulling them into your zone, and dealing 5 damage to them. Spend 5 Unyielding to also remove all damage reduction effects."],
					"Level 10": ["The Tetragon cooldown is lowered to a 2 day cooldown, Tomahawk Roundhouse Kick, Backward Kick, and Hook Kick is lowered to a 1 day cooldown."],
					"Passives": ["Unyielding - Gain a stack of Unyielding every basic attack or ability use. Some abilities allow you to spend stacks of Unyielding in order to enhance the ability.",
						"Unrelenting Champion (Level 4) - Every Unyielding ability heals you for 10% HP."]
				},
				{
					"Name": "Leon",
					"Summary": "A surfer and soldier that likes cuteness despite his strength as a fighter.",
					"Color": "#c9daf8",
					"Main": false,
					"Image": "erwimages/chars/Leon.png",
					"Lore": "The weak always fall behind.<br><br>Leon was raised by a highly decorated soldier who always drilled the importance of \"manliness\" into him.<br><br>He was always under immense pressure to not show any weakness, both from himself and others. The suppression of his feelings caused them to manifest themselves as a desire for material possessions - particularly \"cute\" things.<br><br>Leon has tons of pictures of kittens on his phone and was caught in his room wearing rather... cute clothing once or twice.",
					"Description": "Tonfa Leon is extremely status heavy, with many ways to apply statuses through huge stuns and knockbacks. Leon with this weapon relies on more damage reduction and placement of pools to manipulate the battlefield to his advantage and territorial control, in order to set up combos that can do high damage.",
					"Role": "Tank or Assassin",
					"Difficulty": "Medium",
					"Power Spike": "Mid-Late Game",
					"HP": "140",
					"Basic Attack": "10 damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Waterway (1/2th day cooldown) - Create a waterway, dealing 0 + (attack power) damage to all enemies in an adjacent zone and another adjacent zone after that, and spawning a pool in both zones.",
						"Cannonball (1 day cooldown) - Create a water bubble on someone, shielding 30 HP on a target, the target deals 10 extra damage in the next three basic attacks and abilities they cast. Spawn a pool in the current zone.",
						"Duck Dive (1 day cooldown) - Dive to a zone that has a pool in it, dealing 0 + (attack power) damage and stunning any enemies in it for 1/8th of a day.",
						"Torrent (1 day cooldown) - Shoot a torrent in a zone with a pool, dealing 0 + (attack power) damage and stunning any enemies in it for 1/8th of a day."],
					"Level 4": ["Surf’s Up (2 day cooldown) - Surf up a huge wave, dealing 10 + (attack power) damage to all enemies in the zone, and knocking them back to an adjacent zone. Spawns a pool in the current zone.",
						"Quick Spin (1 day cooldown) - Spin your weapon, for 1/10th of a day, reflect 100% damage done.",
						"Unlock Geyser."],
					"Level 7": ["Cute but Deadly (1 day cooldown) - Drop a fish in the current or adjacent zone, creating a pool, and in 1/10th of a day, a shark comes up and rips through the zone, dealing 0 + (attack power) damage to all enemies in the zone.",
						"Wave of Mutilation (2 day cooldown) - Create a huge wave from a border zone from the edge of the map toward your current zone, pushing any enemy a zone closer to you."],
					"Level 10": ["Mass Torrent (2 day cooldown) - Shoot a torrent in every single zone with a pool, dealing 0 + (attack power) damage and stunning any enemies in it for 1/8th of a day.",
						"Navy Fleet (1 day cooldown) - Call the navy fleet, dropping a ship and creating a pool in the current or adjacent zone, giving all allies 20 damage reduction, dealing 10 damage to all enemies, and removing all enemy damage reduction in the zone."],
					"Passives": ["Human Torpedo - Gain vision in a zone with a pool. Pools last for 1 day.",
						"Geyser (Level 4) - Every third basic attack creates a pool in any adjacent zone that you select."]
				}
			]
		}
	},
	{
		"Two Handed Sword (2H)":
		{
			"Description": "Standard defensive weapon that can hit decently hard with different effects and sustain warfare.",
			"CharList":
			[
				{
					"Name": "Jackie",
					"Summary": "A serial killer who wants to mass murder anyone she can to sate her hunger.",
					"Color": "#ff9f9f",
					"Main": false,
					"Image": "erwimages/chars/Jackie.png",
					"Lore": "More...more...more!!<br><br>Jackie first discovered the thrill of murder after killing the wife and daughter of a prominent political family, the Winslairs. She went on to become a serial killer with a bodycount of over 30 people.<br><br>Her name 'Quilt' comes from her modus operandi of slicing the victims' bodies into small indistinguishable pieces. The resulting pieces are too small to identify, unless stitched together like a quilt.<br><br>She gained infamy for her rather inhumane killing methods and meticulous clean-up.<br><br>The body of Jackie's first victim, Angela Winslair, was never found.",
					"Description": "Two Handed Sword Jackie is a bit slower than Dagger, but equally as safe and generally very capable of fighting early anyway. Jackie can support a bit by using different utilities, like DoTs, vision, and checking statistics on other enemies. Jackie can still endlessly chase enemies and do massive sustain damage, but 2 Handed Sword is less damage heavy and more durable.",
					"Role": "Tank or Fighter",
					"Difficulty": "Easy",
					"Power Spike": "Mid Game",
					"HP": "140",
					"Basic Attack": "10 + (attack power) damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["Hack and Slash (1/2th day cooldown) - Hack and slash someone, dealing 5 damage twice to a target and applying a DoT bleed dealing 0 + (attack power) damage in 1/8th of a day.",
						"Adrenaline Burst (1 day cooldown) - Fuel yourself for battle, reducing cooldowns by 5% and have the next basic attack heal for 10 HP.",
						"Leaping Strike (1 day cooldown) - Jump up, dashing to an adjacent zone, or dash to a target in the current or adjacent and deal 5 damage to them.",
						"Bloodied Vision (1 day cooldown) - Use your bloodied senses, checking a bleeding target that is bleeding from you, learning their character."],
					"Level 4": ["Chainsaw Massacre (1 day cooldown) - Take out a menacing chainsaw, having the next basic attack apply a DoT bleed dealing 0 + (attack power) damage in 1/8th of a day. Reactivate your chainsaw to deal 20 damage to a target.",
						"Parry (1 day cooldown) - Parry all attacks, becoming invulnerable and immune to all statuses for 1/5th of this day, unable to do anything during the parry.",
						"Unlock Thirst."],
					"Level 7": ["Blood Hunger (1 day cooldown) -  Make someone hungry for blood, choosing a target, the next basic attack the target uses will heal the target for 50% of their damage done.",
						"Unlock Hungry for Murder.",
						"Unlock Blood Hunt."],
					"Level 10": ["Bone Breaker (1 day cooldown) - Break someone’s entire skeleton, dealing 25 damage to a target, applying silence, disarm, root, disrupt, and stun on them for 1/5th of a day. Cannot be done to the same target."],
					"Passives": ["Bloodfest - Gain 10 attack power for 1 day upon killing a player.",
						"Thirst (Level 4) - Bleeding targets bleeding from you are seen globally.",
						"Hungry for Murder (Level 7) - Enemies that are under 30% HP are seen globally.",
						"Blood Hunt (Level 7) - Bleeding targets bleeding from you have their HP shown to you."]
				},
				{
					"Name": "Yuki",
					"Summary": "A swordsman with a perfect posture and clean composure, able to slice any target with precision.",
					"Color": "#d3d3d3",
					"Main": true,
					"Image": "erwimages/chars/Yuki.png",
					"Lore": "Is there anything I can do for you?<br><br>A sharp high school student, Yuki is a member of the kendo club with flawless demeanor and decorum.<br><br>He never loses his composure and takes on new challenges with the confidence of a seasoned vet.<br><br>His perfectionism is sturdy, yet fragile, like a fortress of ice and glass.",
					"Description": "Two Handed Sword Yuki is a very standard sword fighter with burst mechanics and area of effect abilities, along with some CC and durable abilities. Yuki is rather versatile and can play for different directions of play, usually needing a bit of time to become rather strong with a 2 Handed Sword.",
					"Role": "Tank or Fighter",
					"Difficulty": "Medium",
					"Power Spike": "Mid Game",
					"HP": "140",
					"Basic Attack": "10 + (attack power) damage",
					"Basic Attack Cooldown": "1 day cooldown",
					"Level 1": ["From Head to Toe (1 day cooldown) - Strike someone, dealing 10 + (attack power) damage to a target and slowing them, increasing their cooldowns by 10%. If a cufflink was used, stun them for 1/8th of the day too.",
						"Button Up (2 day cooldown) - Prepare yourself and button your suit, gaining back max cufflinks.",
						"Dashing Gentleman (1 day cooldown) - Elegantly dash to an adjacent zone, or dash to a target in the current or adjacent, dealing 5 damage to them, and disarming them for 1/8th of a day."],
					"Level 4": ["Coup de Grace (3 day cooldown) - Strike hard and fast with a powerful swordsman technique, dealing 10 damage today to all enemies in the current zone, deal 25% max HP damage and slow everyone hit by the ability, increasing their cooldowns by 50%. Instantly kills wild animals.",
						"Parry (1 day cooldown) - Parry all attacks, becoming invulnerable and immune to all statuses for 1/5th of this day, unable to do anything during the parry.",
						"Detailed Perfection (1 day cooldown) - Scan a target’s lack of perfection, checking if the target dealt damage to a player last day and seeing their attack power. Regain 2 Cufflinks."],
					"Level 7": ["Disarming Strike (1 day cooldown) - Attempt to prevent someone from using weapons, dealing 5 damage to a target and disarming them for 1/8th of a day. If a cufflink was used, deal an additional 5 + (attack power) damage.",
						"Weak Point Identification (2 day cooldown) - Read your opponent’s weak points, checking if the target had any status immunities between last and this day. Your next attack disables a status immunity of choice."],
					"Level 10": ["Flawless Victory (2 day cooldown) - Perfectly execute your plan, if you kill or help kill an enemy this day, gain 10 attack power, be invulnerable and immune to all statuses for the rest of the day, and instantly gain 4 cufflinks.",
						"Perfect Stance (4 day cooldown) - Perfectly hold a stance, granting a shield for 30 HP permanently. Until the shield is broken, you have immunity to stuns and roots."],
					"Passives": ["Perfect Fit - Store 4 cufflinks, each cufflink will deal an extra 10% max HP damage on any damaging ability or basic attack use. Cufflinks regenerate upon staying out of combat after 1/4th of a day (not doing any damage for 1/4th of a day), or by using specific abilities."]
				}
			]
		}
	},
	{
		"VF Prosthetic":
		{
			"Description": "Echion players zzz",
			"CharList":
			[
			]
		}
	},
	{
		"Whip":
		{
			"Description": "Not done yet",
			"CharList":
			[
			]
		}
	}
]